{"meta":{"epsilon":0.009986238554120064},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[159,18,70,59,139,122,200,58,102,113,55,61,66,222,11,190,76,70,126,190,20,2,201,62,62,248,140,62,253,219,62,62,101,245,171,62,215,94,161,190,200,243,190,190,129,57,163,190,129,95,35,62,5,18,203,190,198,231,103,190,108,83,8,191,93,110,223,60,187,236,54,62,135,184,129,190,206,148,23,62,118,221,69,190,195,195,142,190,203,254,138,62,93,107,206,62,231,202,77,191,80,230,68,62,232,211,92,61,27,111,47,61,211,155,157,190,42,201,169,62,121,153,56,61,19,151,144,62,250,165,229,62,180,218,183,189,48,97,179,190,111,0,45,63,17,153,165,62,222,175,118,62,24,116,60,62,82,118,6,191,235,130,36,62,28,81,101,62,77,50,180,62,172,52,50,191,67,113,19,62,134,5,158,62,72,61,165,189,171,3,87,191,58,191,191,190,4,78,131,62,85,129,113,62,95,176,30,191,11,42,97,189,108,143,47,61,141,34,159,62,223,165,135,62,0,129,248,190,222,140,0,61,228,215,193,190,18,217,40,190,10,104,180,190,102,70,131,190,0,12,128,191,44,84,129,189,105,205,190,186,212,114,98,191,130,110,142,62,17,66,20,187,152,183,130,190,215,5,55,190,152,73,109,63,196,24,15,191,218,206,151,62,119,165,224,188,10,188,218,61,20,81,207,62,98,195,146,189,178,202,228,190,182,175,170,62,55,243,16,190,89,228,190,190,115,15,172,61,98,39,226,190,57,136,58,191,65,103,204,60,174,168,109,190,132,107,10,190,162,110,97,62,92,235,9,61,121,99,27,191,236,77,181,190,163,78,17,62,163,76,36,191,119,41,4,191,218,37,130,62,190,26,39,62,29,253,218,189,128,161,191,190,103,76,68,62,59,113,225,189,59,186,230,61,176,22,229,61,191,67,161,61,251,209,37,63,247,43,76,62,47,4,15,63,152,86,74,63,22,228,100,189,145,106,237,61,88,12,249,59,9,174,190,62,40,180,134,62,35,99,140,190,249,77,70,190,19,233,217,190,182,160,146,59,180,42,179,190,86,247,78,62,178,107,216,190,83,106,236,189,74,82,176,62,103,144,14,63,169,61,171,62,165,123,98,62,236,216,105,62,149,108,252,188,171,194,70,190,10,227,237,188,192,191,42,191,238,17,245,62,156,66,143,61,108,112,74,189,31,23,154,62,236,229,118,190,83,120,3,190,46,251,1,190,1,92,5,63,44,20,69,62,229,81,30,61,38,102,64,62,228,166,178,61,102,156,139,61,241,121,73,190,170,218,14,191,137,240,88,63,72,199,80,61,209,212,139,190,150,250,70,189,231,178,12,61,219,86,98,190,139,44,0,191,207,137,8,63,77,190,89,62,53,105,32,61,234,95,170,189,17,198,140,190,15,34,140,62,143,50,173,59,218,204,198,190,130,81,97,62,27,209,111,190,61,121,124,189,3,87,1,61,137,75,59,190,212,66,250,62,140,23,2,63,141,122,236,59,82,247,163,62,138,10,235,61,12,65,91,189,186,203,128,190,141,82,23,62,127,64,52,62,243,6,74,61,35,142,34,191,204,133,194,62,4,147,67,190,221,44,163,190,13,171,128,61,15,24,253,62,247,210,134,191,79,134,90,190,124,229,145,61,47,211,171,61,169,125,190,189,140,8,175,191,56,93,128,62,132,6,3,189,141,126,195,62,122,27,28,63,152,167,118,191,187,232,152,190,223,186,63,62,165,225,236,189,170,206,249,190,153,154,200,189,187,154,3,62,157,45,24,63,115,71,18,190,55,242,232,188,134,160,168,190,170,255,178,189,16,252,220,190,1,150,198,189,136,100,133,187,246,69,145,190,43,209,254,188,158,40,32,190,13,148,20,61,191,235,7,189,35,165,145,191,73,209,165,189,99,64,107,62,221,121,196,190,191,178,21,190,167,142,143,62,191,241,227,189,104,158,37,191,163,211,153,62,177,207,145,190,173,103,40,190,62,105,138,61,161,133,75,62,189,66,13,63,149,107,254,61,43,224,217,62,84,99,179,61,169,97,22,60,177,199,145,191,171,72,33,191,187,221,101,189,126,244,52,63,15,20,143,62,109,176,104,188,23,230,145,62,84,228,20,191,61,4,109,63,245,1,190,190,135,2,249,188,85,3,189,62,152,56,72,63,70,113,68,190,23,174,146,62,62,247,60,189,110,9,155,191,100,42,138,62,98,186,157,62,182,134,57,190,57,38,194,190,211,53,109,62,79,183,196,188,209,23,43,190,170,175,178,189,39,209,53,61,107,213,97,190,30,184,133,62,133,126,193,60,49,206,233,60,48,164,106,191,49,1,119,62,227,164,135,187,19,130,66,188,189,201,224,189,255,153,81,190,195,78,0,62,224,106,57,60,51,250,251,189,159,209,128,190,93,128,107,189,9,12,244,189,132,98,236,190,44,70,89,190,56,40,2,63,241,191,150,189,65,83,134,59,181,75,10,191,241,215,190,61,239,90,74,190,133,134,33,62,142,155,152,190,3,32,134,190,138,101,97,190,13,92,89,61,107,90,155,190,33,237,248,190,144,43,42,60,51,166,245,189,34,20,15,191,14,157,28,61,182,0,65,61,167,225,228,189,199,227,34,61,236,246,186,62,94,54,245,59,16,241,245,188,241,247,114,62,145,205,136,190,200,40,175,59,99,112,16,62,132,155,161,190,135,37,74,189,244,142,13,190,35,221,158,190,74,25,233,62,208,109,38,189,172,193,11,191,226,66,156,62,122,248,46,190,78,95,166,62,194,26,106,59,117,17,76,189,221,207,99,62,152,104,126,190,39,97,165,62,26,100,21,190,31,168,94,62,69,188,125,189,228,168,251,190,30,252,93,190,205,223,63,189,161,122,193,62,181,107,72,190,148,125,174,62,108,161,27,190,63,94,95,62,83,40,29,190,21,139,44,62,122,160,196,62,206,165,168,189,57,139,30,190,68,84,171,188,34,200,55,189,172,252,127,190,118,138,212,62,213,173,48,62,8,21,178,189,186,35,116,190,14,40,80,62,36,51,187,60,125,179,36,191,82,220,14,63,141,228,211,189,166,51,160,62,62,159,61,62,71,217,167,190,230,217,98,190,221,61,81,190,46,239,99,190,145,226,46,191,79,210,10,61,240,186,139,61,188,94,167,60,250,51,228,190,228,35,16,190,144,57,145,189,28,108,149,190,247,69,252,61,47,80,17,62,169,3,17,62,157,85,255,189,99,79,178,62,83,67,168,190,142,240,4,190,170,89,203,189,182,6,151,62,171,64,162,62,131,218,196,61,117,248,163,190,5,158,179,62,167,180,245,61,77,183,171,189,54,71,242,62,169,197,56,63,74,196,28,62,217,196,23,191,79,171,3,190,129,218,135,189,59,153,2,191,22,109,181,61,138,174,79,190,14,181,252,189,43,190,246,62,19,6,80,62,246,158,211,62,49,99,176,61,87,175,5,191,169,53,184,62,72,9,1,61,68,11,6,62,39,251,25,62,214,28,142,62,243,3,248,61,71,136,65,62,106,253,24,61,42,154,105,190,35,245,48,62,202,30,3,190,13,178,254,62,45,187,39,191,13,114,208,60,212,155,203,62,33,227,5,189,230,174,135,61,55,242,181,62,59,50,16,189,247,31,143,189,171,4,51,62,46,155,239,61,9,149,254,61,221,94,209,60,139,226,95,189,246,116,241,189,93,226,109,62,52,159,1,190,140,233,98,190,168,30,149,189,249,214,246,189,30,161,16,190,54,102,152,62,81,43,96,191,173,23,85,62,183,33,54,191,144,18,79,191,66,101,149,190,145,21,218,62,122,220,73,190,130,170,107,190,162,94,145,61,75,68,227,61,131,251,226,190,220,87,245,190,57,201,102,189,248,157,176,62,157,223,77,61,205,240,185,61,97,45,242,189,82,252,165,62,147,72,85,62,215,237,24,62,29,203,53,63,164,120,110,189,45,133,41,62,28,3,49,191,156,161,6,63,157,53,40,190,66,3,248,62,247,93,157,189,167,202,213,61,21,140,138,189,18,242,57,191,189,225,165,189,107,78,26,61,88,175,72,191,74,199,170,62,10,248,193,189,154,149,74,62,160,173,186,189,103,243,3,189,227,217,12,190,228,167,163,62,234,129,37,189,145,201,19,190,199,99,146,189,211,57,194,189,222,215,200,59,1,49,181,62,79,65,57,189,42,105,57,190,114,116,40,62,214,243,56,60,224,197,165,190,62,13,4,191,12,117,218,61,173,217,32,61,82,184,180,62,71,163,4,190,244,128,139,191,217,166,221,61,213,105,171,61,141,155,235,60,1,208,158,190,38,96,15,63,118,251,24,191,205,233,122,191,135,15,30,189,146,190,89,62,157,25,203,190,7,78,90,61,189,89,229,190,0,232,185,61,225,141,216,189,61,34,64,62,199,230,220,190,82,107,196,60,21,114,54,62,70,184,218,188,48,64,142,62,143,132,244,61,44,137,149,61,190,228,233,190,11,59,83,60,171,136,71,191,29,2,140,62,252,20,247,62,39,141,201,61,58,188,49,62,23,0,54,63,197,126,70,190,179,160,136,62,109,161,253,61,4,108,129,61,118,132,141,62,211,38,33,62,110,126,39,189,115,171,55,61,193,27,243,60,36,203,166,61,173,168,8,63,188,56,4,61,229,211,224,60,40,158,158,189,116,93,21,60,144,175,106,61,228,45,101,191,78,167,220,60,226,133,111,61,191,115,124,191,216,222,113,190,56,255,75,62,145,19,41,189,40,20,191,188,23,97,11,63,164,231,191,61,237,46,7,188,4,101,242,62,37,47,200,62,167,175,170,62,255,26,211,190,41,110,239,61,86,182,114,188,97,195,56,191,175,175,1,190,53,137,169,189,103,122,180,190,234,204,248,190,66,149,102,62,230,152,108,190,94,126,192,61,141,33,214,190,105,65,187,190,120,34,164,190,166,229,32,63,138,211,128,190,69,124,63,62,221,38,15,62,18,156,11,62,211,125,149,191,182,169,199,60,142,114,17,191,255,180,241,62,126,0,21,190,243,4,30,191,24,191,236,190,238,246,16,62,85,131,104,189,103,33,106,191,113,172,119,188,103,203,6,61,43,202,34,62,103,8,53,191,127,58,161,61,39,189,82,191,226,204,78,62,161,172,155,190,162,92,241,190,157,66,144,62,30,68,220,62,179,152,40,188,20,10,55,62,243,172,84,190,229,121,24,61,176,51,63,62,215,34,39,62,240,140,89,188,163,103,20,62,38,68,14,61,166,44,19,62,137,181,151,62,90,56,24,190,87,78,109,62,52,189,110,61,121,70,6,63,81,85,113,61,148,49,70,189,59,5,84,61,124,34,201,189,254,103,13,63,134,217,215,189,62,127,158,62,112,34,174,189,63,66,152,60,94,220,174,62,96,222,168,190,175,115,109,190,140,212,95,62,198,227,232,61,108,116,31,62,33,61,244,189,92,30,192,190,250,218,197,189,158,23,163,60,119,197,128,62,83,178,9,63,194,162,23,190,109,154,27,189,245,132,173,62,209,244,142,62,0,142,191,190,76,82,22,191,128,39,105,188,64,251,21,190,240,154,85,62,1,222,34,60,246,68,209,62,32,112,132,60,103,24,177,61,236,172,117,61,68,194,99,61,204,216,161,61,45,156,85,191,129,173,168,189,36,150,161,61,139,164,93,62,20,199,193,190,250,162,206,190,126,41,166,62,191,81,108,190,53,143,254,188,129,252,238,61,170,46,5,63,243,213,108,62,135,123,56,189,205,10,165,61,125,122,61,62,198,236,140,191,217,179,136,62,227,84,44,190,60,190,12,189,182,248,70,62,15,12,13,62,1,74,223,59,230,3,58,189,50,46,89,62,35,109,217,62,185,79,90,62,109,213,165,62,237,2,152,62,4,166,173,189,129,115,207,189,148,102,149,191,188,170,154,62,44,29,154,189,175,255,34,191,219,27,130,188,203,156,76,190,95,13,125,62,216,126,153,189,60,28,185,190,200,182,255,61,104,106,140,190,133,60,137,60,33,67,226,61,92,238,56,189,119,93,14,190,25,153,175,62,138,75,21,62,33,174,28,190,89,154,83,62,167,3,173,62,48,154,217,60,7,90,3,191,167,156,164,188,243,168,2,191,167,215,196,59,174,234,131,62,142,95,37,191,243,135,183,62,214,7,140,59,144,138,147,62,235,127,240,61,84,45,247,189,10,238,255,190,253,148,214,189,76,225,34,190,60,127,206,62,89,240,58,190,194,140,66,189,217,188,210,189,119,38,68,189,135,44,228,61,45,112,215,189,237,58,168,62,80,209,245,189,202,123,70,190,181,118,9,188,67,222,36,189,30,238,35,190,27,218,133,190,93,242,134,190,27,3,46,62,236,209,41,61,230,44,128,190,170,60,3,62,238,41,93,190,241,141,14,61,223,87,203,190,171,237,229,62,177,79,200,190,187,123,147,190,14,112,136,189,215,188,54,62,169,90,103,62,239,227,192,60,107,206,188,61,11,83,13,62,221,56,161,61,80,103,179,62,172,244,140,189,92,140,90,191,187,125,113,190,248,44,194,190,246,122,208,188,150,42,141,61,123,21,40,62,250,88,156,62,109,172,137,190,143,207,156,187,97,165,74,61,163,147,221,62,200,165,62,190,148,31,176,189,58,232,199,62,243,195,177,189,232,146,181,62,110,138,5,191,132,28,20,189,230,31,193,188,171,225,112,190,35,5,15,62,200,72,142,61,227,167,91,60,192,16,28,62,56,99,1,63,229,237,251,187,99,233,84,189,157,129,69,189,186,254,209,190,127,57,245,61,11,36,172,62,109,160,29,62,114,17,98,190,215,34,65,189,18,144,184,62,11,31,127,190,67,51,42,62,92,5,21,62,147,209,101,190,100,122,119,62,220,7,171,189,198,246,147,189,94,222,234,189,147,172,251,62,190,24,100,61,119,99,195,60,159,109,94,62,235,183,41,189,26,81,35,189,62,30,193,189,47,32,79,190,228,128,64,190,14,218,64,189,58,100,228,190,100,27,48,59,114,60,17,62,48,46,242,190,117,159,200,190,209,108,86,62,155,129,205,189,241,123,138,60,21,244,194,189,102,173,24,62,141,191,128,189,146,124,238,190,229,162,146,62,240,175,139,61,6,240,199,59,103,92,176,60,89,30,120,61,11,19,236,57,43,17,82,190,180,93,159,61,7,186,228,61,145,117,23,62,190,64,153,62,63,146,184,62,84,183,205,189,242,36,247,62,63,238,157,190,114,184,208,62,121,41,151,61,173,27,96,189,19,223,204,60,65,238,234,61,17,49,1,61,196,184,3,190,106,60,102,62,74,104,179,189,119,204,218,62,59,119,86,189,124,214,161,189,113,78,169,189,242,243,167,189,188,80,180,62,173,96,66,62,220,4,4,61,154,157,24,190,126,116,68,62,65,213,10,61,198,36,199,189,164,73,49,62,36,59,6,191,219,131,250,187,102,60,141,62,86,148,161,190,210,43,121,62,221,195,68,190,104,214,220,61,92,215,130,190,127,123,204,61,71,245,7,190,134,23,69,62,231,38,250,189,175,133,125,190,252,126,189,62,14,35,254,189,97,207,131,190,71,143,81,62,112,73,254,61,177,146,51,189,253,125,251,60,139,32,152,190,184,227,235,190,200,99,136,189,172,133,197,189,158,8,202,62,106,42,173,190,143,199,12,63,239,132,15,190,22,154,208,189,243,173,109,60,244,0,171,188,109,74,2,61,9,245,204,60,141,227,52,62,8,60,142,61,211,94,43,190,9,252,167,188,227,244,242,190,214,160,103,61,115,135,25,62,9,186,152,62,37,149,185,60,33,209,63,60,129,230,137,62,190,225,61,61,153,57,183,189,226,78,121,62,79,217,68,188,228,210,102,62,130,109,37,61,195,60,175,190,149,137,38,62,18,37,200,61,219,209,50,62,186,121,39,191,114,192,93,190,204,152,33,62,143,72,65,189,99,173,55,62,245,145,28,62,203,141,79,191,239,103,115,62,46,0,81,190,250,128,230,189,34,14,39,190,114,196,116,189,239,125,110,190,51,11,38,190,174,171,31,189,77,63,10,61,98,252,141,62,141,5,248,61,30,137,212,189,1,158,249,189,102,164,144,62,105,118,157,190,95,216,206,189,196,102,24,61,105,1,188,188,148,48,215,189,80,80,75,62,213,188,139,62,202,0,237,61,189,42,18,186,205,142,184,189,230,33,145,62,150,21,17,190,125,19,1,190,92,71,250,188,250,155,130,62,115,58,157,57,51,207,198,62,161,146,210,189,147,79,199,187,155,0,137,62,233,223,24,189,60,129,211,60,17,254,5,62,190,14,88,60,14,56,52,189,139,226,167,190,232,245,52,189,67,80,26,191,184,221,233,62,226,110,144,190,19,207,143,62,47,52,27,61,103,161,32,190,130,218,132,190,117,178,191,61,236,56,179,188,81,5,140,61,170,146,162,62,190,76,79,189,181,179,22,190,27,106,133,62,41,205,60,190,115,56,189,188,205,166,98,189,60,57,110,191,228,54,11,61,145,185,70,62,198,117,147,62,125,121,130,190,160,126,197,190,125,43,139,61,150,27,225,62,115,84,142,189,40,18,168,189,240,78,210,189,13,222,141,62,50,188,34,62,161,97,247,188,130,35,80,62,182,125,80,189,28,128,99,60,212,223,182,189,127,243,171,61,93,238,3,62,209,170,198,62,236,172,179,189,215,129,14,62,129,190,190,189,170,62,78,62,200,203,185,189,142,203,80,190,3,254,42,61,135,117,32,190,71,129,211,190,244,169,238,189,107,13,51,63,61,65,16,189,243,210,35,62,112,151,177,62,35,197,49,62,223,121,232,189,162,221,142,62,91,231,175,61,136,41,171,189,171,217,206,61,187,151,187,61,118,98,211,189,23,167,74,62,152,217,99,190,235,142,157,190,132,185,131,190,6,11,89,191,59,144,169,62,151,202,189,190,107,143,249,189,6,126,156,62,234,180,66,190,149,73,233,62,72,194,36,190,80,133,148,61,238,136,110,191,34,36,210,59,108,88,70,188,43,71,26,61,117,241,249,189,184,95,188,189,128,163,42,191,199,142,189,190,221,150,62,189,202,91,128,190,27,44,255,62,80,52,88,190,16,151,127,189,6,145,2,63,60,170,166,61,123,24,198,190,30,227,129,61,191,195,197,60,236,89,10,191,252,162,181,189,205,188,226,189,53,214,38,61,71,54,221,190,236,70,134,61,199,149,105,60,71,8,3,190,166,32,67,61,203,253,131,189,117,106,7,188,17,76,31,188,240,217,120,190,144,173,118,190,154,239,140,61,215,248,206,62,113,127,58,61,4,230,210,189,107,87,151,61,197,179,184,190,87,105,31,190,20,80,25,60,64,181,140,189,3,102,56,60,235,237,53,189,78,149,54,190,2,248,181,188,30,44,178,190,200,41,195,60,91,151,136,62,201,86,145,61,210,150,186,187,128,52,169,59,210,153,155,189,249,35,188,61,168,142,40,190,147,121,29,190,218,66,101,189,92,223,200,190,139,186,43,189,114,42,126,190,133,36,129,190,150,64,197,189,23,222,43,190,60,143,197,62,29,43,128,189,191,243,41,190,157,179,210,188,123,24,227,190,200,110,208,188,10,142,135,189,141,126,179,61,101,165,231,60,226,204,204,61,254,45,106,190,87,137,56,62,186,98,82,62,47,223,130,60,181,171,218,189,55,239,245,61,78,106,26,189,79,163,37,62,118,63,76,190,179,239,233,189,110,82,142,61,90,56,156,60,235,71,175,61,13,34,34,190,9,75,48,189,205,176,12,62,127,1,194,61,2,225,35,61,235,239,15,190,123,144,69,189,74,54,195,184,0,117,21,59,139,158,159,189,207,166,0,62,254,229,226,62,210,186,139,189,89,150,188,188,185,13,240,189,133,105,136,61,213,115,103,189,175,64,179,190,171,201,125,189,80,67,160,60,1,40,87,189,159,56,150,189,251,228,152,61,210,224,168,188,130,52,255,189,69,60,255,190,21,188,53,189,236,9,62,189,32,193,246,60,33,109,102,61,69,207,171,190,106,96,207,61,156,99,55,189,207,52,138,61,85,97,140,188,225,61,189,188,77,221,211,190,246,237,82,62,25,95,219,59,122,212,172,189,241,212,0,61,122,255,179,189,192,216,231,189,88,239,132,61,191,4,161,189,224,44,145,61,138,115,46,61,216,203,235,188,9,95,64,62,151,247,196,62,82,50,175,190,150,53,218,189,94,166,225,190,128,171,236,187,65,94,29,189,60,5,162,189,39,44,157,62,130,151,216,60,45,18,197,189,29,48,135,61,192,118,59,62,54,7,135,61,167,195,147,189,81,120,77,62,72,9,23,60,235,111,211,187,41,150,73,62,147,255,61,60,177,148,221,61,100,203,230,189,223,37,63,61,163,131,99,189,80,138,112,61,0,10,64,61,171,213,94,190,64,36,190,189,231,156,149,190,116,112,226,188,155,25,140,190,98,111,29,62,252,47,178,190,243,216,237,190,217,215,130,62,12,248,131,190,220,148,201,188,118,5,169,57,14,4,74,62,140,67,220,188,91,184,255,187,82,164,45,59,43,62,75,190,181,125,134,61,172,227,139,61,100,57,249,188,157,216,219,60,132,227,242,189,55,15,28,62,54,178,106,189,38,155,158,190,165,95,52,191,208,21,96,62,132,210,234,60,231,189,171,187,41,116,252,189,46,50,223,188,65,196,120,62,6,189,150,61,87,216,182,190,4,121,168,62,197,144,17,62,157,64,128,62,40,243,54,62,46,184,55,190,128,207,230,61,71,171,80,60,158,142,108,62,28,214,68,62,194,23,169,190,95,45,122,188,140,111,66,62,112,162,108,189,66,225,5,61,232,228,119,62,141,0,8,190,232,138,237,61,32,76,130,188,136,167,133,62,86,82,105,190,249,61,145,59,213,208,71,62,234,63,136,61,23,218,152,62,179,116,210,186,1,188,165,190,198,177,38,190,60,122,136,190,223,210,246,187,67,130,221,188,186,80,221,189,88,203,172,189,64,80,230,189,182,220,191,190,131,45,81,60,182,65,40,61,144,74,106,62,238,60,97,62,86,189,197,61,208,144,30,61,229,49,233,190,119,37,207,190,214,187,192,190,231,17,184,189,35,7,168,61,157,115,208,189,188,216,199,61,114,107,63,60,254,57,15,190,128,173,66,61,41,200,155,190,72,218,139,61,52,89,95,62,51,170,48,62,177,109,55,62,111,1,151,188,26,48,58,62,188,146,8,62,209,18,100,62,22,159,109,59,240,7,25,62,136,4,215,61,191,115,91,62,255,173,133,190,22,148,7,61,63,2,142,61,70,15,2,190,165,223,232,188,236,26,253,189,68,173,193,189,58,253,129,61,250,126,139,59,40,49,18,62,193,182,172,190,88,248,175,61,167,143,93,62,61,110,176,188,108,100,14,62,48,35,51,189,206,82,17,189,150,228,140,61,83,133,154,61,37,99,243,189,28,122,156,190,98,249,12,62,231,176,91,62,26,109,253,59,25,177,233,189,82,90,130,190,125,51,12,62,20,78,4,190,65,158,192,190,210,27,174,61,101,176,63,190,106,227,232,61,12,145,221,60,0,39,118,188,246,27,156,60,157,15,94,190,32,117,232,188,192,17,141,188,90,173,210,188,90,16,130,62,94,159,120,61,254,160,1,190,241,92,141,61,29,233,244,189,97,9,133,189,132,37,207,188,138,73,36,188,189,198,164,62,143,240,138,61,112,191,134,60,134,192,14,61,253,172,216,189,173,165,169,189,192,170,136,189,6,35,162,189,13,51,178,61,149,191,137,191,99,202,47,190,88,5,28,62,242,105,1,63,65,163,193,189,237,141,73,189,115,238,151,61,210,76,59,191,69,223,69,61,79,158,10,190,209,60,224,190,92,239,106,61,163,250,13,189,84,109,134,189,212,75,168,189,50,5,27,61,26,44,208,189,161,127,58,61,180,23,255,61,217,159,123,61,111,178,225,61,170,149,168,190,37,133,56,62,59,96,47,62,210,216,0,62,216,46,160,61,8,93,203,189,181,74,58,61,154,132,137,190,8,52,51,61,114,211,46,190,198,137,195,61,180,140,29,190,182,105,43,190,135,235,97,62,144,187,102,61,212,37,49,189,42,32,57,191,199,228,82,189,193,18,67,62,65,28,172,61,226,101,90,62,79,129,201,190,243,63,192,61,158,190,240,189,214,176,74,61,15,203,144,189,168,1,250,189,181,218,54,62,176,142,145,60,7,130,125,62,128,140,66,190,190,100,206,61,86,41,213,189,60,198,164,190,188,54,172,188,116,73,221,61,47,147,223,60,116,117,193,190,39,163,211,62,35,198,68,190,217,76,246,189,35,141,205,189,255,242,235,189,212,91,63,61,44,110,196,190,1,77,89,189,63,143,185,60,152,202,2,62,59,139,0,191,82,237,100,189,50,216,130,61,76,196,71,62,11,250,184,60,98,114,232,60,224,252,214,61,119,64,143,61,148,128,184,61,231,211,216,61,50,226,81,190,185,50,110,190,42,55,27,61,28,158,138,188,220,117,101,62,51,150,36,61,217,123,129,62,148,215,207,61,206,46,86,188,71,51,43,190,114,78,154,189,48,217,81,189,79,72,164,61,201,100,138,62,69,124,158,187,115,7,188,189,3,67,13,191,121,27,46,189,30,179,191,59,248,55,83,190,131,100,93,189,15,237,126,62,3,56,70,188,183,209,142,61,45,53,221,61,150,41,18,62,175,187,55,61,123,186,62,190,113,205,25,62,45,187,198,61,213,9,102,190,14,98,80,191,245,65,150,189,232,99,202,189,112,141,147,189,77,196,170,61,39,49,59,60,221,114,243,61,234,45,219,60,58,83,60,190,147,96,163,189,180,91,30,191,100,180,55,189,75,244,21,62,249,14,137,60,51,92,244,189,105,23,62,62,112,76,204,59,184,217,68,62,160,69,73,61,67,203,13,62,108,41,153,61,226,185,175,61,32,95,201,60,216,142,138,61,187,151,129,190,2,53,80,61,118,201,81,61,126,111,2,63,56,212,196,61,230,199,90,190,35,143,250,62,156,142,21,61,26,213,172,61,108,123,113,188,0,157,133,189,172,31,74,190,156,95,86,61,133,64,8,189,12,1,69,189,195,250,238,188,55,38,74,59,114,168,137,62,2,58,44,58,89,142,138,61,151,106,27,188,52,151,167,60,109,90,188,189,129,49,77,190,111,199,70,190,43,178,81,61,74,180,77,190,67,90,197,61,5,86,71,190,187,135,69,190,228,96,157,59,80,59,98,190,50,254,44,190,229,245,66,62,222,19,152,190,121,48,158,60,31,20,21,62,65,226,126,190,101,114,41,61,168,99,36,62,172,178,146,62,255,205,138,61,240,68,230,189,166,45,5,61,9,19,8,189,65,195,104,190,208,35,85,189,230,125,73,190,33,43,158,61,237,57,250,189,143,147,180,189,120,121,226,61,34,98,111,61,224,66,56,190,192,252,254,188,59,15,65,62,232,138,125,62,165,113,181,61,55,63,186,190,174,64,37,62,159,29,252,60,102,176,93,190,66,123,168,62,203,186,186,61,178,148,182,189,92,21,241,190,244,60,172,190,168,9,181,190,164,61,180,190,220,219,139,61,241,66,123,61,50,140,98,61,105,35,185,60,80,79,139,188,92,67,12,190,78,105,157,62,211,171,233,60,68,55,236,189,61,52,107,190,41,58,51,62,166,11,99,189,30,127,165,190,186,227,128,61,93,165,237,61,33,230,243,189,56,104,223,191,249,152,244,62,132,103,57,62,240,169,20,63,87,183,254,189,39,40,80,189,255,153,111,62,42,205,222,189,114,163,167,62,119,40,156,62,47,191,134,191,96,25,49,62,120,86,78,63,121,164,146,63,244,219,140,191,29,166,79,63,61,152,190,62,88,58,2,62,216,244,123,62,141,81,53,190,88,181,220,189,165,25,49,60,12,201,142,191,224,22,87,61,124,18,11,63,156,133,91,188,102,214,54,190,69,206,78,190,250,233,132,190,141,102,30,61,216,31,142,189,101,11,46,63,75,80,200,191,244,202,13,62,95,255,158,189,117,219,167,190,242,12,93,189,241,5,223,190,221,36,26,191,152,188,63,191,156,80,33,189,39,160,188,191,112,3,18,61,255,74,157,62,38,210,51,190,170,40,149,191,124,167,165,61,244,180,193,190,116,106,132,62,75,218,211,190,86,223,29,190,113,18,43,190,136,96,245,189,212,34,2,62,12,34,27,191,53,6,205,190,165,176,66,62,228,137,183,62,106,185,254,190,156,45,9,62,6,126,65,62,72,198,58,191,19,93,160,62,165,201,239,62,208,3,49,190,77,161,22,63,173,7,127,190,156,55,75,190,156,164,78,62,211,242,197,61,26,109,240,62,131,196,108,189,242,199,52,190,211,176,114,190,129,124,98,189,182,23,63,62,46,115,98,189,95,215,197,60,231,241,139,189,226,199,37,191,50,214,30,190,251,218,64,191,247,1,77,63,112,134,130,189,174,210,137,191,168,184,134,62,191,100,106,190,116,50,156,189,75,149,64,61,146,250,73,188,251,250,104,62,114,225,210,190,80,95,186,62,73,51,149,59,98,49,101,190,215,201,39,191,143,69,38,63,34,160,28,63,2,154,89,189,60,190,250,60,54,83,204,61,56,12,4,62,252,240,172,62,224,144,192,60,38,154,243,189,139,247,55,59,135,113,101,62,12,248,4,190,54,214,15,191,73,49,16,191,151,167,46,191,235,30,178,62,80,222,129,189,253,62,172,62,64,102,205,190,235,66,27,190,203,221,2,63,123,2,21,61,214,138,75,189,164,176,55,190,74,8,8,191,117,37,52,191,66,116,180,189,63,74,51,62,82,106,170,62,243,58,246,189,210,250,22,62,147,237,32,62,99,9,201,61,152,248,42,63,13,189,1,63,138,210,89,62,150,105,7,62,133,216,149,62,247,67,153,62,107,21,148,189,23,23,106,190,62,168,44,63,149,177,157,62,113,42,66,62,80,47,166,189,172,127,240,62,103,109,216,61,78,110,246,190,26,22,187,188,112,59,246,189,33,4,221,191,41,247,79,191,161,97,91,61,1,32,10,191,57,43,121,61,54,44,206,190,161,120,146,189,237,223,92,62,74,94,18,190,37,18,38,61,171,85,198,189,134,51,127,62,51,253,140,189,244,1,77,190,104,181,123,190,206,115,181,189,82,75,152,62,52,58,121,62,221,141,47,60,82,131,121,191,208,6,131,190,121,157,53,190,236,240,212,61,223,234,144,191,132,216,174,188,32,10,138,190,125,146,65,62,16,206,114,186,12,138,196,190,72,220,242,61,173,207,152,188,125,222,118,190,86,148,226,62,177,79,235,190,165,28,188,190,205,155,31,63,225,155,204,61,117,123,206,62,82,88,223,190,71,221,33,63,178,35,199,191,149,2,205,189,11,220,18,61,191,49,134,191,201,220,150,190,75,47,62,62,64,8,86,61,12,64,180,190,163,125,132,62,15,119,229,189,184,211,163,62,46,35,15,62,146,25,188,59,182,43,132,189,222,60,211,61,143,16,213,60,141,47,173,62,176,57,83,190,224,127,219,190,132,14,189,190,125,222,185,190,85,248,30,191,198,18,15,190,68,44,191,190,92,113,84,62,212,70,84,62,78,221,166,189,175,239,151,61,201,10,4,61,117,179,234,59,131,57,227,61,247,168,239,61,118,198,4,191,85,158,12,62,150,232,176,61,142,136,201,190,40,117,74,62,81,239,8,190,108,111,197,190,19,216,96,190,239,83,9,63,111,128,211,191,111,218,134,63,151,184,102,189,69,39,64,61,240,28,248,61,212,80,142,191,131,48,117,62,191,237,6,189,69,84,192,189,2,217,181,190,55,130,232,61,192,163,157,59,39,166,252,190,148,224,63,190,94,137,183,189,236,66,140,191,57,81,152,190,102,0,129,63,206,176,209,61,92,102,116,189,104,165,244,61,41,173,65,60,229,163,87,191,143,6,127,187,82,178,5,61,65,157,165,190,102,121,143,189,168,92,158,190,189,26,66,190,4,239,80,62,235,20,12,62,147,146,48,62,251,48,144,189,66,0,251,189,207,61,162,61,120,197,176,189,9,177,63,190,109,50,130,190,218,201,128,190,176,244,8,191,80,138,128,188,206,57,59,189,154,149,71,63,224,142,141,191,236,44,99,190,111,243,19,191,57,170,57,190,229,216,97,63,227,237,111,62,47,26,44,63,74,198,153,62,18,17,90,190,1,81,200,62,204,147,153,190,14,166,141,59,200,245,183,62,160,22,11,190,5,160,153,62,138,121,246,189,223,130,49,190,141,132,168,62,20,71,151,190,220,225,189,61,51,109,144,61,124,1,72,61,200,88,11,62,255,111,29,190,123,113,24,63,149,110,211,62,82,200,20,189,199,16,167,189,236,242,148,190,136,76,15,192,129,7,9,191,132,80,21,191,121,112,217,189,246,250,178,190,33,127,67,189,165,24,242,62,99,17,143,63,190,232,246,62,254,220,132,189,83,100,46,61,123,10,204,189,250,24,205,61,83,226,191,62,213,82,145,188,56,185,91,190,62,232,67,190,38,47,151,189,124,167,234,62,44,189,106,62,144,27,1,189,88,119,160,61,23,75,167,62,101,125,194,190,184,253,40,61,68,38,60,191,59,222,142,60,16,14,229,188,182,103,144,188,9,42,255,189,127,44,135,189,115,220,152,62,27,140,153,62,187,136,6,63,110,50,46,191,168,138,2,190,72,214,10,191,141,98,5,63,190,4,159,190,42,82,255,62,197,106,36,63,164,12,146,189,104,194,7,62,199,21,154,62,235,252,10,191,110,84,18,191,6,219,0,192,17,73,47,62,1,161,71,61,77,16,168,191,197,97,134,189,168,98,139,190,197,153,149,61,243,11,11,62,23,204,53,62,103,63,144,190,63,0,50,61,60,51,179,62,204,115,62,191,83,173,189,62,184,166,74,191,210,9,239,191,100,196,41,190,126,163,201,62,129,175,49,188,191,101,94,191,237,217,157,187,69,169,159,190,6,115,165,62,164,41,57,191,77,155,53,191,102,238,134,190,210,59,7,61,10,214,222,61,251,190,89,61,133,254,173,189,122,254,25,62,198,223,235,61,29,51,171,62,80,98,8,62,119,116,172,61,165,173,176,190,172,28,38,190,172,167,24,61,178,61,176,190,183,116,172,187,30,157,232,189,187,157,229,188,184,32,134,62,29,153,19,191,57,32,137,62,221,245,170,189,52,106,170,62,159,244,187,190,145,66,74,190,140,72,51,63,176,4,88,190,155,209,205,62,19,41,14,191,216,249,34,63,98,220,244,190,61,11,64,189,123,138,32,190,88,45,232,190,115,186,241,190,16,250,80,189,212,46,174,188,236,150,52,189,3,235,188,61,27,209,27,63,27,80,128,190,33,81,177,190,234,208,246,190,118,80,130,190,213,48,133,188,48,219,206,187,200,34,94,191,244,189,9,186,215,235,3,190,168,133,209,190,102,196,154,61,244,135,128,190,36,60,87,63,83,194,201,189,101,75,22,189,45,154,22,191,51,44,133,190,15,83,20,62,74,215,199,190,176,8,220,62,162,217,142,62,189,235,74,190,137,252,93,62,105,238,159,62,248,221,42,190,64,187,176,61,163,111,118,191,110,109,184,190,181,49,44,191,94,75,120,190,249,135,128,186,181,189,170,191,128,84,219,61,19,72,150,61,32,92,31,190,226,92,230,190,251,196,229,61,56,181,243,188,245,57,148,60,151,151,189,190,140,246,196,190,178,175,12,63,222,182,199,62,109,233,67,62,219,225,131,62,173,149,162,61,179,165,110,190,110,88,138,191,139,54,33,190,33,224,172,62,23,70,61,62,227,144,6,62,68,208,168,190,110,145,180,62,190,138,80,62,89,241,87,61,131,181,129,191,69,193,92,61,94,254,97,60,61,16,227,190,173,137,173,61,248,28,183,62,130,69,186,58,53,237,180,61,240,87,187,62,20,16,121,189,143,36,7,191,218,199,199,60,109,48,18,62,231,86,168,190,129,139,64,62,152,175,220,62,238,26,38,191,117,77,167,189,182,172,117,61,166,210,123,190,20,160,158,190,166,139,41,62,21,149,138,191,146,239,201,62,206,31,11,191,209,129,183,189,247,228,146,59,100,223,152,190,93,242,98,189,34,49,141,62,167,192,199,61,97,89,97,62,17,60,183,61,252,127,171,62,200,96,136,62,235,28,172,190,59,147,151,62,206,120,118,62,72,41,20,62,182,22,26,63,242,239,182,190,106,182,252,190,22,204,181,61,253,208,113,62,46,159,29,190,192,202,111,190,50,21,6,189,73,139,51,190,145,71,101,62,2,222,145,190,201,168,13,191,246,185,97,190,30,74,19,189,208,157,188,61,158,202,92,62,46,169,10,62,140,93,160,62,133,140,79,188,142,143,1,188,135,213,243,61,150,255,228,190,160,104,209,61,166,226,206,62,115,223,221,62,70,65,99,62,149,214,222,62,79,244,251,190,53,206,29,63,242,29,190,189,15,185,164,190,205,4,211,62,222,78,50,190,176,68,8,190,35,18,212,62,45,134,212,189,249,219,69,191,155,0,147,189,248,2,154,188,124,183,93,62,171,220,183,61,97,101,99,62,190,76,228,190,50,195,78,62,74,204,44,190,164,68,37,191,26,31,165,62,32,181,3,63,248,171,7,190,206,185,154,188,235,189,243,62,48,90,12,62,69,81,3,63,212,27,204,62,203,68,103,62,147,194,165,190,195,230,131,62,53,15,140,62,153,182,48,191,135,64,110,191,33,194,206,189,17,38,166,62,119,37,130,190,146,2,147,189,181,17,145,62,181,204,244,189,153,194,176,62,214,69,144,62,120,36,142,60,47,119,189,188,3,205,56,187,222,78,167,58,148,193,185,59,91,81,148,190,119,218,112,62,25,127,74,191,26,97,142,191,66,190,151,62,37,37,25,190,93,17,179,189,46,38,16,62,207,20,206,190,232,179,55,189,49,180,212,61,175,176,94,189,119,198,60,191,182,2,158,190,144,202,45,62,173,203,145,191,128,235,54,191,30,51,190,60,130,132,136,190,118,162,63,189,211,237,43,62,127,24,69,62,218,192,178,189,245,37,108,191,238,201,153,62,22,106,219,61,228,24,248,62,89,247,83,191,177,41,21,62,88,163,38,62,76,97,154,190,111,245,11,63,8,100,159,62,74,193,151,62,89,132,173,188,152,49,224,62,160,236,181,62,247,21,41,190,94,121,150,189,35,165,137,62,217,111,7,190,51,70,162,62,79,145,56,190,186,137,176,190,229,10,167,191,99,90,169,190,43,100,4,190,72,20,223,61,61,23,219,62,13,212,104,190,216,22,39,62,129,63,6,191,163,168,59,62,108,237,190,190,55,29,156,190,100,163,108,191,192,173,34,62,197,202,21,62,219,25,157,190,89,45,191,190,76,41,76,190,22,186,131,62,27,202,0,191,123,104,3,61,227,204,0,62,223,205,1,63,109,101,102,61,160,199,50,62,35,84,87,189,137,228,3,192,207,76,5,62,204,67,110,190,32,7,61,62,141,159,16,63,53,29,75,62,17,254,164,61,244,178,13,189,27,175,52,191,207,61,168,189,211,29,16,191,233,118,75,190,117,36,74,190,70,177,89,63,25,143,57,63,13,46,169,61,13,5,220,61,216,71,29,62,112,23,183,191,110,245,59,190,122,142,132,60,15,247,77,63,41,30,69,57,81,50,184,62,92,96,57,190,1,78,72,62,242,127,8,190,49,18,154,189,8,150,96,190,74,241,140,62,113,162,43,191,180,46,10,191,163,254,220,191,44,158,21,62,134,109,161,62,93,72,146,190,112,29,253,61,137,195,47,61,63,211,173,189,158,2,123,190,112,128,40,62,84,93,61,62,40,37,136,62,124,160,31,190,177,60,221,62,56,235,53,63,199,65,90,62,46,98,152,190,167,252,27,63,69,129,41,62,20,23,31,191,207,253,155,61,122,208,70,190,110,48,192,61,128,43,96,191,58,92,21,190,191,50,164,189,223,243,167,60,1,236,115,190,121,12,166,62,34,31,70,62,34,47,45,63,49,155,51,62,94,59,144,62,90,73,20,191,186,82,14,63,186,174,162,190,93,182,17,190,138,139,255,61,189,211,91,189,40,27,21,62,172,92,228,188,165,74,17,190,7,111,54,63,32,149,171,62,199,136,59,62,14,215,85,61,103,109,148,61,45,121,23,61,231,206,74,62,14,180,7,191,157,92,158,189,86,233,249,62,106,193,10,62,73,197,15,63,44,76,140,190,115,84,148,188,29,27,69,190,218,133,31,63,137,151,149,62,204,223,6,63,112,106,8,191,127,164,195,190,167,81,149,191,59,136,192,61,56,150,8,189,248,186,163,190,57,17,221,190,31,227,190,61,211,241,160,189,137,153,202,61,12,242,115,191,216,110,200,60,71,204,150,63,87,200,33,63,254,198,26,62,49,243,167,61,64,2,133,191,177,217,8,61,120,50,221,60,115,193,76,190,220,141,51,190,52,9,55,62,105,148,30,189,102,127,4,191,153,106,197,62,61,13,217,189,15,245,234,61,34,73,167,62,209,174,247,189,167,139,12,191,92,154,219,189,61,122,179,62,48,122,34,191,61,54,202,62,49,92,166,191,122,62,142,62,73,231,82,190,10,158,85,191,248,174,116,62,37,165,217,190,227,125,98,190,84,42,45,62,137,32,223,190,92,248,168,189,101,227,2,63,243,154,143,62,172,165,144,190,213,218,119,61,226,55,240,190,60,18,66,62,184,6,118,62,10,246,187,189,86,10,175,62,82,46,208,62,47,25,22,63,73,80,6,62,155,109,170,62,220,66,8,63,234,186,65,60,193,233,55,62,151,150,20,63,40,231,24,189,79,137,230,191,86,147,5,191,251,232,34,62,176,166,237,61,24,223,103,63,54,232,28,191,241,66,205,190,237,246,118,190,67,8,138,62,58,151,4,191,179,100,189,191,51,72,161,191,147,58,166,190,65,72,173,62,200,0,225,62,247,146,227,62,224,196,81,191,117,59,141,61,5,125,45,191,183,222,43,62,223,199,141,191,162,25,209,62,192,169,159,191,221,38,176,61,70,158,44,62,95,8,71,62,208,107,208,62,62,123,96,190,88,88,149,191,108,225,78,63,194,244,72,62,31,0,62,61,136,101,83,191,189,83,215,191,221,182,26,191,101,227,174,62,25,145,244,61,121,99,218,189,44,127,229,61,200,47,138,191,140,24,27,63,155,37,222,62,254,78,16,191,109,71,85,62,15,27,19,63,95,78,17,190,171,198,229,190,120,58,152,62,243,150,22,190,80,96,155,62,142,48,177,190,41,161,221,191,129,152,166,191,144,210,163,191,129,114,214,61,244,198,113,191,232,106,147,62,78,101,109,60,7,146,12,63,240,226,33,62,254,222,187,190,251,107,160,61,65,55,231,62,235,161,234,60,5,184,169,62,188,79,13,62,32,17,179,60,126,67,0,63,207,174,245,62,75,162,73,191,179,41,27,63,39,103,104,63,245,48,4,62,61,146,62,191,13,161,211,62,249,208,184,190,17,236,86,61,239,192,212,62,238,180,237,191,222,210,81,59,195,52,48,63,115,235,210,62,17,149,139,189,191,211,146,59,251,45,38,191,13,151,152,61,233,218,107,63,135,77,151,190,237,27,10,190,179,117,28,191,15,87,194,62,28,44,129,191,247,213,192,191,92,184,129,191,112,23,176,61,91,120,204,62,232,76,166,188,94,234,210,62,39,121,241,188,14,243,168,62,18,244,68,62,166,48,244,191,63,86,25,63,239,42,13,63,20,153,81,191,208,166,167,191,91,46,192,62,148,44,46,189,234,130,159,62,152,158,46,63,37,46,94,191,100,159,7,192,143,1,40,62,124,240,152,191,184,28,142,187,184,59,1,62,72,49,39,62,231,46,18,63,155,201,137,189,125,184,139,62,246,192,177,191,200,225,128,191,96,139,212,191,203,65,18,191,235,28,231,62,105,4,6,63,219,125,13,63,140,50,144,62,72,51,94,63,67,175,26,63,1,56,202,61,13,79,9,192,172,70,134,61,158,106,102,191,3,199,173,190,38,121,101,191,226,136,169,190,253,165,215,191,41,41,234,190,54,10,189,62,58,155,76,191,147,150,90,63,146,2,10,63,155,50,131,62,128,65,17,62,23,204,238,191,219,60,173,60,60,117,47,190,96,207,173,190,10,132,158,62,197,238,3,63,52,121,31,63,157,125,161,190,17,247,45,63,128,183,83,191,14,65,46,191,190,234,172,190,127,124,175,190,54,133,89,63,61,207,202,188,77,180,92,61,109,138,109,62,164,254,148,62,124,95,100,62,176,98,14,62,87,54,234,61,10,126,184,62,245,3,191,189,74,24,46,63,122,22,88,191,71,222,7,63,103,31,47,190,22,220,9,190,32,152,156,191,87,215,95,189,231,45,149,61,252,55,142,191,236,199,156,189,148,95,138,191,30,50,159,191,152,238,158,62,96,13,200,59,22,16,5,63,108,36,221,190,81,0,11,63,127,14,255,62,196,65,98,60,96,120,106,191,37,36,20,190,197,164,145,191,116,82,148,189,153,148,58,63,214,215,188,191,45,103,128,191,166,92,151,61,190,158,73,190,103,101,60,190,56,206,222,190,26,116,65,63,196,203,144,62,41,202,237,60,66,113,174,62,103,122,115,191,101,7,229,62,9,72,19,62,201,157,194,61,31,134,193,187,182,230,152,191,196,218,183,191,188,160,171,62,127,232,186,62,89,97,63,190,110,242,6,63,111,182,128,62,170,171,249,62,48,117,15,63,4,131,116,191,179,14,120,191,118,171,137,189,63,4,206,190,22,217,206,61,91,84,34,63,75,13,112,62,138,153,67,62,56,215,195,62,81,228,150,191,88,227,182,191,62,149,171,62,150,121,3,63,45,13,116,62,29,171,224,62,80,4,230,62,17,75,167,190,206,61,88,191,205,120,177,190,0,183,58,190,245,235,191,61,175,73,193,189,45,64,49,191,126,158,163,191,88,187,11,62,217,87,2,190,40,133,238,62,251,219,27,63,221,11,11,63,251,127,136,190,35,59,3,62,70,201,199,191,112,92,40,191,52,96,91,62,86,212,128,61,223,66,198,190,72,251,77,62,237,115,22,63,89,131,3,188,195,23,26,60,22,197,9,62,4,249,35,62,75,255,13,61,129,196,37,63,205,48,203,191,67,121,203,62,28,9,23,62,250,162,156,190,213,118,45,191,149,36,41,191,21,226,106,63,152,211,208,191,20,196,59,191,67,207,149,191,235,113,221,60,68,211,61,62,9,7,225,62,127,152,78,62,230,95,13,189,76,200,232,61,159,192,19,191,150,195,188,62,122,43,174,190,214,142,215,61,219,101,192,191,65,193,50,62,140,110,121,190,211,192,6,63,44,240,6,190,65,71,152,188,1,60,177,190,150,243,161,191,126,58,35,63,34,37,182,62,197,127,110,62,34,122,26,191,208,19,59,190,116,29,243,190,189,164,61,61,240,131,237,62,137,70,216,190,137,147,198,191,125,150,175,190,214,156,139,190,235,20,106,60,116,238,160,62,212,31,212,188,84,248,139,62,155,52,130,191,114,67,237,191,25,99,173,60,192,207,137,190,83,168,29,62,178,201,130,62,131,98,17,63,193,51,61,63,101,44,190,61,85,26,84,61,179,61,187,190,165,95,148,62,159,217,135,62,17,163,178,188,51,198,71,62,187,120,136,189,166,9,27,61,23,106,183,62,113,6,116,62,85,57,158,190,215,220,138,61,147,225,174,62,13,9,136,189,171,93,185,61,122,48,208,191,241,81,104,63,237,246,162,191,35,239,0,62,162,223,199,189,121,150,46,191,169,170,112,190,251,132,227,189,195,157,254,190,41,138,188,62,255,2,65,190,254,195,155,61,129,145,14,63,242,29,150,191,104,161,166,191,115,168,177,62,142,189,168,62,6,242,180,62,154,137,198,191,154,94,223,62,157,83,185,62,250,58,212,62,214,73,108,189,42,140,190,62,18,46,241,191,102,146,43,190,189,149,199,62,157,76,65,188,101,226,227,61,212,21,92,62,130,102,47,191,106,224,244,62,3,168,191,189,51,81,67,63,171,139,31,191,217,251,154,191,44,92,15,191,62,129,254,191,25,168,89,191,204,202,186,191,234,179,44,190,166,74,107,62,234,49,135,60,153,159,177,62,90,39,10,190,222,240,220,62,150,186,215,189,7,78,57,189,10,43,6,63,74,127,152,62,3,182,21,59,207,226,32,63,126,35,195,62,87,84,167,191,200,31,223,190,177,95,236,61,160,51,140,62,89,218,154,190,123,135,145,61,251,68,71,61,101,47,41,62,137,211,122,62,199,24,43,62,108,187,219,62,138,69,223,62,96,215,226,191,72,234,16,190,102,141,174,62,87,39,129,62,229,24,65,63,151,100,154,62,86,111,96,191,118,200,226,191,105,40,21,63,50,51,163,59,141,148,31,190,65,148,209,191,175,139,139,62,65,183,192,187,33,42,42,191,51,48,10,63,146,44,18,190,0,161,5,63,123,106,147,188,173,33,5,63,102,56,48,190,107,120,131,191,107,58,41,191,147,58,188,62,107,31,193,60,130,105,121,190,9,70,152,62,126,112,6,190,240,70,148,191,58,181,50,191,28,170,49,63,89,141,136,62,1,201,142,62,230,0,103,190,57,35,246,189,241,248,103,191,145,27,171,61,151,14,63,191,55,215,64,190,89,138,232,187,131,176,9,63,71,165,127,191,88,147,2,63,97,102,14,191,4,247,234,189,35,220,173,190,213,0,239,190,224,197,165,62,92,252,95,191,250,142,156,61,82,142,60,63,31,136,235,189,47,134,143,191,114,14,15,191,120,21,94,191,3,214,159,62,164,107,14,63,149,58,145,190,250,59,204,191,144,18,150,62,145,144,34,191,210,246,203,191,94,95,23,191,41,13,202,60,71,53,24,62,166,164,50,63,225,178,95,62,228,234,142,62,63,153,94,190,72,41,239,61,120,156,83,191,255,105,129,190,227,98,79,62,134,246,94,63,255,34,73,63,85,243,107,191,76,151,5,191,165,55,211,191,13,144,152,191,88,183,203,62,149,56,17,63,197,33,141,62,251,82,234,189,249,98,1,63,151,181,89,191,171,252,170,62,43,128,191,61,78,149,58,190,253,170,192,62,111,90,134,62,189,94,126,191,228,199,185,191,20,121,80,62,52,78,252,189,94,181,153,62,116,152,11,63,243,107,117,63,114,232,143,190,34,75,83,191,119,33,188,62,190,229,182,62,73,227,2,192,217,6,128,191,147,155,130,62,173,26,148,191,211,84,138,62,0,1,65,189,238,233,4,192,154,156,131,190,150,20,228,190,66,200,87,63,223,104,254,189,229,224,175,191,224,80,236,60,29,116,45,62,131,241,10,62,80,214,113,61,141,30,30,62,30,233,35,189,216,207,151,62,81,20,45,61,105,177,220,62,230,51,74,191,48,98,137,62,161,173,117,62,6,42,186,61,142,120,67,63,87,168,223,190,240,232,41,62,248,113,122,191,73,175,249,62,225,140,40,63,39,136,133,191,70,244,185,189,112,242,73,62,233,53,117,190,231,11,170,190,249,215,243,61,3,66,79,191,134,20,205,62,131,12,145,62,242,95,94,62,182,150,169,190,94,57,184,62,249,85,233,190,6,237,195,62,227,193,140,190,151,23,83,63,90,82,64,62,124,233,158,190,140,198,129,189,188,12,178,191,75,82,203,191,39,154,208,191,106,159,241,62,67,13,1,191,154,188,10,61,107,126,92,190,160,104,180,62,190,146,102,191,189,227,193,191,82,144,175,62,236,242,121,62,155,76,8,191,175,167,233,62,128,176,11,190,76,78,91,62,220,102,254,62,51,145,85,190,41,81,2,189,234,87,198,62,122,250,137,62,42,255,122,191,67,56,57,62,249,28,30,62,177,29,252,62,154,168,67,62,244,197,87,191,161,133,145,62,164,221,234,190,98,197,183,190,66,119,167,62,157,38,20,63,2,62,239,190,40,121,180,62,99,59,189,187,8,95,144,62,168,205,153,62,174,150,135,191,137,102,207,190,37,32,230,190,173,66,5,190,111,42,143,191,197,24,226,62,115,162,176,62,185,106,130,61,165,117,203,62,92,158,240,61,112,255,248,61,30,131,226,191,208,129,19,188,182,207,253,61,237,254,235,61,130,231,110,191,55,172,2,63,3,207,186,191,197,81,23,63,21,133,166,62,128,184,28,62,128,108,234,62,69,233,98,191,250,101,243,62,185,146,75,63,163,37,255,188,44,211,152,190,144,239,186,62,192,226,0,63,251,237,133,191,203,45,186,191,147,102,136,61,240,229,250,62,57,39,145,62,194,111,153,191,231,17,80,62,210,59,198,191,80,182,66,63,141,60,129,62,21,64,69,190,101,193,204,191,0,94,87,191,235,29,158,62,139,209,19,63,25,152,37,191,63,121,247,62,190,109,196,190,172,63,131,191,99,111,86,191,176,254,237,190,198,44,49,60,241,26,138,191,63,32,226,62,130,193,99,191,127,143,100,62,218,235,175,191,85,161,73,63,171,189,108,191,93,232,43,62,103,183,168,191,181,80,167,61,128,108,240,60,141,194,163,191,196,43,12,191,56,180,9,191,239,65,182,190,25,216,239,62,140,37,36,191,84,180,44,62,148,114,197,62,235,43,150,61,165,179,150,191,77,93,173,191,172,50,138,190,230,188,213,62,245,161,16,63,197,37,251,190,70,161,86,62,49,199,11,63,199,149,203,62,27,13,197,190,190,16,160,190,145,120,50,190,15,99,41,189,179,95,8,191,185,141,71,191,214,55,12,63,108,3,190,62,215,159,9,63,242,143,31,63,11,21,75,62,83,28,175,61,242,149,114,189,74,65,215,190,119,46,166,62,4,166,27,62,65,140,189,62,148,153,0,63,152,241,71,191,71,184,189,191,81,5,183,62,242,71,18,61,253,169,10,63,70,208,153,191,85,234,76,62,126,196,11,63,106,144,221,61,31,250,145,62,204,15,208,189,234,135,250,62,73,201,67,191,223,73,14,62,142,251,142,189,199,185,220,190,206,180,175,191,124,185,255,190,173,156,84,188,147,104,167,188,13,178,22,190,67,51,239,60,199,243,208,62,117,76,233,62,32,37,152,191,212,19,85,189,220,48,152,190,36,56,91,191,64,195,44,191,192,75,40,62,83,99,37,191,6,23,255,62,227,236,137,62,94,234,24,190,201,158,180,190,111,184,240,62,95,19,13,62,162,177,189,62,153,140,85,62,151,82,54,190,54,139,37,63,183,167,205,191,180,190,95,62,18,32,92,191,126,64,213,191,11,63,12,191,62,237,141,191,201,150,135,62,196,165,204,62,59,180,129,191,4,36,146,62,105,95,135,191,119,135,160,59,216,146,152,59,247,62,23,191,113,242,10,62,234,44,93,190,27,17,139,62,37,120,64,62,63,202,5,63,251,149,211,62,78,86,169,62,15,7,167,62,173,252,29,62,33,195,218,189,155,197,224,190,170,69,46,190,65,212,83,62,228,81,11,63,112,89,23,189,122,8,159,190,150,152,251,190,238,144,173,62,175,216,150,61,2,47,11,63,11,108,117,190,127,183,86,190,171,226,246,191,163,255,10,60,239,142,22,60,95,93,186,191,223,60,208,191,132,8,61,62,166,154,155,61,250,160,91,191,145,76,1,63,99,62,157,190,17,251,17,190,98,72,171,189,55,142,140,62,25,54,163,190,154,150,217,62,54,162,158,189,122,36,234,190,75,104,189,62,92,48,225,60,10,120,173,190,32,225,171,62,242,141,39,63,116,238,162,190,108,10,69,62,47,132,0,190,175,177,22,63,169,4,140,191,104,168,187,187,163,21,221,62,223,7,141,62,177,12,254,62,156,117,6,191,171,10,121,62,18,38,131,190,165,133,11,63,59,222,199,190,208,74,200,62,237,40,31,190,28,24,199,191,204,39,1,191,229,125,142,191,126,159,99,61,224,241,6,63,117,61,155,62,28,92,11,63,227,228,53,63,164,131,40,63,94,63,194,190,185,44,21,63,102,192,232,186,208,167,20,190,229,118,161,191,143,25,96,62,105,191,14,63,31,98,226,62,237,69,46,62,87,74,85,191,176,108,35,191,78,209,24,63,56,139,243,60,3,111,179,61,53,104,122,62,157,170,218,61,92,75,2,191,226,178,235,189,7,199,35,63,62,39,251,62,199,227,238,191,154,96,234,189,227,147,235,190,249,155,195,190,10,73,145,62,85,251,222,62,253,100,117,190,123,247,1,62,54,234,30,189,133,115,99,190,65,38,9,188,75,169,203,191,174,6,90,191,177,13,176,62,152,166,219,61,102,58,90,191,134,102,63,191,179,69,0,63,251,111,148,191,144,146,148,191,193,111,46,191,8,133,66,61,198,168,141,61,78,26,71,63,5,219,225,190,72,30,122,191,120,114,242,191,161,70,108,61,3,240,74,190,37,241,215,62,166,146,31,191,63,237,25,191,174,237,19,191,211,208,9,191,115,69,6,192,18,239,7,192,97,80,136,62,183,189,159,190,228,126,108,191,64,214,12,63,237,72,178,191,37,90,217,191,117,161,226,190,85,167,154,61,167,66,137,62,144,135,134,62,175,125,152,191,77,0,70,191,253,15,92,190,128,93,32,190,226,193,53,63,185,98,174,191,121,109,95,62,133,78,38,62,45,110,197,62,239,25,13,63,43,168,198,62,133,185,230,189,241,148,22,63,35,110,162,61,192,23,81,62,70,154,144,62,199,67,141,191,79,21,87,62,221,219,201,60,72,28,82,62,60,212,135,191,228,30,77,63,24,111,33,190,35,199,12,191,91,248,87,191,98,156,130,62,21,242,67,62,134,56,27,191,82,232,151,62,158,116,113,189,37,179,52,63,31,70,207,62,100,26,12,63,9,189,169,189,195,23,230,190,154,62,84,62,181,20,167,62,180,89,147,189,244,243,57,62,163,129,46,63,203,34,204,191,198,206,21,190,116,183,253,190,72,175,215,62,3,214,238,62,15,61,114,62,73,48,99,61,44,249,195,61,133,9,245,61,212,13,158,191,18,197,110,189,18,70,120,191,38,166,130,190,208,249,226,191,37,229,165,190,113,155,112,62,54,156,92,191,168,238,90,191,226,42,139,188,90,252,104,62,53,251,162,62,216,122,229,62,106,16,241,61,235,47,144,191,21,135,79,62,241,29,102,191,58,167,0,188,108,148,141,191,134,86,42,190,117,64,31,62,212,2,2,61,124,18,37,63,208,166,77,191,3,123,236,62,200,107,169,62,215,231,53,190,238,198,151,191,208,212,250,62,235,186,51,63,190,187,206,62,193,142,193,190,154,170,245,189,243,112,103,63,174,73,42,190,223,235,167,61,157,16,254,61,138,103,14,188,244,80,179,60,124,242,13,62,116,210,255,62,11,129,230,62,13,7,105,185,105,205,121,62,166,8,229,62,74,61,54,63,164,198,122,62,246,81,2,63,57,1,158,191,30,166,191,62,32,163,50,60,143,64,27,62,189,74,123,191,27,81,217,189,5,188,186,191,60,48,10,191,63,255,13,191,90,100,140,62,159,240,32,63,26,17,22,61,90,91,169,191,214,113,6,190,181,166,165,62,117,220,38,63,235,163,131,62,209,206,167,191,185,232,184,62,193,197,161,191,255,16,142,188,104,97,53,191,193,203,7,63,23,159,116,62,229,241,74,62,6,247,158,189,75,170,27,191,200,168,232,189,81,79,142,191,170,59,152,189,107,240,150,190,214,135,199,61,156,206,0,191,106,77,254,189,94,88,42,191,55,121,62,62,178,237,125,62,191,59,91,62,114,43,236,59,162,132,58,62,45,255,196,62,203,148,138,62,118,208,30,62,230,29,38,191,139,74,21,58,229,96,167,190,220,19,202,190,212,54,24,63,176,190,184,191,115,151,116,60,123,123,170,190,126,151,39,63,148,82,12,189,20,154,160,190,33,239,217,62,22,181,161,62,191,129,230,190,211,237,51,189,132,122,213,191,92,171,35,191,42,80,178,61,171,29,147,190,36,181,208,62,146,205,178,189,74,232,210,190,242,220,11,191,156,173,15,191,52,145,85,190,245,91,34,189,118,71,193,190,185,101,161,60,62,132,216,190,160,179,2,191,246,75,96,61,237,213,75,60,4,150,70,62,4,205,25,63,96,207,89,62,33,40,36,191,255,52,9,61,83,234,91,62,231,101,233,189,140,52,40,62,19,192,102,191,105,215,155,190,88,88,81,62,218,52,236,190,239,62,37,62,229,226,32,63,204,237,72,190,217,20,40,190,255,209,213,61,47,38,166,188,91,12,24,62,138,38,42,60,58,100,55,62,100,20,243,60,214,135,247,187,186,160,30,62,32,162,117,188,89,229,141,62,176,0,14,190,212,148,197,62,52,123,198,191,111,164,24,191,191,41,96,62,88,134,93,61,210,73,61,62,235,139,68,62,230,204,196,191,109,115,138,61,186,79,195,189,78,236,247,61,26,4,137,62,92,116,123,191,91,246,23,191,163,185,141,190,126,17,171,61,36,116,149,62,187,42,62,190,94,73,185,62,151,48,199,189,38,197,201,189,122,142,93,62,84,117,43,191,54,4,176,62,110,54,136,61,205,244,191,62,164,49,7,191,54,186,5,191,107,133,112,62,189,187,5,190,95,138,22,62,2,129,139,190,89,255,252,188,145,244,143,191,182,106,79,61,162,214,130,190,150,11,37,189,79,245,26,63,138,240,35,190,124,104,38,190,46,54,97,190,164,149,50,62,115,107,105,190,72,131,143,189,85,102,39,190,252,80,21,62,216,54,173,190,237,134,203,59,118,121,7,190,25,127,229,61,252,222,80,62,171,195,146,191,63,186,17,190,10,238,138,61,129,142,98,62,66,65,139,191,239,211,218,61,160,211,138,61,192,249,113,62,7,8,182,61,124,230,75,62,65,212,230,189,98,146,7,191,141,245,35,191,10,155,183,62,150,180,156,60,62,84,64,61,1,91,189,62,135,24,239,62,160,178,127,190,84,207,153,190,21,46,81,62,24,246,96,191,93,178,228,60,97,36,104,62,98,110,35,62,135,145,240,61,248,245,61,59,60,164,56,62,65,89,238,62,80,79,151,190,210,199,108,190,89,231,125,61,25,90,19,62,118,246,19,61,87,182,10,62,91,254,42,