{"meta":{"epsilon":0.009986495599150658},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,22],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[166,57,227,190,159,81,169,60,226,165,206,189,28,103,154,190,208,135,202,190,101,74,17,63,53,155,146,189,246,244,53,61,22,16,24,63,91,61,214,62,17,219,166,191,20,253,218,61,51,153,123,62,191,11,129,62,169,190,169,58,199,6,13,62,254,255,188,62,42,240,48,61,208,252,4,63,105,254,18,62,177,231,59,190,238,19,10,190,179,10,159,191,183,225,186,60,252,67,223,190,167,50,149,62,92,218,190,62,4,189,222,62,46,6,190,189,145,190,30,63,242,104,78,191,95,206,222,61,141,209,147,61,60,62,140,190,226,149,29,189,180,53,128,62,65,80,36,62,54,179,90,190,141,17,34,62,203,10,210,190,172,89,168,190,150,215,237,189,145,162,24,62,155,116,215,62,84,146,73,191,195,51,62,189,56,129,162,62,118,190,43,63,94,230,206,61,207,175,119,62,25,176,26,189,3,104,250,62,27,207,162,62,93,142,108,191,142,50,246,189,157,140,136,190,163,149,67,191,198,209,129,191,236,152,196,190,93,106,85,62,102,75,70,63,164,206,207,62,161,77,188,190,27,53,228,59,30,197,220,62,61,82,10,189,178,205,130,62,167,246,104,187,138,19,196,191,238,242,32,191,30,56,41,190,102,229,128,191,91,158,18,191,231,195,180,62,103,82,142,189,171,124,244,190,186,208,15,191,54,206,255,60,108,208,68,190,91,120,20,191,170,187,112,62,163,146,94,190,156,204,213,190,123,213,166,62,105,152,186,189,78,177,143,61,142,83,168,62,64,123,233,62,10,132,4,62,233,225,194,190,112,96,79,62,8,57,20,63,20,144,162,62,31,34,251,61,191,144,154,190,44,58,38,191,205,247,248,190,36,130,134,61,51,58,211,190,222,78,92,191,191,19,160,62,2,21,174,190,79,148,1,63,136,175,29,191,177,46,222,189,133,250,54,190,146,106,138,62,37,140,107,62,206,215,160,190,0,144,43,189,169,213,26,63,27,195,134,190,207,5,133,62,184,127,11,191,212,161,223,62,26,206,106,189,7,230,122,189,115,9,168,62,184,84,213,190,176,79,43,190,55,81,167,61,99,48,214,62,157,172,241,61,17,205,7,191,194,113,141,187,233,129,252,189,247,224,154,62,80,78,1,190,252,51,133,61,249,14,89,190,180,218,243,61,128,49,209,189,91,95,18,63,107,110,223,62,101,68,14,63,147,84,39,189,157,197,38,190,6,82,251,190,33,36,55,190,2,65,97,191,151,40,137,191,88,127,220,188,123,225,246,190,141,237,20,190,33,224,179,61,44,92,254,189,89,146,80,61,175,233,24,191,198,73,17,63,95,186,124,62,142,105,212,189,103,167,215,191,191,0,217,190,4,29,37,190,208,98,204,190,232,11,240,61,79,99,250,190,106,107,129,189,120,21,148,61,2,252,60,187,252,201,145,62,88,172,205,189,51,130,171,62,73,131,136,190,239,89,72,190,121,163,23,62,24,86,158,62,108,175,104,191,226,216,33,191,185,34,40,191,54,3,210,62,102,112,189,187,243,175,72,191,91,103,18,191,55,156,68,190,247,171,34,190,186,65,7,63,22,180,32,61,0,78,122,190,197,142,247,190,171,85,217,189,197,100,184,62,148,111,252,190,189,194,185,190,46,171,112,62,90,2,204,190,224,191,24,62,172,34,49,62,206,230,147,190,176,176,9,63,148,11,125,188,116,134,34,191,91,231,201,61,93,162,171,191,113,81,163,190,59,18,132,61,127,105,3,63,222,174,126,190,251,57,57,191,60,218,221,188,26,50,7,191,59,175,243,62,2,232,154,190,224,127,23,190,78,233,11,63,73,185,61,191,15,171,185,62,50,70,8,191,19,167,254,189,151,76,45,63,52,46,253,62,84,115,11,62,239,101,170,62,234,86,3,191,174,193,62,186,130,75,59,62,199,203,100,190,143,35,210,189,53,34,143,190,93,53,111,191,85,157,61,63,48,168,72,191,215,73,156,62,4,71,45,189,122,206,167,62,201,67,227,190,238,96,10,189,117,28,127,62,133,253,243,190,225,110,161,189,251,255,15,63,180,59,82,61,212,138,9,62,32,191,223,57,161,201,100,191,39,62,15,62,12,31,105,186,129,180,157,190,54,32,38,62,146,107,47,189,162,82,72,63,51,67,237,189,49,228,188,190,44,5,167,190,91,179,76,62,120,65,5,191,157,218,93,189,178,224,152,62,204,17,169,61,10,109,68,190,168,53,141,190,194,90,229,189,23,85,4,190,150,215,143,190,160,77,8,63,156,125,170,191,44,253,0,189,181,216,59,188,105,29,161,62,177,22,106,191,67,10,16,63,227,26,52,62,55,240,247,62,186,14,98,61,51,84,177,56,174,154,143,190,35,72,183,190,75,38,62,63,51,38,222,190,77,173,119,62,132,108,187,190,3,29,160,188,93,158,204,188,13,123,34,62,130,236,132,190,61,97,111,62,244,200,181,62,9,194,47,191,230,40,224,190,131,222,11,62,78,164,69,191,88,228,174,190,123,200,204,62,218,44,141,189,197,216,202,190,27,57,115,191,51,82,85,191,107,108,12,61,78,222,132,62,17,135,68,62,239,78,26,63,151,150,9,63,94,17,244,62,198,191,94,61,17,141,47,191,70,243,204,190,167,188,195,62,54,216,244,190,91,77,48,191,65,155,217,190,68,20,76,190,3,139,13,63,76,220,142,62,49,221,123,62,199,243,194,189,252,242,14,191,59,46,4,62,87,219,240,190,150,130,158,190,23,21,164,190,134,14,48,190,2,235,61,190,141,248,247,190,15,97,183,62,213,232,202,62,52,206,46,190,119,26,84,191,240,87,110,61,84,35,128,191,137,165,123,62,70,143,193,190,86,14,113,189,127,102,44,191,1,74,167,62,67,207,123,189,172,20,80,62,85,218,1,62,236,118,175,190,208,147,207,190,6,7,0,191,79,16,66,191,175,225,180,190,59,245,35,63,17,20,38,190,125,22,153,61,201,224,49,63,40,5,174,190,206,214,40,191,124,142,64,190,212,15,183,190,216,186,183,61,30,240,230,188,162,191,233,62,1,188,81,191,28,97,59,191,60,128,33,191,33,93,142,62,104,25,91,189,196,221,121,62,34,20,106,191,95,221,237,62,99,158,208,62,157,136,6,190,199,112,87,61,182,19,20,189,71,121,73,191,236,119,217,190,50,182,166,190,83,57,117,61,146,172,250,190,201,216,153,190,95,122,29,62,44,110,40,62,96,94,146,190,9,46,57,191,232,226,109,190,198,48,219,190,25,1,107,190,193,87,119,191,192,32,138,62,143,204,66,62,196,156,2,189,9,233,65,61,176,125,81,189,169,247,4,63,221,233,131,190,83,87,66,62,84,237,219,190,97,33,205,57,2,204,66,189,171,174,85,191,194,138,174,191,127,1,10,191,11,73,24,62,249,165,212,189,24,103,99,190,253,118,115,190,27,93,249,190,219,157,45,191,159,122,135,62,206,123,8,191,45,151,2,62,210,242,155,61,187,131,39,191,3,189,44,63,163,131,154,62,212,67,195,189,226,167,231,62,123,81,26,63,44,78,145,61,224,6,103,190,2,77,34,63,0,158,76,191,254,253,248,60,16,253,1,191,222,35,122,189,181,244,78,191,92,223,170,190,4,86,57,62,191,198,190,61,232,199,182,62,13,56,25,191,4,64,41,63,127,1,37,61,246,187,61,62,62,53,255,60,82,150,137,190,255,187,19,190,232,105,250,190,93,166,10,190,22,114,64,190,160,41,146,190,80,169,12,63,18,189,50,62,27,36,160,62,117,92,204,190,9,174,30,191,162,157,24,191,210,47,33,62,35,91,83,189,163,127,103,191,251,84,132,190,118,118,20,191,48,154,206,61,154,135,172,189,143,40,14,190,49,98,162,190,198,112,78,190,156,233,92,191,110,22,5,61,15,168,40,191,93,106,124,190,25,36,68,189,140,187,102,190,15,57,142,191,99,9,214,190,205,21,151,190,212,222,11,63,195,102,219,62,41,96,188,61,15,165,202,190,245,18,1,63,180,232,194,190,223,139,61,62,243,166,227,62,89,158,108,190,214,91,114,189,238,172,44,61,253,214,40,188,73,210,186,61,144,205,63,190,223,33,192,62,150,67,180,188,191,43,194,62,100,88,141,189,13,192,176,61,40,244,129,62,173,208,191,62,57,231,226,62,6,18,212,61,71,149,116,191,48,158,217,62,22,204,48,191,36,178,106,190,88,154,131,191,160,35,162,188,26,110,24,191,124,146,253,190,61,15,16,63,216,219,80,190,111,236,55,191,77,131,26,190,20,246,250,190,28,137,76,62,36,236,15,191,67,203,31,189,29,174,162,189,175,211,187,62,208,142,32,190,126,128,28,62,56,93,70,63,137,90,142,62,6,159,155,62,166,46,236,61,167,228,137,191,23,217,88,63,210,145,218,190,143,32,125,61,54,1,54,191,45,107,170,61,220,108,6,191,238,118,1,191,198,54,134,62,146,96,121,189,171,207,207,62,154,204,15,62,88,166,129,191,83,136,29,62,179,147,224,189,14,31,209,190,178,104,146,190,208,6,0,63,63,237,19,191,252,191,181,62,59,139,43,191,91,193,170,61,136,46,51,191,224,133,21,190,175,152,99,191,126,101,155,62,109,252,50,62,72,4,18,191,216,103,174,190,37,200,166,190,189,23,95,191,41,10,249,62,83,12,59,62,58,173,55,62,233,241,173,190,254,202,158,188,17,183,69,191,251,89,23,62,100,227,149,191,22,66,20,63,188,217,169,190,155,180,89,62,201,184,69,62,255,206,60,63,41,211,116,190,48,178,206,189,94,114,94,189,179,120,174,190,42,144,210,60,33,188,42,190,103,181,54,191,73,104,19,63,155,114,74,191,158,138,234,190,10,28,125,191,243,238,191,61,114,245,3,63,251,250,89,62,11,153,100,188,66,112,242,61,161,188,252,61,82,39,93,62,92,170,198,190,172,249,133,191,18,174,243,190,241,216,70,190,3,18,144,191,227,99,35,61,31,221,252,190,6,152,250,61,22,136,25,63,244,10,153,190,81,100,104,190,119,167,39,63,104,162,167,189,183,192,22,191,169,193,254,62,198,132,107,191,231,99,227,190,165,145,4,190,28,172,144,62,17,184,27,189,193,58,203,61,144,184,108,189,255,152,7,62,126,52,164,190,36,41,13,190,237,229,50,190,255,109,101,190,12,69,3,61,63,154,77,190,2,127,19,191,144,154,135,62,217,78,10,191,173,200,34,190,81,192,27,61,127,252,21,63,83,41,47,62,12,228,102,62,249,120,3,62,59,199,252,190,193,247,172,189,57,220,45,191,255,165,66,190,166,205,164,62,33,72,14,191,194,13,129,62,212,22,121,190,124,65,65,190,152,182,30,191,224,175,161,189,192,231,51,63,60,32,174,190,234,26,175,62,152,45,207,62,31,109,184,189,188,135,233,189,62,67,155,191,106,179,139,188,223,93,210,190,118,118,57,189,7,25,166,189,238,182,197,62,71,81,38,62,251,196,188,62,190,75,120,61,137,13,171,190,152,0,38,190,99,218,226,189,138,9,124,60,34,122,136,191,2,197,147,61,197,18,112,62,239,154,171,60,140,147,240,189,56,104,62,191,116,87,164,191,82,11,82,63,89,245,213,62,15,212,12,62,2,54,112,61,69,123,165,190,193,159,207,62,8,89,22,189,163,7,0,191,255,105,25,191,90,196,132,190,197,45,209,188,71,226,233,61,166,2,51,62,217,98,34,190,98,198,113,62,2,165,66,191,233,197,23,62,159,185,82,62,202,234,43,190,39,221,100,191,252,5,239,189,106,136,47,190,198,137,155,190,124,171,18,63,222,85,179,61,224,147,184,190,116,66,10,191,178,170,80,62,200,158,222,60,173,138,62,191,77,132,241,62,40,61,250,62,228,9,178,190,135,158,62,62,178,79,68,191,9,42,152,61,248,67,97,189,153,136,183,62,128,35,93,190,8,74,215,189,90,188,47,61,76,46,94,190,86,39,15,189,135,55,26,62,174,191,168,189,91,207,61,190,252,142,179,62,197,170,142,190,4,147,168,62,36,38,27,190,213,162,118,190,246,216,139,62,163,149,195,62,92,16,97,61,253,243,113,190,191,168,93,62,244,195,15,61,217,112,18,191,169,175,57,191,119,30,160,191,22,245,187,61,6,193,15,63,195,206,131,191,60,46,40,60,129,248,196,190,45,108,185,62,249,91,150,191,206,8,3,191,173,192,42,60,15,164,229,62,24,150,153,61,198,250,1,190,68,220,33,191,77,14,62,191,188,14,151,190,152,168,167,62,58,78,179,190,24,122,196,62,236,138,84,191,38,84,203,62,52,97,194,188,246,244,102,190,90,214,48,190,170,197,8,61,165,77,188,190,135,191,70,190,112,56,213,62,205,83,20,190,83,48,25,191,217,132,74,61,250,42,137,60,104,226,160,62,238,21,147,190,252,93,144,190,172,105,217,190,80,83,203,61,176,214,219,190,125,234,181,190,150,237,121,62,0,231,215,189,22,8,204,190,63,9,33,191,148,113,170,59,123,133,100,191,55,211,59,190,108,135,19,191,17,178,65,191,62,227,171,62,73,238,177,189,235,34,195,189,164,177,17,62,159,48,135,189,200,231,217,55,119,124,37,61,212,41,1,63,4,103,177,62,144,145,11,62,38,52,18,61,71,112,188,189,236,153,31,190,31,26,109,191,192,13,83,191,159,1,0,63,12,45,227,188,114,235,51,190,85,214,90,191,245,9,245,190,219,109,25,62,59,27,26,62,214,139,110,190,5,47,48,62,77,6,10,63,65,92,245,190,234,120,93,191,232,51,50,63,122,157,87,191,111,161,37,63,49,135,207,190,245,235,146,61,106,228,109,62,118,221,89,190,251,170,159,61,133,64,156,61,217,192,209,190,229,164,78,189,7,68,171,62,156,161,191,61,72,118,215,190,37,31,216,61,186,246,180,62,214,223,125,62,34,26,247,62,130,77,7,63,43,106,166,190,94,88,133,61,45,230,162,61,87,196,248,189,192,206,211,189,161,124,12,62,209,77,60,191,214,150,18,191,196,29,166,190,218,7,212,190,65,53,148,189,189,50,26,63,19,136,134,62,221,111,26,189,152,99,248,190,132,238,114,62,168,142,49,191,5,27,102,190,31,68,72,61,96,224,212,61,251,56,140,62,182,21,59,190,39,198,150,61,17,237,159,190,177,200,139,190,22,74,147,62,90,147,10,61,4,118,219,190,195,168,6,62,194,59,180,62,233,41,166,62,218,233,240,189,63,184,129,62,198,12,46,62,202,245,216,61,53,246,25,63,215,202,71,62,239,75,52,191,217,180,6,62,116,169,215,61,215,250,150,191,33,184,20,189,238,1,49,61,250,21,166,61,123,249,148,190,120,116,58,189,234,117,7,63,69,133,169,190,234,69,132,62,111,46,189,62,246,111,105,62,230,34,161,61,0,88,174,190,221,71,104,190,94,51,3,63,34,112,203,190,56,145,10,191,250,52,178,62,198,217,33,62,57,173,42,190,209,92,94,190,19,195,1,190,109,88,153,190,109,229,105,62,98,154,212,62,12,238,150,62,254,209,131,189,206,134,64,62,127,248,190,190,92,204,182,187,116,66,26,189,57,106,151,62,124,58,4,62,151,109,146,189,35,207,38,191,245,79,58,62,40,52,182,189,15,120,69,189,21,106,149,190,247,96,193,62,185,92,186,61,244,115,167,189,20,9,255,60,91,18,54,191,122,6,9,190,236,28,99,189,68,125,55,63,156,217,193,62,125,45,133,190,181,167,118,189,85,135,108,62,66,196,63,191,230,249,3,190,198,178,227,190,214,84,168,189,68,203,234,190,227,63,193,60,170,157,245,190,70,104,63,190,86,10,157,189,246,45,252,62,7,23,155,61,60,135,141,188,200,189,100,62,127,144,148,190,176,161,202,190,134,36,203,62,197,29,113,62,223,129,61,190,94,2,156,190,169,107,142,189,246,192,215,62,132,163,96,62,70,76,151,60,160,196,147,61,198,82,12,62,204,127,236,62,68,49,99,62,61,136,128,191,188,136,20,62,236,215,132,190,33,2,201,62,23,211,202,187,191,182,67,191,25,204,10,191,180,201,73,189,104,144,23,63,111,89,45,190,79,66,235,188,231,113,71,191,54,91,34,61,207,166,10,190,158,163,138,190,242,243,210,190,152,187,144,189,122,94,182,190,205,112,243,190,255,23,29,62,125,173,15,63,245,140,143,190,161,154,44,190,239,252,172,189,248,90,168,190,171,152,191,61,45,211,141,62,247,78,181,189,214,107,15,191,143,8,161,190,130,116,145,190,210,153,20,189,216,168,86,61,12,232,70,191,238,230,196,62,248,160,134,190,174,131,164,62,251,188,222,189,2,253,147,190,37,46,53,61,206,155,4,190,221,105,110,190,228,15,217,61,229,8,161,62,41,252,142,62,25,49,121,190,132,216,4,63,104,147,137,62,46,85,97,60,247,125,48,191,203,46,26,190,24,141,97,190,115,165,31,62,46,1,185,62,184,118,62,62,61,24,55,62,199,88,142,189,11,81,156,190,138,25,72,62,139,57,36,191,22,186,42,62,161,0,121,187,127,158,74,191,141,80,105,190,16,49,125,61,76,222,146,61,207,124,125,61,164,153,109,191,177,189,61,191,221,243,210,189,236,183,42,191,32,93,170,61,80,229,110,62,205,103,67,190,100,45,33,62,228,161,74,190,179,193,183,62,87,67,219,62,50,190,135,191,37,204,242,61,27,17,147,62,164,200,4,63,18,67,203,190,191,128,182,62,25,113,5,191,78,197,38,191,87,229,137,191,163,68,35,191,236,238,227,61,61,79,207,62,128,168,171,62,204,239,192,62,151,103,57,62,191,64,74,62,38,231,149,190,24,198,188,190,99,95,255,190,11,117,73,191,181,176,130,190,34,227,107,189,17,253,155,190,239,126,236,62,17,156,148,62,90,145,156,190,148,29,19,191,24,146,255,61,45,98,250,190,41,71,232,190,190,167,16,190,75,48,106,61,196,36,22,61,92,73,11,61,157,71,20,191,235,54,11,63,41,100,158,61,61,69,196,62,14,160,112,62,135,192,52,190,113,15,182,62,26,30,36,61,17,82,137,62,147,53,211,190,99,4,23,62,227,10,37,189,142,218,51,62,146,22,98,190,199,250,150,61,21,157,244,61,117,2,116,62,215,220,91,188,82,48,134,61,70,107,199,61,134,192,238,188,24,0,204,62,150,206,199,190,154,250,62,189,245,21,185,190,124,69,72,190,160,65,237,62,244,117,102,190,9,149,25,191,139,102,57,190,33,160,76,61,232,45,201,190,131,217,158,62,129,231,112,188,149,18,228,189,3,223,212,190,80,74,26,191,17,253,48,62,231,103,37,190,18,91,138,62,232,229,129,190,105,61,121,190,224,118,21,62,157,64,165,61,79,213,224,62,76,201,119,62,242,159,44,190,144,29,11,62,87,206,208,190,88,37,112,60,152,204,186,62,148,2,27,191,144,143,235,62,95,122,212,190,107,137,220,190,109,49,96,61,191,4,13,62,14,78,178,61,165,92,223,61,41,72,214,190,1,67,11,61,101,1,228,189,189,181,61,191,95,103,232,186,255,169,62,189,185,5,206,58,37,119,233,62,120,100,236,61,56,173,167,62,101,167,49,62,115,202,51,60,43,183,183,61,200,66,160,190,122,22,71,62,25,189,19,61,12,146,59,190,175,208,29,62,24,47,86,56,100,216,182,61,36,114,139,62,150,183,53,190,119,159,223,60,186,83,222,62,23,98,155,62,224,185,148,190,124,249,141,188,157,113,204,189,4,89,225,189,199,181,134,62,104,56,74,191,236,116,166,190,185,9,57,191,181,71,175,190,237,116,112,62,237,3,153,189,193,173,136,190,231,206,243,61,228,177,68,62,28,45,152,191,46,182,238,61,236,65,0,190,143,14,44,191,14,224,70,190,9,11,114,190,34,200,184,190,47,108,64,61,141,119,37,190,243,158,81,189,115,0,251,61,82,58,141,189,51,29,175,62,123,10,84,189,241,30,71,190,213,154,254,188,253,15,135,190,106,153,54,62,146,32,24,190,63,121,74,190,149,167,49,191,145,228,248,188,138,32,98,62,112,103,145,188,146,104,211,190,178,107,195,61,105,97,164,189,43,73,110,189,7,244,185,189,74,35,192,62,87,252,25,61,195,99,194,188,235,238,13,61,250,226,70,61,66,93,246,188,176,133,98,190,67,189,24,62,106,105,203,190,123,235,177,190,150,242,203,187,250,55,184,61,54,215,132,61,170,156,224,190,203,27,185,189,79,116,164,61,63,141,24,60,215,170,226,190,216,202,52,62,248,249,90,61,200,131,43,190,151,137,160,61,45,22,182,61,199,99,60,189,129,199,165,62,28,172,174,190,193,169,18,190,175,230,196,189,131,145,137,61,40,50,237,190,74,157,69,62,235,102,136,62,225,105,253,61,186,175,251,190,245,187,31,62,33,132,209,188,146,209,236,62,120,15,195,190,55,162,136,190,189,55,44,62,252,252,36,190,29,104,209,61,254,169,135,62,65,111,95,61,96,194,149,187,148,189,37,191,121,244,137,189,168,212,186,189,71,251,2,62,228,73,1,63,5,152,30,62,57,153,241,190,129,90,50,61,11,29,104,62,48,163,51,60,88,222,134,62,48,136,81,190,172,219,171,190,53,194,13,190,113,231,191,189,36,240,189,61,219,59,28,61,34,8,237,61,77,2,237,190,37,7,10,191,196,234,70,191,92,247,6,63,254,206,101,59,93,16,56,62,98,178,124,189,114,241,98,62,28,134,78,191,215,239,52,191,2,152,178,61,202,100,159,190,109,144,75,62,84,38,127,62,83,69,82,62,153,128,99,62,206,4,53,60,60,147,29,62,62,44,15,61,234,70,192,61,224,91,16,61,66,90,75,189,82,150,154,60,51,67,114,190,53,79,61,62,103,141,242,188,12,221,215,62,144,114,28,61,176,233,168,62,187,99,51,62,83,219,111,62,207,20,4,63,23,169,141,189,98,154,145,62,158,177,153,190,155,4,212,190,255,221,31,191,95,169,17,190,224,58,64,190,150,96,147,62,67,187,233,60,206,64,5,63,209,66,122,62,222,140,95,62,134,255,213,189,211,15,86,190,168,138,230,62,225,145,25,189,219,65,73,62,62,237,102,190,7,18,154,190,145,159,220,187,226,15,192,62,27,225,29,189,160,110,4,191,56,169,82,61,60,207,105,190,44,80,220,62,172,88,200,62,196,115,163,61,186,249,53,189,165,208,168,190,121,156,69,190,75,254,145,190,45,154,57,60,34,211,30,62,48,139,128,190,87,138,192,190,172,237,236,61,176,156,249,188,235,131,74,191,58,186,65,62,215,69,126,62,246,153,199,61,79,176,102,62,120,212,6,191,52,156,43,190,127,193,110,61,0,185,219,60,136,12,194,62,129,79,10,190,94,172,120,190,22,37,22,190,194,104,55,191,35,103,146,190,186,168,147,190,4,162,64,62,185,170,130,189,185,165,12,190,237,218,107,62,39,132,236,187,236,12,85,190,124,254,27,191,97,104,173,61,34,179,166,190,171,109,93,62,100,32,25,191,219,145,54,188,11,155,231,61,147,133,217,189,197,236,163,62,244,40,8,61,93,219,41,62,5,38,51,190,236,243,163,190,51,133,23,61,221,72,144,59,27,119,86,62,97,229,35,191,150,113,49,61,130,68,131,190,243,171,29,190,149,64,86,191,204,8,87,190,100,156,33,62,178,0,187,62,211,60,179,61,32,176,37,189,214,122,227,188,6,10,17,62,138,122,25,190,229,66,6,191,71,216,140,62,53,110,33,62,42,122,130,191,4,182,210,190,74,166,65,191,134,66,193,61,230,227,8,62,197,206,106,190,238,32,207,190,160,1,88,191,119,153,3,62,103,105,174,62,169,28,161,62,76,141,102,191,164,76,173,60,13,90,64,189,32,248,52,190,4,130,66,189,250,61,78,62,171,151,175,60,141,252,50,62,108,55,13,61,69,201,238,187,176,25,150,190,75,76,151,62,0,149,46,190,161,159,131,62,149,183,11,62,118,78,140,62,100,74,155,190,40,200,160,62,187,112,32,190,106,110,208,62,30,107,22,190,91,19,17,62,33,253,56,62,36,97,174,190,250,194,98,62,252,69,228,190,22,12,59,190,89,120,25,189,123,175,0,62,143,34,20,62,60,1,10,191,119,89,144,190,219,179,20,62,199,210,139,62,210,191,56,62,198,176,27,190,145,34,89,190,194,164,195,60,204,189,1,190,73,172,89,190,105,9,129,189,175,193,172,60,33,109,51,190,89,239,31,189,95,51,12,59,198,75,146,189,32,157,57,62,214,245,111,62,255,65,100,189,65,34,112,62,23,92,11,62,223,133,83,190,126,114,151,62,83,60,108,188,217,98,69,60,3,26,16,62,34,198,11,190,167,90,31,62,239,154,183,187,137,202,52,190,131,205,87,62,0,82,88,191,228,186,191,190,82,51,235,62,234,20,157,190,119,218,114,189,25,181,232,62,116,162,189,190,20,237,105,191,34,109,5,188,93,25,210,188,167,154,243,189,195,36,136,190,160,177,7,61,12,136,47,62,2,146,112,189,42,139,105,190,128,199,186,61,215,213,7,189,126,178,167,190,207,118,192,190,23,46,183,62,234,37,6,191,243,100,74,190,59,233,81,188,252,205,231,188,11,211,184,62,143,79,61,62,205,75,115,61,153,50,162,190,237,254,15,62,27,13,122,62,124,143,58,62,96,28,110,62,6,152,15,191,204,160,19,61,104,184,116,62,147,39,233,189,55,142,6,188,158,82,193,61,70,209,129,190,54,24,237,190,131,26,147,61,30,98,198,190,74,181,172,189,194,247,196,190,178,133,203,188,242,26,222,190,188,70,151,61,198,11,39,62,109,74,25,190,119,167,49,62,116,45,98,62,205,91,177,62,187,108,26,190,161,204,56,61,135,127,112,189,207,50,166,189,138,104,147,189,132,149,212,190,34,108,149,62,129,79,60,190,88,106,140,190,21,24,150,62,174,205,207,61,60,8,167,62,132,187,5,191,152,110,163,190,40,60,250,60,120,183,182,62,65,56,17,63,2,193,52,190,85,28,153,62,16,219,23,190,163,173,76,60,152,51,81,62,93,157,35,189,154,96,175,185,235,204,229,190,221,33,34,189,11,144,1,61,213,130,141,190,155,36,93,190,148,38,18,62,156,75,234,189,178,165,222,62,179,215,139,62,172,39,187,61,94,232,138,190,140,28,244,62,81,156,83,62,209,198,52,190,197,144,227,61,40,173,0,62,179,114,166,190,12,80,94,62,138,170,172,61,230,130,83,190,101,16,72,191,106,9,243,189,82,120,49,190,196,46,250,61,202,46,182,62,0,6,198,190,168,241,61,189,98,35,34,190,165,221,57,190,52,80,218,62,199,180,13,190,89,93,245,61,167,226,137,62,196,135,127,58,3,175,2,62,107,183,23,191,150,221,209,190,42,105,23,61,154,214,120,189,86,232,217,189,70,5,2,189,83,60,124,62,126,126,11,191,114,128,113,62,138,42,91,59,73,225,138,61,234,4,180,190,212,4,143,62,123,89,48,61,196,235,107,62,6,14,167,189,186,242,123,189,66,129,131,62,63,100,194,188,239,121,7,62,250,215,67,190,100,83,235,62,74,88,160,190,73,140,22,191,130,143,14,63,214,198,39,62,192,138,110,62,25,225,26,191,125,216,101,61,241,229,132,190,116,21,188,191,187,193,144,188,117,59,18,190,36,10,152,62,67,19,10,63,193,175,136,61,197,186,107,62,111,204,154,188,66,16,146,190,223,60,68,190,101,34,184,190,172,122,34,190,137,68,210,62,163,246,49,189,118,1,162,189,68,190,130,191,24,214,29,188,77,11,85,191,171,151,90,189,118,169,196,62,57,230,12,62,109,67,229,62,238,89,167,61,166,117,149,62,238,229,123,62,160,55,207,189,147,199,81,62,29,65,142,189,68,74,150,62,52,87,115,189,30,87,16,63,239,213,177,189,43,156,4,61,61,52,134,191,161,14,135,190,221,94,187,61,79,60,148,62,108,213,42,191,65,166,177,189,117,152,138,191,188,133,227,190,119,88,146,189,205,19,183,62,85,178,151,62,138,157,40,61,231,219,139,62,129,90,26,190,51,141,60,190,8,26,177,62,2,239,254,62,132,112,95,190,107,181,8,63,43,168,55,62,244,153,73,189,146,96,170,62,252,239,245,187,114,107,200,190,142,18,44,191,239,61,140,62,180,28,85,62,11,237,33,188,80,240,88,62,151,8,35,63,78,115,25,189,108,239,12,190,155,142,218,190,60,45,9,191,252,225,78,191,60,170,99,190,134,168,197,61,198,220,82,191,56,239,167,62,136,179,132,188,160,80,10,191,168,230,95,62,117,58,214,62,215,20,214,61,94,52,55,62,47,194,15,191,116,22,130,61,141,97,171,185,146,171,98,191,240,165,104,191,96,248,128,62,227,104,147,61,122,14,213,190,115,46,119,188,90,183,10,191,1,223,238,189,143,139,98,191,191,46,75,62,193,62,1,190,30,114,84,190,98,127,150,62,102,40,35,190,159,232,154,62,94,107,170,188,143,253,33,62,13,58,191,190,54,83,83,190,58,154,212,189,131,34,204,61,48,243,188,190,43,172,14,190,245,143,89,190,185,205,2,61,212,112,23,63,66,93,220,62,28,116,63,62,248,200,243,189,58,138,91,190,30,168,28,191,204,166,38,62,198,176,20,62,97,28,129,60,161,35,168,62,127,232,184,191,67,208,63,189,201,42,251,62,208,235,195,61,129,143,38,62,7,188,88,191,103,175,128,62,102,37,243,61,182,200,216,62,100,92,23,191,250,167,148,189,87,98,105,61,59,215,167,62,90,229,166,61,181,222,3,60,220,147,132,62,75,204,95,191,201,138,203,61,199,177,197,62,233,247,212,191,231,67,28,190,160,42,19,189,24,170,243,62,110,50,175,191,203,133,129,62,165,184,236,190,228,143,63,62,29,167,173,62,38,229,203,191,32,95,12,189,139,54,249,190,35,247,202,190,136,112,76,191,208,144,93,191,247,251,165,62,216,62,40,62,199,203,59,190,134,37,21,62,36,99,43,62,0,166,200,59,220,148,192,190,92,120,66,61,106,96,125,62,202,181,112,62,182,162,233,190,99,42,48,190,20,42,16,62,162,134,106,62,171,181,79,62,160,216,95,191,60,244,228,62,132,152,59,189,171,206,1,191,5,220,83,62,235,97,186,62,127,35,199,61,182,98,82,190,8,40,18,62,246,226,202,62,142,94,161,188,137,127,208,62,91,231,148,62,24,218,183,62,140,96,17,62,53,220,131,62,161,215,128,189,167,225,45,191,74,127,208,62,106,218,81,189,204,68,85,191,189,30,82,62,156,132,206,189,207,169,66,191,246,141,112,191,102,102,77,191,49,213,53,62,233,106,18,63,53,254,180,187,251,14,34,189,184,57,142,191,4,80,214,60,217,231,167,190,151,162,68,190,210,242,243,190,15,7,53,62,247,196,237,190,60,171,180,62,22,66,10,191,116,1,89,190,221,24,196,61,217,44,93,191,103,1,164,62,54,124,156,62,76,200,150,190,152,90,253,188,243,188,148,188,34,243,77,62,233,177,47,62,34,185,48,190,116,83,136,62,3,119,47,191,76,188,188,190,252,16,142,191,62,11,91,190,166,83,185,189,66,203,206,61,224,55,24,190,107,118,104,62,13,248,43,62,209,142,8,61,145,62,105,62,187,240,14,63,173,175,169,62,181,198,224,62,164,26,44,62,16,184,169,190,222,98,166,62,113,69,71,191,93,63,21,191,129,228,153,61,218,181,237,189,90,251,236,189,169,98,61,191,113,78,101,189,44,18,180,189,146,162,109,62,246,83,177,190,100,74,199,62,79,247,5,63,235,208,11,63,33,101,46,191,79,99,204,62,158,31,107,62,38,85,33,61,136,14,3,191,209,12,161,190,194,9,81,62,74,237,19,191,122,164,217,62,96,28,235,62,3,208,170,62,131,80,45,190,96,58,124,62,152,66,208,190,133,51,219,190,200,212,56,191,92,76,128,190,214,91,71,62,68,36,150,190,85,218,41,62,187,2,60,190,16,60,18,63,203,127,247,190,89,206,22,62,91,126,166,191,42,211,52,191,208,96,167,190,46,226,146,61,253,45,249,189,182,93,11,191,52,15,74,190,38,146,217,61,43,145,96,62,193,180,111,191,24,217,49,62,27,208,148,190,89,23,176,61,166,230,119,61,129,181,140,61,75,243,217,62,4,209,253,190,164,248,218,190,173,6,21,63,85,205,162,60,151,77,106,61,115,168,182,62,179,39,201,62,29,84,57,191,16,221,173,62,12,144,148,190,244,240,199,187,172,158,244,190,236,125,101,190,53,112,235,190,230,200,101,62,43,107,21,62,170,220,211,62,5,185,74,62,223,184,88,62,212,129,62,191,115,117,231,189,244,109,10,191,219,54,79,191,143,61,130,62,136,91,50,191,65,141,134,190,246,137,150,189,99,57,189,62,92,226,209,190,156,128,19,191,3,254,67,61,47,255,143,61,157,151,228,190,57,221,83,190,35,141,50,62,211,181,158,62,193,108,143,62,75,5,143,62,50,189,192,190,253,210,80,190,157,99,249,190,28,38,142,62,81,4,27,190,203,104,180,62,19,34,13,191,185,251,135,191,109,196,179,60,153,188,18,190,198,114,146,62,121,183,5,63,237,243,54,190,182,238,144,62,8,51,54,191,130,205,22,189,109,212,14,62,218,185,140,62,222,211,25,62,113,87,214,61,193,14,152,62,215,210,169,62,221,46,1,191,201,19,3,190,249,184,151,62,33,67,104,62,147,232,65,62,211,142,44,188,199,74,57,190,114,162,191,62,120,251,71,62,103,57,197,188,240,226,169,60,150,42,134,62,101,34,51,60,28,53,150,62,10,63,25,191,83,162,145,191,66,198,54,191,230,50,63,189,117,39,6,62,225,48,22,190,5,199,199,61,202,9,182,62,16,50,251,62,31,132,192,190,19,159,115,190,150,141,124,61,52,23,104,62,45,148,194,189,229,196,149,62,220,62,239,190,10,149,146,191,33,22,70,62,95,226,177,190,217,245,252,61,186,16,158,61,195,65,102,191,204,112,80,61,25,96,62,189,106,140,40,190,63,126,159,190,128,48,182,61,145,102,205,60,237,96,41,62,97,17,34,190,4,229,133,190,81,226,192,190,225,20,162,62,136,85,122,61,135,183,87,191,146,59,131,191,193,163,114,191,142,84,216,189,117,214,16,190,159,190,158,191,168,226,162,62,240,122,116,62,201,248,120,62,17,145,28,61,66,198,24,62,171,27,3,63,200,255,239,190,153,159,173,62,144,132,130,62,47,254,119,62,40,162,7,191,84,213,25,189,106,248,193,62,174,245,243,189,82,142,239,190,70,6,73,191,94,90,175,190,29,114,19,62,143,82,146,62,127,25,203,189,180,69,229,61,153,92,94,62,174,128,157,189,255,45,9,63,167,179,155,62,137,126,192,189,71,111,220,190,96,67,120,191,187,170,29,190,79,105,184,62,209,150,161,189,24,201,119,190,106,222,138,61,82,169,208,190,22,248,124,62,44,42,161,62,195,39,49,62,188,251,129,61,64,222,149,62,90,58,199,190,60,240,30,62,47,144,113,60,50,91,8,191,76,129,255,62,119,133,179,188,160,72,128,61,125,240,71,62,145,37,38,191,172,53,133,191,74,61,20,62,223,173,30,60,97,21,156,61,61,111,54,190,128,5,131,62,117,65,110,61,65,155,187,62,215,22,31,191,250,61,190,190,133,125,139,190,113,24,46,62,20,121,206,189,206,197,39,62,65,84,64,191,210,161,138,61,13,66,132,190,10,56,1,190,220,67,157,60,241,148,116,191,5,55,92,61,140,178,19,191,46,68,241,189,15,214,77,191,130,171,229,62,74,162,174,61,201,130,203,62,178,240,39,62,151,209,193,190,119,186,230,189,210,83,16,189,69,23,27,62,163,253,206,61,241,160,176,62,138,241,75,191,95,23,93,191,166,247,151,189,39,208,82,190,48,166,191,188,44,216,172,62,243,208,248,190,10,22,141,191,68,18,54,63,223,118,18,61,11,102,211,62,53,200,237,189,146,189,144,62,204,1,33,190,244,123,3,62,117,137,135,190,199,148,33,62,38,186,202,190,181,247,138,62,127,129,100,190,81,94,189,189,197,133,178,62,244,81,138,191,198,45,91,188,71,68,141,190,228,49,239,188,149,151,206,190,216,49,16,63,193,85,113,191,229,82,59,186,45,139,175,62,109,244,208,189,19,234,75,191,14,250,200,190,136,13,173,62,110,186,67,191,115,60,71,62,116,210,101,62,62,38,234,190,47,228,110,191,197,73,39,61,65,249,196,189,215,156,27,190,31,145,117,62,185,61,19,61,191,233,143,62,45,1,187,62,233,234,239,62,231,43,84,61,47,228,104,191,181,142,27,62,136,23,140,189,161,31,220,190,14,210,144,62,191,186,222,188,156,116,82,62,91,30,170,190,127,82,8,62,73,79,108,191,197,186,159,191,83,120,168,191,222,16,96,62,135,209,141,191,218,78,54,62,19,182,129,189,23,157,156,61,118,195,160,189,21,45,248,62,78,132,226,187,174,218,23,63,32,174,204,60,224,26,134,62,79,125,139,187,157,56,160,62,168,243,28,62,130,208,140,191,66,122,171,189,187,176,162,188,80,183,146,189,74,195,55,60,169,7,183,59,41,75,199,190,50,33,199,187,65,209,103,191,21,1,168,60,148,120,131,62,111,36,231,62,97,30,191,190,46,215,112,189,78,44,200,190,108,169,23,189,74,169,210,61,154,216,14,63,206,234,168,62,155,26,130,62,80,153,66,62,243,232,70,190,253,58,10,191,247,155,85,62,238,167,19,61,224,35,201,190,173,105,24,62,140,54,219,62,221,62,49,62,118,216,54,189,76,148,77,191,181,245,228,61,116,183,106,191,216,149,196,62,236,48,209,190,203,62,33,62,54,135,165,191,218,71,170,62,197,115,124,190,217,88,39,190,3,82,25,191,126,64,243,189,155,162,217,62,5,126,54,62,162,105,212,190,114,226,121,62,44,22,22,190,14,172,19,62,226,135,107,61,121,91,146,62,47,122,89,62,250,200,138,191,209,241,133,61,23,167,196,62,222,166,182,62,66,41,0,190,92,245,8,62,189,62,63,62,67,250,74,191,233,137,211,190,29,170,89,61,91,234,41,190,177,217,139,191,200,10,87,60,84,211,237,189,235,33,22,190,248,76,165,190,143,47,105,191,93,194,34,191,95,29,227,189,219,20,129,62,13,186,58,61,149,146,130,62,65,176,53,191,73,40,226,190,134,144,2,63,86,88,204,62,168,24,147,61,181,50,77,61,101,11,2,191,123,150,181,62,194,23,60,190,51,22,139,61,145,93,221,61,45,93,180,61,61,57,148,190,113,129,242,189,33,42,6,63,22,67,188,62,93,41,251,62,158,83,56,62,121,94,141,62,85,208,10,190,12,184,186,61,74,171,167,62,80,199,42,191,43,93,248,190,164,86,169,190,253,238,182,61,191,188,240,62,176,100,144,190,52,67,89,191,104,146,9,63,84,63,37,190,133,199,107,62,21,190,191,62,185,251,95,189,237,175,35,61,86,146,54,190,146,79,149,62,118,198,218,187,174,145,115,62,165,151,6,61,45,204,16,63,145,231,137,61,80,86,22,63,137,133,63,62,158,89,162,191,86,95,186,189,214,225,132,190,213,165,6,62,148,255,134,62,93,33,150,190,194,117,193,62,15,65,251,60,139,12,125,62,151,162,40,190,61,25,209,190,195,53,25,191,181,151,170,190,6,238,204,62,161,96,117,190,185,21,172,62,172,3,225,190,190,234,136,60,173,221,80,191,147,133,144,190,81,193,88,190,182,138,25,190,50,163,153,61,178,126,16,63,157,73,46,191,231,223,29,191,0,92,81,190,200,11,4,63,62,86,62,62,153,175,35,191,224,155,218,62,117,58,65,61,229,176,88,62,95,29,217,190,199,163,119,61,194,78,116,62,105,46,102,190,196,37,88,191,60,10,88,190,222,146,213,62,246,22,95,62,249,159,63,191,249,245,112,189,195,252,182,190,144,148,20,62,179,57,145,61,108,112,148,190,13,96,152,191,86,35,128,62,248,86,214,62,99,188,190,190,44,17,192,62,25,32,114,62,164,248,129,62,172,10,43,62,135,112,18,191,30,89,10,191,73,74,238,60,126,167,179,190,205,122,131,62,90,179,44,61,29,12,137,190,55,132,234,190,123,132,158,190,222,88,74,191,223,46,97,62,206,125,243,189,119,49,13,60,213,227,47,62,4,138,155,191,86,63,111,189,146,41,154,62,136,105,50,191,108,77,66,62,72,143,46,62,11,31,130,62,166,232,161,62,54,82,229,61,121,138,95,190,229,116,93,62,88,161,10,189,244,225,19,62,28,107,161,191,15,97,10,190,170,83,176,190,243,142,44,191,170,100,41,189,88,64,131,189,192,197,208,189,218,209,75,62,72,20,253,190,40,10,133,60,60,73,201,190,52,246,211,190,80,104,24,191,172,44,135,62,95,104,156,62,200,133,38,191,29,59,6,190,218,78,165,62,67,180,64,191,95,27,168,189,158,88,219,62,22,13,195,62,151,164,34,62,55,128,93,190,216,172,218,190,57,99,17,191,67,204,133,62,166,127,1,63,119,78,182,190,175,177,254,61,155,110,171,62,197,143,218,61,235,81,251,190,224,219,6,191,162,10,141,62,93,232,74,191,216,168,53,190,28,15,84,189,209,168,147,190,228,233,219,60,66,237,94,191,105,184,84,191,115,100,35,189,88,220,215,61,131,123,138,191,86,120,64,62,57,137,151,62,193,151,3,61,153,93,250,189,181,110,229,190,177,236,103,188,85,141,64,62,59,178,141,61,183,10,7,62,44,135,139,190,207,84,83,190,5,251,60,60,40,86,241,190,206,43,50,191,233,91,177,62,27,94,161,190,88,186,98,190,3,134,147,62,140,230,86,190,81,13,232,190,11,49,147,189,141,22,24,191,81,233,154,187,247,38,220,190,59,125,255,188,141,109,34,62,92,197,165,62,177,150,151,190,124,136,22,191,38,198,175,190,84,201,14,190,150,60,39,191,227,46,203,190,166,126,172,62,164,168,131,62,222,168,135,62,240,13,145,62,85,41,188,62,145,68,109,191,151,127,97,191,83,38,204,189,206,27,148,60,210,98,49,62,47,67,197,61,237,47,177,62,70,208,224,189,41,114,178,190,196,84,59,189,184,46,184,62,215,171,130,62,84,163,175,62,240,78,92,58,168,130,167,62,12,30,164,187,98,98,27,191,151,196,251,61,149,214,217,62,224,84,73,61,193,242,238,189,116,28,183,61,230,229,30,62,169,55,153,61,255,186,241,189,45,29,68,62,52,73,252,190,56,232,223,189,227,209,195,189,59,15,161,62,28,204,116,191,201,239,18,62,103,214,128,62,70,231,252,62,29,210,208,61,219,181,63,191,43,165,8,190,190,107,186,61,84,25,135,189,181,230,165,62,125,139,9,62,59,162,208,190,79,32,36,62,221,86,255,188,34,248,65,62,254,138,164,190,209,7,198,61,152,80,71,191,18,102,213,62,66,74,236,190,205,94,95,190,227,183,28,62,138,235,88,61,134,224,255,61,58,196,115,62,227,229,170,61,85,112,28,189,91,3,200,190,186,122,1,62,50,93,73,62,41,252,62,60,93,40,144,191,140,21,11,190,181,14,23,191,122,244,136,62,31,235,202,190,146,254,155,61,214,45,25,62,131,55,93,62,19,161,83,62,159,10,192,62,80,41,205,190,8,182,202,60,246,177,79,191,72,54,192,62,246,221,152,62,82,137,89,191,166,179,124,61,106,211,64,190,160,211,83,191,62,224,245,189,60,58,165,61,86,112,68,189,183,14,18,190,138,11,119,189,64,22,145,190,143,221,146,62,158,68,223,190,88,125,53,60,186,48,16,189,107,32,210,62,81,77,60,190,83,209,17,190,174,74,141,191,31,134,201,62,88,28,22,191,203,60,156,188,44,70,92,191,176,17,53,62,79,80,115,191,108,173,58,62,85,11,11,63,215,0,41,61,180,6,151,191,97,123,56,191,75,219,30,189,75,218,71,191,122,134,131,190,82,122,53,190,187,181,207,190,193,199,14,190,97,111,103,190,142,140,140,61,230,147,30,62,157,153,101,191,75,248,78,62,221,160,57,62,89,80,139,62,122,69,41,190,194,64,226,189,91,164,201,62,42,186,88,191,183,73,174,61,72,115,30,62,117,16,186,62,202,104,114,61,43,82,37,62,18,139,251,59,215,252,63,62,35,177,25,62,60,111,132,62,24,56,206,190,22,230,123,62,191,194,195,188,233,1,142,190,174,81,228,62,116,250,191,190,34,143,125,62,201,245,19,63,198,238,198,190,40,166,23,191,41,207,76,62,218,74,34,190,251,202,127,191,206,128,229,61,190,116,65,191,73,198,153,62,74,191,255,62,83,197,200,61,141,2,179,62,168,157,241,190,109,176,141,62,50,190,33,62,158,100,4,62,54,41,235,188,230,166,148,62,219,212,37,191,116,249,217,189,81,246,253,190,162,204,160,190,119,207,237,62,161,187,71,190,214,44,0,63,118,136,36,190,106,132,57,191,206,36,218,190,145,180,86,62,146,163,113,189,131,59,156,62,28,179,77,191,221,25,76,190,86,234,143,62,183,174,133,61,180,223,173,190,88,17,177,61,36,3,5,63,17,74,11,191,129,151,224,190,200,246,92,62,163,16,90,189,158,242,142,62,215,176,237,61,131,21,202,188,175,201,210,61,145,202,42,190,98,53,139,62,198,50,131,190,84,219,206,190,131,46,114,191,37,189,147,62,183,5,217,60,95,120,79,190,23,202,100,189,104,142,171,189,127,78,171,60,183,53,23,62,232,223,230,62,129,76,224,190,133,234,169,190,79,33,121,190,41,81,90,190,25,1,155,187,190,159,164,62,179,74,240,189,251,22,21,62,6,25,211,62,155,231,100,191,126,42,55,61,114,187,157,189,193,41,53,62,226,30,189,62,130,100,220,61,109,248,192,188,206,215,134,190,44,48,102,62,18,119,14,190,214,158,241,61,177,63,62,62,242,64,244,189,191,31,2,62,55,15,160,190,126,44,151,190,121,6,58,61,104,194,33,62,211,6,14,190,44,250,62,190,166,172,64,61,249,118,156,61,145,192,140,190,36,50,27,190,116,248,63,191,119,119,78,190,182,228,241,189,102,230,89,189,114,68,190,190,227,168,108,189,215,65,10,61,252,105,135,62,110,247,182,62,190,88,247,188,73,99,7,61,147,51,50,190,245,26,252,59,53,182,203,189,179,233,209,62,36,108,231,186,69,224,130,62,148,211,70,62,249,155,200,190,11,52,57,61,106,82,198,61,175,168,61,62,214,225,220,190,11,74,98,190,5,138,115,62,66,121,95,191,179,75,53,191,65,162,58,191,93,50,247,62,30,243,210,62,50,183,61,190,137,170,115,188,42,40,186,190,148,92,84,62,189,116,113,62,176,242,145,190,117,219,79,62,46,127,115,62,148,115,178,62,121,175,73,62,92,95,25,62,189,82,177,62,152,115,187,61,41,207,213,190,121,104,228,189,189,31,121,62,182,112,251,189,199,183,31,62,101,169,94,61,94,130,98,190,163,235,171,61,46,38,12,62,155,161,67,62,152,154,47,60,127,5,95,191,215,119,97,190,17,119,4,190,113,121,87,189,14,37,233,62,110,120,36,191,9,219,84,190,168,188,174,191,146,101,216,62,80,231,107,62,162,183,156,189,226,204,38,62,247,138,231,189,176,82,147,62,43,189,194,190,59,105,194,61,249,4,244,190,204,140,219,60,199,78,202,61,85,33,53,189,131,233,5,191,125,19,159,189,82,228,158,59,238,27,115,191,239,4,57,190,175,236,11,191,22,233,249,190,251,5,128,189,145,219,249,61,40,169,223,190,67,233,32,62,34,154,29,62,4,182,47,62,176,71,165,189,198,100,181,190,27,215,240,189,241,199,244,191,133,214,176,188,114,180,36,190,174,177,9,191,19,74,144,190,189,204,243,59,60,50,58,189,102,51,19,61,118,57,177,190,24,222,132,189,94,151,43,190,218,37,31,62,250,10,56,61,153,203,7,62,98,190,185,191,38,117,207,189,57,158,48,191,196,96,64,191,119,43,132,62,176,224,210,190,241,61,30,61,183,194,176,190,105,85,11,62,56,49,10,190,208,88,129,62,0,146,204,189,249,15,144,190,235,12,250,189,201,20,40,61,193,198,200,189,212,170,45,190,252,110,7,62,81,54,129,190,76,23,22,62,177,60,252,61,1,52,145,190,64,100,63,190,85,54,65,62,209,41,218,62,49,218,172,190,25,50,19,62,155,116,41,62,195,148,80,190,247,116,234,189,14,78,222,60,132,235,186,62,123,116,33,62,193,112,13,191,30,99,93,190,225,132,251,189,10,70,219,60,50,145,71,189,50,236,115,61,100,201,138,62,177,126,115,62,68,25,151,60,138,148,215,189,182,241,188,61,3,212,89,189,40,191,24,62,226,237,241,61,35,199,8,62,223,180,128,190,209,206,66,62,246,58,136,190,117,0,96,191,191,222,74,62,227,207,16,62,200,62,231,61,105,37,53,61,112,101,235,189,60,214,135,190,159,218,131,62,213,121,28,62,78,118,64,190,74,141,68,61,82,28,191,61,201,243,16,61,255,83,216,188,12,1,173,189,30,31,13,190,202,78,18,190,143,94,170,61,191,143,75,190,75,205,149,189,101,39,74,62,36,210,20,190,119,255,134,62,176,116,150,59,210,4,143,190,204,239,245,190,177,45,56,190,22,121,11,191,0,217,69,190,134,204,125,62,219,159,178,62,216,186,13,191,91,235,41,59,55,129,62,190,128,242,177,190,184,11,81,190,19,91,71,61,239,237,113,59,220,148,13,191,67,142,152,62,196,30,159,62,194,36,190,61,143,133,71,190,190,13,188,61,85,33,175,190,199,105,130,190,46,216,213,189,204,240,189,61,141,71,43,191,123,42,106,190,12,224,66,191,6,238,143,190,215,84,39,62,16,126,240,189,85,185,134,189,216,35,126,190,154,7,244,189,32,41,252,62,82,158,173,189,112,95,37,191,72,25,72,190,225,116,122,62,65,229,134,62,203,134,200,62,30,48,19,191,169,29,75,190,238,169,9,62,232,231,200,60,39,211,135,190,33,189,37,191,66,178,16,190,249,105,94,189,98,201,220,60,7,121,247,190,160,175,183,190,181,81,132,190,19,188,52,189,246,51,163,190,65,119,108,62,65,242,176,61,109,218,173,62,30,95,30,189,93,86,209,190,247,206,116,189,195,21,223,59,164,142,188,61,121,251,155,188,133,20,141,190,203,226,133,190,31,209,130,189,120,184,1,191,123,135,103,62,145,247,246,190,72,8,157,62,55,168,231,189,188,48,128,190,63,71,21,62,61,110,224,61,106,246,183,190,49,32,200,190,14,248,41,189,158,202,247,60,154,187,36,190,125,21,91,62,84,203,182,62,128,107,187,61,255,240,189,190,66,196,141,60,21,59,212,190,155,181,184,190,200,108,178,62,174,49,116,191,199,239,208,190,51,120,162,62,177,187,181,188,190,10,89,62,188,139,96,60,152,44,217,188,164,55,193,188,8,178,51,189,41,47,185,189,55,216,174,187,179,167,50,190,44,200,127,190,62,121,7,62,166,215,34,62,70,236,50,191,50,44,13,63,125,225,20,191,225,78,56,190,153,93,100,189,100,122,102,62,7,71,234,60,17,212,138,190,134,130,128,61,152,35,186,191,251,121,63,62,241,239,194,61,19,146,160,190,10,212,129,62,191,129,100,190,202,78,36,191,109,115,168,190,28,163,68,62,151,96,154,190,120,11,254,187,194,76,75,189,188,64,236,61,238,147,123,190,39,16,12,62,15,50,106,189,192,98,38,62,82,51,169,190,167,231,15,62,233,203,1,62,188,214,249,62,180,134,212,61,154,59,150,61,6,237,48,190,203,11,55,188,188,210,189,62,167,146,127,191,197,236,225,190,163,217,29,191,71,241,136,190,159,209,177,188,216,42,184,61,122,233,79,190,243,86,149,190,80,10,150,60,26,77,180,186,50,125,110,62,94,53,181,190,53,200,56,188,178,204,18,190,186,23,98,62,9,69,63,190,98,131,143,188,170,205,160,190,65,2,46,61,54,68,21,190,187,241,119,191,21,82,154,190,153,121,146,62,179,245,137,61,154,38,101,190,196,52,95,61,78,244,139,190,52,179,211,61,230,147,12,190,132,3,146,61,150,197,237,190,34,105,122,190,144,186,215,189,205,236,1,191,208,203,9,188,100,154,231,62,123,31,90,190,51,75,218,61,92,245,135,190,251,236,226,62,9,164,23,62,116,133,87,191,109,143,145,189,204,20,140,59,132,229,37,191,7,121,108,190,152,244,152,190,93,234,145,62,27,121,178,62,113,66,236,61,152,75,188,189,6,65,231,190,230,34,23,190,44,5,120,191,8,24,236,189,55,183,129,189,80,240,248,61,111,192,146,62,99,11,171,62,75,25,165,62,168,120,252,189,184,51,79,190,41,196,31,190,135,2,64,61,66,78,127,61,53,97,54,62,233,110,227,190,19,48,239,190,61,202,54,62,231,17,47,190,148,88,16,190,60,159,120,190,3,5,43,62,126,240,115,61,170,255,38,62,185,63,149,191,162,50,9,190,94,217,135,190,146,91,109,189,43,96,183,61,71,118,185,61,35,46,211,188,248,236,52,62,142,253,34,62,112,16,208,61,148,184,186,61,124,23,11,191,87,116,130,189,71,80,73,189,141,5,102,189,161,166,15,62,85,143,34,190,207,165,198,62,44,158,193,190,36,152,155,190,56,156,177,190,111,105,236,189,35,66,188,62,153,128,196,190,207,230,55,189,74,2,199,61,247,46,31,190,254,249,96,61,101,208,152,190,252,214,192,61,181,83,158,188,163,12,230,190,224,189,25,189,204,229,52,189,125,80,140,61,144,186,152,190,196,5,178,189,214,135,59,191,66,17,170,190,246,37,201,62,95,199,215,189,63,124,247,61,89,158,156,189,231,100,87,61,215,235,99,190,73,83,148,189,121,215,46,62,198,101,158,62,248,140,18,191,160,84,37,62,104,191,128,190,189,187,103,62,126,127,191,190,196,249,49,62,153,46,68,191,28,245,229,189,69,136,178,189,109,225,197,189,162,255,18,190,127,175,204,62,73,8,207,188,99,17,165,61,237,22,1,61,117,250,30,190,43,240,29,62,141,214,188,190,219,184,177,61,222,168,250,189,102,180,240,188,100,208,237,188,215,29,73,191,223,0,134,62,92,136,107,189,62,238,191,62,27,11,240,188,61,63,61,191,54,237,157,62,40,231,60,190,184,128,5,62,224,151,137,187,149,85,49,62,121,188,142,58,228,55,64,190,98,193,138,189,4,238,99,191,45,151,200,190,98,83,179,61,104,154,242,60,108,216,113,62,111,195,250,61,254,229,76,62,156,239,37,190,168,17,116,62,55,113,206,190,8,171,129,61,166,224,131,190,154,52,147,61,255,129,151,189,178,76,67,190,65,99,85,189,243,105,106,188,102,36,102,190,166,107,150,60,197,72,5,62,219,231,8,62,214,236,15,190,104,28,188,61,174,91,15,190,90,101,203,59,119,1,28,190,160,220,213,188,175,208,248,188,197,16,19,62,48,81,147,189,86,157,40,62,253,14,193,62,89,111,35,191,248,91,146,190,40,249,168,189,59,201,186,190,228,251,197,62,77,217,112,188,127,99,1,190,100,212,134,190,67,105,40,190,150,107,103,189,200,194,113,190,115,222,229,190,24,187,99,190,135,91,209,190,50,96,220,190,116,29,132,190,115,74,191,62,138,172,142,62,235,201,44,190,136,248,157,189,250,5,157,60,70,80,210,60,102,95,191,189,223,71,30,62,213,0,17,189,104,240,102,61,52,253,7,62,169,74,183,188,57,213,96,189,247,211,130,60,218,62,0,190,43,114,102,191,141,158,93,190,236,220,40,190,192,133,247,190,224,71,71,189,67,196,203,61,112,55,13,190,225,148,253,189,158,115,28,191,41,63,130,62,243,54,40,189,159,189,170,190,42,46,150,190,95,84,7,190,100,244,1,62,97,137,183,189,243,56,209,188,116,125,153,61,232,242,165,189,100,197,160,190,55,110,195,189,136,146,159,61,81,252,79,62,203,228,60,191,43,218,12,62,248,8,161,61,74,89,203,61,115,149,94,62,103,11,244,61,220,86,155,61,229,10,172,190,50,68,27,62,55,70,221,190,111,81,8,191,125,152,5,191,105,124,129,189,107,40,132,191,137,221,254,61,9,55,140,189,141,0,137,189,163,168,127,61,150,103,164,190,90,61,224,61,144,233,141,189,84,156,138,61,182,129,41,61,109,228,109,60,67,125,131,61,159,180,113,190,209,7,214,190,208,62,140,190,234,114,184,189,209,139,174,189,200,152,230,61,230,38,17,61,26,218,2,62,235,153,212,189,16,200,96,190,64,0,3,62,196,214,10,189,199,119,42,190,118,191,196,61,255,247,133,62,222,243,106,61,117,143,155,62,133,17,28,61,80,221,39,190,152,51,143,190,219,96,29,189,48,205,112,190,246,172,198,62,51,242,198,61,152,229,184,61,36,10,222,189,64,112,141,189,162,86,32,190,97,229,179,190,87,245,42,61,43,3,205,62,16,82,137,60,244,156,2,191,48,72,3,189,33,173,55,61,172,231,14,61,226,123,21,190,119,108,193,62,92,139,218,59,135,233,22,191,220,105,13,191,219,210,248,190,159,105,156,191,245,16,130,62,194,137,45,62,143,110,189,61,124,191,19,62,132,157,172,189,142,254,157,190,222,157,38,62,90,197,13,62,161,209,189,189,1,5,14,190,120,211,6,61,125,87,8,191,252,92,106,190,122,55,51,191,191,217,134,61,53,67,133,190,30,193,55,190,211,57,77,62,7,0,163,190,48,148,81,62,171,251,21,62,76,19,178,190,79,184,22,190,78,115,218,189,233,20,43,190,162,23,150,61,24,179,103,190,23,101,195,190,185,10,44,189,95,109,2,61,162,207,139,61,16,248,134,190,155,5,57,61,62,96,101,190,105,78,11,189,232,42,160,62,44,81,130,190,230,52,205,61,181,190,166,190,155,239,214,61,145,71,182,190,76,236,84,62,26,60,175,62,129,179,61,62,105,112,70,62,108,151,91,62,220,78,21,190,162,186,54,61,236,182,220,61,85,83,17,191,147,29,110,189,134,119,10,62,16,125,217,189,115,103,47,62,252,166,52,62,155,233,58,190,27,133,39,62,75,183,90,190,107,192,12,191,244,107,98,62,50,65,221,190,215,55,180,61,27,186,56,60,109,236,150,191,230,60,201,190,55,227,119,190,232,0,75,189,206,191,160,190,10,174,169,62,212,148,167,189,218,71,99,62,91,102,74,189,177,137,214,190,205,253,150,188,44,143,145,59,190,51,64,62,113,5,8,190,115,195,201,62,140,233,69,190,157,150,16,190,241,192,28,189,167,52,156,60,198,122,31,62,209,244,211,62,171,236,203,62,37,164,154,190,36,239,198,189,12,152,49,189,82,64,170,62,178,234,71,62,1,17,20,190,41,205,103,189,15,240,119,190,85,123,132,62,253,221,44,190,170,90,72,191,48,80,46,190,193,60,166,190,20,226,132,190,56,140,200,61,44,101,141,189,193,159,47,190,142,150,154,62,190,70,103,190,186,102,104,190,245,115,140,190,206,89,118,61,3,84,151,62,176,226,139,62,143,241,101,61,49,211,9,62,194,100,236,190,241,203,37,189,44,82,41,62,245,231,178,62,223,246,76,62,76,5,14,62,58,193,101,62,239,87,221,62,136,113,158,189,150,26,13,191,109,61,66,191,153,159,241,62,69,164,210,59,166,161,240,61,19,87,44,190,150,155,42,62,207,117,201,60,205,249,4,191,184,209,116,190,121,224,188,190,157,233,132,190,231,21,103,62,231,123,71,190,5,106,166,61,106,97,105,188,139,216,77,62,11,21,85,61,251,137,62,62,47,87,10,190,34,110,92,62,7,249,80,62,56,205,238,189,59,127,155,190,133,210,150,62,124,235,117,190,235,190,185,190,47,70,255,190,228,67,81,62,113,23,129,62,198,160,139,61,174,184,94,190,206,195,65,190,67,88,45,191,176,30,149,62,39,180,148,189,220,143,148,190,228,76,40,60,240,142,9,61,7,20,231,190,134,41,149,190,141,204,197,190,102,122,14,190,57,71,5,62,58,16,225,62,162,77,115,191,153,180,87,62,58,15,58,59,244,234,177,61,93,90,65,61,108,189,239,61,245,34,71,62,101,122,185,190,173,228,191,61,197,10,55,62,250,47,0,190,80,136,91,189,77,179,246,61,131,55,79,62,47,69,185,190,116,34,222,190,227,150,221,188,126,154,148,62,221,243,72,62,91,99,60,190,136,97,134,58,131,27,183,61,71,124,11,62,109,139,157,62,186,209,203,61,241,173,131,190,244,181,187,61,240,161,39,190,5,34,97,191,91,110,159,62,68,36,51,62,161,37,239,62,184,68,74,190,210,221,20,191,231,78,7,63,247,106,54,61,109,114,62,191,82,169,224,190,168,56,222,189,183,94,176,190,68,91,107,188,9,158,234,189,222,137,109,58,142,121,121,189,151,58,3,190,48,21,133,62,191,209,42,61,120,242,47,190,47,253,72,61,161,0,197,62,196,155,14,189,42,228,158,62,1,222,44,61,89,230,116,190,30,108,185,61,224,156,246,188,153,96,248,59,226,252,178,62,101,126,183,62,110,136,136,61,182,174,209,188,196,139,163,61,147,150,125,190,73,113,202,188,3,123,82,191,81,14,242,60,171,162,170,189,190,246,188,62,95,249,247,190,66,245,156,188,77,57,218,62,87,157,150,190,82,190,141,186,30,210,