{"meta":{"epsilon":0.04963967576622963},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[89,147,218,62,213,123,198,61,246,51,17,62,201,152,130,190,213,187,200,190,107,45,148,62,7,239,210,60,74,71,61,62,8,30,221,62,124,113,247,62,20,155,129,62,111,137,29,62,248,199,127,62,223,233,36,190,28,17,100,62,60,179,159,62,208,16,5,189,87,158,57,60,210,100,51,60,189,36,169,61,45,44,29,61,6,241,13,190,36,37,31,63,174,212,8,63,48,41,5,191,161,192,241,60,123,73,136,62,199,23,71,189,126,189,162,190,207,179,251,62,203,83,140,61,1,219,233,62,53,143,208,62,186,215,91,190,197,89,166,190,101,19,45,63,46,185,147,62,31,222,242,62,54,199,132,62,54,127,60,60,106,30,14,63,203,9,6,63,43,44,27,61,36,62,87,189,162,165,172,61,188,166,63,62,235,46,27,190,6,255,150,61,176,237,131,190,81,141,142,62,43,160,178,59,129,128,45,189,220,249,232,189,119,100,128,62,248,35,203,61,203,119,2,188,171,79,130,61,215,117,81,62,232,168,99,61,197,25,173,61,198,95,14,191,180,134,190,62,220,171,173,61,189,92,176,190,32,130,24,191,145,60,8,191,38,184,184,62,11,134,54,62,66,44,101,190,112,30,253,189,133,241,162,62,137,173,152,190,142,233,37,62,173,143,66,187,35,161,93,62,8,58,1,62,91,140,170,62,3,180,211,61,66,110,210,61,59,248,76,190,106,240,73,190,86,102,218,61,158,237,240,190,227,179,233,190,230,148,137,62,203,66,190,190,68,144,187,61,46,211,160,62,77,213,182,189,222,138,137,190,148,148,149,190,102,52,158,62,80,133,205,190,109,55,38,191,224,121,145,62,142,27,163,62,110,112,20,63,237,152,178,189,119,1,34,191,211,88,75,190,92,51,171,62,42,133,152,62,114,6,27,62,118,235,49,62,49,247,70,190,120,226,208,62,9,39,10,63,22,228,100,189,198,127,245,188,247,158,0,62,29,106,3,63,143,24,48,190,154,91,147,190,61,5,198,189,69,199,0,190,172,168,32,191,254,145,137,61,42,161,122,62,63,122,30,190,143,3,162,190,61,149,181,59,145,177,255,62,213,37,15,63,204,84,30,190,29,30,134,60,234,65,82,62,200,66,5,190,55,253,9,191,123,188,58,191,41,117,202,62,189,77,82,187,0,167,57,62,42,178,128,62,128,29,212,190,224,247,6,62,119,215,118,59,166,153,51,63,118,7,10,62,253,186,185,62,62,195,188,190,31,5,87,62,111,247,72,60,12,185,188,186,254,10,118,189,24,116,17,189,102,66,133,62,110,239,50,190,170,223,76,62,199,161,160,61,244,138,164,189,14,139,170,190,28,23,46,63,218,11,174,61,48,13,85,62,8,246,147,185,200,134,155,61,94,5,69,63,77,20,209,61,233,239,159,190,100,230,101,61,11,93,51,190,91,69,51,189,214,165,12,191,101,25,4,190,145,92,197,62,41,137,1,63,153,220,6,60,168,39,120,62,153,1,69,61,163,144,107,61,64,49,34,190,221,255,167,62,108,29,215,61,145,194,27,60,33,63,152,190,206,220,193,62,7,168,129,190,122,129,215,190,179,36,187,62,26,35,180,62,117,148,38,191,149,213,132,188,204,32,125,62,66,45,67,62,46,158,124,189,136,85,45,190,95,115,46,62,167,2,252,188,86,93,58,62,190,19,57,63,62,187,202,190,221,57,213,190,35,244,29,63,89,219,73,62,174,191,227,188,6,230,251,61,22,209,5,63,200,255,44,190,65,165,10,190,224,165,170,189,143,96,128,62,138,9,175,189,8,150,43,190,88,166,251,189,32,29,43,61,158,52,56,189,249,10,99,189,84,69,76,62,248,217,58,190,189,44,144,60,76,91,71,191,165,17,188,188,85,21,85,59,119,250,55,190,118,201,146,61,60,68,21,62,61,86,132,189,63,249,83,62,229,41,61,62,190,112,7,62,191,167,99,190,153,105,158,190,150,138,50,62,6,141,67,62,82,113,69,62,82,224,187,62,183,73,2,189,159,137,129,187,207,214,180,62,62,178,76,191,189,164,99,190,210,51,12,63,9,70,167,189,153,128,154,62,46,122,22,62,53,79,234,61,70,21,39,63,42,23,35,188,117,159,44,62,1,113,186,62,188,111,93,63,209,144,118,61,223,227,134,62,79,200,122,189,110,194,210,190,35,181,70,62,123,101,156,190,113,99,23,61,243,10,225,61,120,192,40,63,225,0,102,62,204,213,122,190,63,175,153,62,249,66,93,189,157,244,151,62,253,119,108,62,78,158,168,61,237,236,38,189,60,48,99,191,114,242,226,62,208,103,191,189,212,239,184,189,152,157,153,189,169,219,108,61,33,2,229,61,4,69,7,190,70,185,251,62,121,101,238,61,86,8,35,62,255,60,248,59,112,128,242,188,44,140,39,62,212,102,179,62,15,63,94,62,169,129,181,189,74,37,1,191,245,105,49,60,88,230,165,62,180,182,55,62,191,170,228,190,230,149,223,189,201,147,196,189,27,47,165,61,169,140,232,190,22,176,60,190,187,94,149,61,40,159,197,189,177,92,247,189,96,157,113,55,101,35,161,189,76,209,135,190,239,237,133,189,47,43,3,63,97,168,78,62,80,242,23,190,138,255,36,62,171,189,92,190,109,26,1,190,99,114,194,62,14,200,17,191,105,253,155,62,54,95,242,61,93,246,184,190,237,140,37,62,28,178,5,189,111,97,39,62,21,243,37,62,3,212,219,187,184,144,55,62,57,134,215,61,80,169,61,190,145,141,15,63,194,247,31,190,184,248,102,62,51,39,124,60,45,22,250,62,184,74,46,190,102,125,144,190,137,19,220,189,219,182,190,60,75,43,145,62,120,53,58,62,253,186,203,62,30,58,87,190,36,69,137,61,175,226,37,190,57,244,138,187,165,172,238,62,81,135,21,62,13,226,38,61,105,79,58,62,253,126,123,61,21,32,139,190,252,47,156,62,219,214,21,62,7,189,123,62,188,189,25,191,107,17,254,61,231,27,198,61,235,240,217,190,114,97,128,62,194,118,144,190,88,55,254,62,88,122,170,62,93,168,185,190,28,242,4,62,67,11,4,190,225,55,212,190,122,32,84,191,239,152,164,189,205,66,142,61,77,228,148,62,62,133,30,62,82,86,123,61,227,126,80,187,117,68,203,190,113,139,183,62,28,152,145,62,32,21,241,189,21,108,206,62,181,9,233,62,47,105,186,190,239,139,94,62,170,89,203,189,4,104,4,62,252,141,131,189,182,252,49,62,56,232,173,190,0,158,221,62,36,3,79,62,80,155,206,189,60,59,0,63,96,117,193,62,101,226,200,62,211,177,169,190,80,60,2,62,44,143,184,189,226,22,231,190,175,28,126,59,157,59,139,190,7,111,131,190,92,228,190,62,201,196,141,187,55,241,133,62,108,109,166,61,166,9,166,190,4,35,44,62,41,72,255,61,31,198,63,62,17,96,175,62,222,135,230,188,237,132,185,61,29,180,102,61,101,199,125,62,174,18,89,190,38,172,135,61,22,56,169,188,38,51,24,63,251,210,71,191,224,182,106,62,44,101,137,62,25,210,255,189,230,8,31,190,158,245,128,62,245,139,100,190,218,217,254,56,18,68,38,190,74,123,93,190,137,96,2,190,225,43,193,61,168,70,78,189,228,211,158,60,224,174,116,62,198,135,142,190,189,246,11,190,247,168,79,62,97,120,139,189,30,161,16,190,123,240,148,62,205,239,157,191,56,118,34,62,149,73,66,191,129,191,220,190,165,189,66,60,84,168,162,62,75,7,108,62,228,230,80,190,95,191,115,62,185,253,187,62,254,228,55,190,228,33,21,61,231,204,167,61,44,96,201,62,83,121,15,189,154,37,21,62,25,103,15,61,232,17,41,62,129,208,243,61,246,234,87,190,191,198,39,63,152,104,101,62,18,149,152,62,146,231,233,190,89,78,213,62,3,75,169,190,19,105,58,62,182,191,52,190,161,235,190,188,245,80,141,188,49,193,199,190,6,184,133,62,185,45,71,190,151,180,101,190,188,9,49,62,32,135,97,190,98,159,235,62,194,122,209,62,224,128,150,189,168,65,232,188,84,115,120,60,97,148,104,190,76,40,174,189,186,116,185,61,21,243,49,191,144,180,189,61,152,241,34,63,36,187,91,188,231,237,130,190,227,20,117,61,94,89,138,62,140,186,77,190,206,168,88,191,111,232,77,62,18,140,241,62,239,13,187,62,71,60,99,190,171,82,129,191,163,211,225,60,15,74,205,188,102,67,55,62,216,87,166,190,181,24,139,62,149,53,3,191,152,55,153,190,216,113,91,190,223,186,232,62,171,8,198,190,27,68,136,62,91,170,40,191,93,229,222,62,49,239,123,190,228,254,109,62,209,163,187,190,39,10,90,62,225,43,133,189,150,124,206,61,22,177,219,62,247,84,127,189,186,46,155,190,159,14,143,190,227,104,48,61,86,21,218,190,215,22,179,62,154,244,235,62,101,20,71,190,82,33,31,190,175,190,233,62,167,66,176,190,236,58,197,62,207,95,54,61,47,188,167,190,187,224,144,62,250,163,173,61,199,0,204,189,246,247,56,61,248,78,98,62,129,101,196,187,10,112,219,62,19,143,10,190,247,111,47,189,47,60,210,189,238,95,3,62,254,201,143,61,74,66,210,190,143,37,203,189,89,166,180,61,61,19,23,191,111,131,110,61,152,77,47,189,5,92,65,190,56,18,202,189,88,20,36,63,216,11,150,62,25,201,165,59,65,100,21,189,130,10,211,62,1,109,143,61,220,27,16,191,160,60,23,61,2,246,129,60,69,172,38,191,209,226,216,189,53,137,169,189,81,160,181,190,82,49,88,190,15,164,15,62,236,240,141,61,96,229,146,60,56,103,60,190,255,101,176,61,12,159,249,190,196,73,159,62,241,62,73,60,154,141,147,62,203,230,246,61,121,49,232,61,126,190,51,191,102,191,28,190,241,126,224,190,235,18,173,62,164,146,120,190,182,27,213,61,143,237,30,190,213,225,72,62,46,159,57,190,44,138,42,191,58,155,145,190,28,88,220,189,155,114,29,62,184,215,32,191,78,57,107,190,98,95,56,191,25,61,152,61,15,35,161,62,5,197,117,190,10,32,169,62,135,133,233,62,187,204,239,62,232,108,14,63,130,134,96,62,164,16,87,190,180,50,8,61,177,205,9,63,204,68,141,189,226,149,160,189,68,37,13,61,40,6,246,62,74,228,217,62,144,73,202,187,50,81,164,62,113,240,62,62,155,106,94,190,98,1,222,62,107,30,95,61,86,89,225,62,144,54,141,189,209,229,153,62,93,240,135,190,247,10,211,189,186,133,22,62,179,202,177,189,98,205,85,62,149,182,190,190,22,75,119,189,147,228,56,62,168,47,114,189,84,192,223,189,197,238,233,61,172,15,83,190,97,248,226,189,237,137,105,62,106,211,72,62,223,199,211,62,39,133,227,61,253,163,168,62,201,252,22,62,12,117,153,189,104,56,191,190,145,180,64,191,128,39,105,188,208,51,138,190,97,54,222,62,182,155,196,60,189,122,12,63,142,160,142,190,148,98,57,62,79,66,207,189,25,56,143,62,154,232,208,62,231,201,104,191,195,71,34,62,242,44,129,61,109,163,42,63,216,254,172,190,168,239,84,190,111,170,190,62,134,214,139,62,187,142,23,190,250,68,164,61,193,189,226,62,206,134,212,61,127,174,62,191,142,49,151,62,131,182,178,61,6,50,32,191,136,14,205,62,138,202,163,62,126,95,206,61,63,204,1,61,98,22,97,62,206,78,93,189,62,77,195,186,96,47,5,63,185,252,26,62,177,252,89,62,236,97,242,62,53,117,184,62,175,217,190,185,224,105,195,61,74,24,105,190,64,3,3,63,248,186,143,190,197,122,19,191,220,167,16,190,197,198,145,190,215,112,243,61,71,42,174,61,178,216,221,190,187,76,27,189,143,193,252,190,110,52,105,187,64,35,14,190,224,186,192,189,119,93,14,190,66,167,228,62,96,244,149,190,231,31,166,190,121,52,12,189,91,76,197,62,12,203,31,62,91,141,118,190,175,32,193,190,169,141,21,191,220,68,5,190,128,72,84,190,189,60,8,191,242,26,69,62,57,122,215,62,229,251,239,62,251,1,249,61,35,113,163,190,38,0,190,190,210,28,130,190,16,155,186,61,174,234,254,189,28,124,97,190,165,71,173,190,253,58,35,62,132,170,140,61,166,17,139,61,239,121,167,60,146,47,163,59,119,175,36,62,119,87,180,190,47,255,44,61,149,217,219,61,27,102,42,62,33,219,137,190,188,106,22,62,233,20,177,62,114,121,148,62,138,145,212,190,222,178,121,189,116,46,137,190,58,158,81,190,157,145,157,61,224,239,6,63,246,246,160,60,129,37,3,60,36,65,51,62,102,50,209,58,173,108,144,190,155,182,16,62,5,132,82,188,45,141,83,62,50,251,48,187,32,245,6,63,145,34,151,189,90,117,23,191,186,62,137,61,36,242,129,190,67,105,55,62,17,6,48,62,134,194,185,62,179,89,142,62,119,131,139,62,23,127,221,190,230,234,178,62,132,45,215,62,104,211,195,190,14,142,231,189,185,83,226,62,197,130,32,62,204,126,141,58,82,136,242,189,153,6,173,190,147,72,204,189,210,165,114,60,40,239,180,59,211,211,25,62,233,184,219,62,15,185,171,60,159,200,195,62,173,53,230,62,147,189,161,61,64,6,234,61,213,215,177,190,46,122,160,62,102,244,210,62,117,15,112,62,72,71,55,62,206,209,23,62,38,63,143,60,63,245,212,190,214,129,173,189,193,103,241,61,110,212,196,61,236,126,200,62,98,99,36,62,110,148,219,189,233,246,15,62,132,162,204,62,101,193,96,61,141,95,144,61,152,187,81,189,123,185,23,189,165,16,175,189,148,15,181,190,228,216,159,61,182,30,143,60,77,118,167,190,3,254,8,190,160,160,89,190,51,70,207,190,185,68,209,189,62,151,126,190,171,102,237,189,149,217,40,189,126,224,237,61,92,204,155,62,190,173,16,62,198,160,253,61,136,193,240,190,55,58,141,62,238,90,32,190,216,87,214,189,9,94,206,190,140,185,17,62,141,204,195,60,43,42,85,190,169,183,145,62,254,146,64,62,37,171,8,62,124,49,208,60,175,68,207,189,18,125,56,61,17,50,108,61,18,11,72,190,205,35,36,188,33,223,119,62,23,33,64,62,96,105,211,61,179,172,89,62,23,86,106,62,33,138,19,189,217,52,59,62,33,203,4,191,234,5,75,62,147,32,22,191,3,255,55,62,52,93,99,61,128,255,82,62,83,52,234,187,76,193,208,188,13,25,119,61,254,142,198,60,44,6,106,62,97,251,151,187,172,92,146,189,185,79,220,62,166,250,7,190,118,166,215,189,190,70,135,62,191,73,204,61,71,238,38,190,155,36,100,187,168,54,35,62,114,253,245,189,130,128,26,62,140,182,132,62,92,64,186,61,107,177,17,61,100,120,247,61,254,60,117,190,167,106,169,190,145,35,236,189,101,216,22,61,10,133,105,62,238,177,33,189,132,159,156,189,5,68,146,61,231,114,176,190,228,55,55,62,145,64,27,188,177,141,91,62,228,98,188,190,234,207,61,63,195,254,86,190,116,5,236,61,200,181,155,61,43,157,62,62,225,47,237,61,253,143,84,62,103,226,31,62,224,9,62,62,235,45,101,190,119,38,170,59,38,223,195,190,129,23,47,189,43,161,206,58,56,206,238,189,186,158,7,190,138,205,141,61,253,128,150,62,56,253,20,190,153,57,183,189,19,27,85,62,28,255,133,190,63,69,38,62,135,205,5,190,94,94,56,190,136,167,13,190,161,126,10,61,50,245,136,62,186,103,74,190,76,171,61,61,62,127,134,61,247,164,70,62,8,24,214,189,147,42,63,61,244,221,157,190,93,166,67,189,201,124,132,61,239,47,205,189,182,170,255,189,196,192,11,190,130,29,220,189,176,245,129,60,90,64,138,190,132,46,68,189,45,155,50,62,168,211,16,62,223,223,202,189,191,209,6,62,107,171,77,62,25,158,154,190,201,29,24,189,130,62,241,189,213,242,232,61,202,59,109,186,169,39,130,62,246,5,42,62,154,38,166,190,198,126,135,61,105,25,91,62,150,45,125,190,250,167,180,61,229,160,6,62,122,247,188,60,21,123,248,61,172,187,181,61,104,100,142,62,108,114,214,190,101,81,109,61,95,27,79,60,49,105,84,61,132,77,182,61,138,98,13,62,159,20,68,62,14,56,52,189,159,47,132,190,37,145,104,61,71,18,111,190,10,223,231,61,179,119,16,189,93,184,70,190,12,2,36,188,29,39,241,59,216,166,180,189,80,101,37,61,72,91,130,189,9,72,67,61,38,176,179,62,169,58,2,62,155,151,19,62,25,196,19,189,71,41,75,59,83,102,241,61,190,145,62,190,87,90,145,190,47,120,82,190,130,37,2,62,159,145,56,62,176,138,132,190,177,71,37,62,151,86,44,189,112,157,32,61,202,242,77,62,93,33,237,189,118,146,56,60,37,24,145,62,121,170,3,62,179,66,76,61,150,123,186,61,16,2,102,190,56,218,237,190,194,31,157,61,170,55,87,61,13,6,169,187,73,83,38,62,76,231,13,190,133,188,0,62,239,133,178,61,111,101,105,62,81,165,34,190,92,28,16,61,202,47,1,190,188,154,126,62,67,15,69,190,52,141,71,190,36,72,219,62,243,134,56,62,233,19,1,61,104,140,155,62,135,85,2,62,123,89,248,190,236,191,68,187,5,124,201,188,249,177,232,189,218,203,244,61,168,217,213,188,149,183,89,190,2,33,186,188,130,115,16,62,136,138,83,190,230,3,130,62,31,176,143,190,53,195,207,62,52,177,161,190,38,5,37,190,76,246,105,62,37,198,170,190,185,114,174,62,243,231,171,60,71,75,213,61,162,31,46,191,148,158,29,62,213,217,94,62,29,160,48,62,114,5,115,188,1,0,110,189,183,92,189,190,73,57,147,190,41,30,129,62,94,6,121,190,246,114,109,62,185,38,22,188,147,53,216,60,161,249,186,189,146,170,30,62,250,13,101,190,251,213,203,61,65,154,100,189,134,155,34,190,12,109,42,191,203,167,68,185,101,27,81,189,51,94,99,190,20,16,242,61,88,100,14,62,14,21,137,61,45,239,49,61,206,209,37,61,79,114,172,61,132,172,136,61,252,39,165,61,234,252,199,188,99,138,200,62,42,172,204,62,146,229,29,188,59,94,8,191,225,84,72,189,85,125,159,189,146,232,97,190,244,205,96,190,47,53,143,190,74,72,84,61,216,57,26,62,182,66,61,62,168,208,133,190,92,3,163,189,123,135,223,61,224,67,140,189,137,69,97,190,210,150,186,187,160,79,46,61,56,107,24,62,212,15,231,61,253,33,240,190,16,129,249,61,37,192,156,61,183,95,61,61,168,80,230,61,181,104,69,190,11,80,151,190,166,242,144,190,3,124,118,62,182,254,188,62,39,56,132,189,151,206,65,62,96,121,51,190,159,41,18,190,105,166,171,61,106,178,111,186,186,56,140,190,173,144,9,190,234,178,36,189,198,170,198,60,9,31,209,62,116,183,76,62,159,250,175,61,180,9,39,190,43,69,198,60,63,101,166,61,160,193,25,62,189,100,68,190,196,145,130,188,36,21,254,61,170,24,87,188,76,78,138,62,125,47,149,189,251,113,154,189,218,180,122,62,131,40,57,61,89,63,79,61,126,210,52,187,3,132,161,189,208,230,168,186,149,251,69,189,162,42,134,190,211,232,92,61,99,113,156,62,221,228,0,190,161,18,118,62,99,239,151,189,191,164,132,187,226,82,32,60,235,41,27,189,49,93,220,61,100,149,134,188,184,94,247,61,141,13,10,190,134,145,83,62,117,209,252,189,40,14,116,189,176,238,122,190,210,19,84,60,210,208,16,189,149,209,75,190,100,215,47,190,30,119,166,61,112,89,126,61,243,39,239,61,196,238,235,61,88,114,3,190,234,176,7,62,9,0,244,190,177,90,115,62,139,154,38,62,139,180,54,62,134,102,171,61,122,255,179,189,37,215,160,190,82,101,207,187,169,221,146,190,215,1,126,189,201,44,205,61,231,109,3,190,15,99,202,187,163,51,39,62,247,226,156,190,67,21,94,62,177,98,78,190,158,18,127,62,125,12,242,60,202,134,72,60,234,70,160,60,135,241,53,60,61,8,171,190,200,113,138,189,38,119,11,62,76,7,157,61,178,91,210,189,105,47,243,60,255,228,171,189,239,38,7,190,13,29,210,61,176,124,151,188,87,106,173,60,67,48,155,189,191,81,103,61,158,80,66,59,241,119,1,190,122,31,31,62,181,103,2,190,137,225,209,189,126,156,184,190,197,253,13,190,122,52,223,189,56,223,18,62,252,38,111,191,70,228,145,190,241,164,156,62,127,49,40,62,107,30,145,189,188,126,24,61,210,134,181,60,27,172,193,189,139,214,238,189,104,227,140,61,229,193,78,190,101,190,10,61,37,144,207,61,38,2,204,61,56,45,152,190,132,227,242,189,116,195,182,61,254,157,159,190,200,110,109,190,231,33,234,190,81,112,47,62,64,5,110,190,69,27,129,61,162,240,28,62,72,47,71,185,63,45,128,62,163,18,247,60,76,172,38,190,65,67,245,62,38,66,20,62,148,232,171,62,86,227,40,62,4,63,9,190,119,12,161,188,185,204,117,61,79,78,155,62,28,210,157,62,113,190,252,59,239,119,245,61,113,33,122,61,123,124,84,62,38,129,193,189,9,239,69,62,93,191,253,189,237,124,250,60,170,162,253,188,179,58,144,62,50,191,187,189,61,219,63,62,116,30,29,62,242,254,149,62,68,251,35,62,142,101,146,59,198,138,197,189,8,180,123,189,31,138,112,190,179,247,166,188,237,195,170,189,239,223,39,62,243,59,65,188,130,162,80,61,216,48,166,190,177,199,29,188,237,204,147,189,98,77,57,62,161,72,125,62,98,218,168,56,79,233,121,61,91,222,97,190,243,10,247,190,124,68,145,190,157,241,53,190,118,3,133,190,134,55,35,190,212,163,203,189,138,30,128,189,177,147,193,190,54,142,45,61,191,205,229,189,66,122,230,189,78,192,154,62,237,239,246,61,33,192,99,62,63,91,80,189,74,209,87,62,187,247,122,62,90,55,5,189,213,81,223,188,16,81,78,62,215,13,1,61,19,174,209,61,207,216,203,60,111,78,209,189,89,90,228,61,5,224,239,189,81,1,70,61,225,222,255,61,47,231,14,190,162,95,30,60,225,175,160,60,133,59,174,61,238,148,64,190,91,163,250,190,70,245,4,62,129,192,21,190,128,222,9,62,59,13,240,189,87,70,124,61,107,66,150,59,170,6,144,62,195,178,213,61,192,156,52,62,176,10,133,189,119,113,70,62,180,229,110,60,66,158,80,189,188,226,91,190,204,199,197,189,236,200,35,188,248,230,144,190,12,203,226,61,102,225,29,190,105,176,179,61,170,72,183,61,109,62,129,62,81,56,62,59,109,25,242,61,41,181,191,189,40,44,175,188,249,12,33,61,181,45,180,59,165,156,38,62,99,118,110,188,122,216,69,62,100,31,27,62,60,94,154,189,22,211,51,190,153,143,5,190,100,171,231,62,50,149,240,189,112,191,134,60,127,184,79,61,52,222,91,62,254,22,149,189,161,61,121,190,178,7,125,189,19,102,192,189,217,19,162,190,120,24,27,188,131,85,149,190,204,88,75,62,111,214,203,189,162,114,140,189,252,118,137,190,221,79,212,190,102,74,181,188,199,233,2,190,46,208,126,190,227,244,224,189,21,62,188,61,55,139,102,190,252,136,174,61,254,22,169,60,29,87,129,61,225,155,73,190,79,38,176,61,184,148,9,62,31,76,100,62,223,188,221,189,222,42,206,59,126,92,9,62,84,36,77,62,17,186,215,188,134,109,128,189,139,254,11,62,54,182,147,190,10,63,89,190,136,33,66,190,251,145,131,62,34,2,28,190,220,177,48,62,219,172,208,61,184,197,37,189,181,20,10,62,65,75,12,191,30,252,135,61,158,61,251,61,131,219,8,190,96,30,21,62,201,121,64,189,169,250,86,62,46,14,11,62,155,192,14,189,121,167,195,61,139,4,141,190,18,85,30,62,19,60,27,62,165,200,95,62,39,48,138,60,51,209,184,190,93,157,250,188,176,215,128,190,240,152,188,61,188,87,233,61,57,4,60,190,101,21,130,61,44,94,134,62,85,216,37,190,19,217,49,190,144,26,180,189,227,103,71,189,7,183,136,190,61,167,122,190,133,56,225,61,36,50,19,62,122,107,23,61,93,47,30,189,82,237,100,189,189,181,208,61,173,159,195,62,1,196,179,61,15,205,30,62,118,152,75,188,108,255,68,190,8,174,170,60,173,121,74,61,122,38,212,59,218,178,107,190,246,156,190,61,157,84,25,62,168,168,72,62,63,53,156,61,148,66,147,60,181,142,219,60,14,27,159,61,33,86,106,61,209,4,7,62,184,92,82,186,86,190,44,62,12,204,77,189,93,246,4,62,208,29,121,61,166,31,169,190,81,107,210,189,84,65,179,61,131,198,99,189,70,165,128,189,243,240,124,62,197,33,244,60,4,54,206,189,144,234,169,61,10,170,238,187,134,78,222,189,180,141,151,190,107,21,37,62,5,168,32,189,94,34,154,189,44,129,10,191,91,215,78,59,8,68,180,61,167,193,226,190,128,242,72,183,83,118,204,62,129,56,1,190,202,251,129,62,36,62,152,190,43,108,134,190,248,146,172,190,104,42,49,189,213,241,23,190,45,158,207,189,51,92,244,189,137,149,247,61,54,70,125,187,38,253,200,61,92,232,103,188,49,235,122,190,150,111,93,62,248,148,168,60,89,102,232,189,183,16,179,61,183,208,113,62,107,255,187,59,134,183,137,62,77,1,154,189,218,68,238,61,69,185,240,189,119,246,179,62,110,11,173,61,237,177,22,190,59,187,192,61,211,62,161,190,47,191,225,189,53,167,5,189,53,185,166,60,81,227,22,61,124,12,39,62,31,144,13,190,208,147,167,61,81,187,105,189,245,28,105,62,32,171,243,59,245,243,190,61,170,190,197,190,65,174,113,190,6,202,90,189,252,32,142,189,194,110,209,188,147,58,31,62,63,93,38,189,31,58,144,190,221,106,185,61,196,251,207,59,76,41,180,188,195,112,145,189,133,213,88,190,26,228,202,190,180,72,137,189,240,161,107,188,75,49,135,60,160,149,54,62,237,40,255,60,132,94,50,61,172,6,62,62,237,186,165,61,32,178,133,61,33,84,204,190,227,221,139,61,102,92,208,190,23,46,182,61,47,192,150,189,211,31,240,188,115,199,68,62,231,180,16,190,60,18,168,190,175,133,113,59,65,157,150,61,129,151,95,62,152,29,228,56,229,245,61,190,255,196,50,62,244,30,71,190,41,127,135,61,233,124,21,62,81,20,195,61,218,35,41,61,98,193,148,190,97,43,209,189,240,66,3,62,99,138,255,60,135,26,101,190,85,241,59,187,228,193,219,189,249,100,67,189,233,119,182,61,88,190,206,189,72,4,149,62,222,134,124,61,213,232,128,190,49,129,45,62,213,75,136,61,158,70,78,189,157,117,15,189,71,117,228,61,158,10,175,188,13,45,83,189,157,82,128,191,78,143,75,189,34,247,162,61,169,35,143,62,90,99,14,189,52,46,129,61,44,90,25,189,154,172,159,61,169,235,231,61,149,154,83,189,46,99,73,190,190,6,55,62,193,112,84,62,187,207,137,62,150,57,161,189,43,15,154,187,9,120,199,187,120,216,78,61,163,188,88,62,207,129,170,189,39,213,106,190,150,5,159,190,199,20,56,191,164,35,157,190,40,114,189,61,125,106,193,61,7,149,93,61,193,34,79,190,224,100,0,189,164,133,52,62,72,65,60,189,39,88,139,61,123,243,57,191,129,231,230,61,128,102,216,188,77,27,12,190,22,32,231,189,41,209,49,61,76,251,147,190,84,23,253,190,1,236,230,61,206,98,118,191,161,27,160,61,41,30,33,62,218,134,5,190,72,214,64,191,215,12,124,61,194,163,13,61,254,118,134,61,34,218,220,189,180,143,121,189,210,81,130,190,102,204,55,62,75,205,169,189,185,252,61,190,64,65,13,189,108,20,148,190,113,57,121,62,255,253,154,190,87,131,50,188,146,80,55,62,132,229,250,189,146,69,30,189,42,232,101,62,179,146,238,189,153,151,27,62,199,224,248,61,129,161,134,189,75,244,181,60,228,230,9,60,167,141,81,62,120,112,166,188,202,97,232,60,122,173,56,190,208,164,158,60,168,118,177,61,208,79,139,60,180,18,135,59,20,124,14,190,209,40,106,190,15,200,184,189,125,113,251,190,145,1,45,62,169,7,112,190,76,44,101,191,154,83,39,62,231,26,169,61,107,26,218,189,246,237,112,190,255,129,6,190,249,92,40,62,68,252,75,190,10,113,23,190,131,136,19,189,142,67,255,189,51,168,9,62,1,146,173,188,52,88,127,61,50,46,227,189,181,25,3,61,29,184,86,190,21,195,27,190,11,139,56,61,154,60,195,61,160,218,0,189,42,205,2,191,66,122,245,184,12,107,225,189,129,3,183,190,180,47,110,189,139,175,192,190,224,144,8,62,173,239,61,190,115,3,106,62,129,32,43,190,248,42,11,190,234,99,134,188,56,189,57,189,222,13,249,61,54,210,202,61,237,0,136,189,39,132,28,190,4,192,1,190,178,20,18,62,137,146,115,190,198,140,72,59,100,60,166,188,141,249,96,62,55,34,37,62,223,52,55,62,169,221,97,189,197,199,220,61,235,49,74,60,4,119,28,62,229,6,72,61,35,108,145,189,90,237,34,191,14,53,190,60,206,198,60,189,163,149,96,62,79,136,38,61,26,197,97,62,254,158,204,60,230,21,164,189,89,238,128,62,253,147,232,189,201,1,251,190,143,213,91,190,185,166,170,189,69,51,218,190,31,66,4,61,42,192,12,189,138,129,4,191,164,60,43,190,176,28,101,189,86,77,5,62,102,91,50,191,200,100,234,61,129,160,24,190,30,225,132,190,148,36,44,190,81,239,144,189,175,199,188,61,113,231,0,62,90,42,4,191,214,185,123,190,127,152,55,190,250,122,57,61,188,12,185,60,207,160,215,190,153,112,144,189,77,160,158,190,45,207,177,60,129,167,105,190,33,236,33,189,91,101,16,62,70,118,134,61,44,38,20,190,55,80,221,61,187,167,57,190,19,71,172,189,7,37,179,61,29,26,128,61,180,238,99,190,204,105,132,62,181,55,191,61,206,114,68,191,131,231,111,61,120,13,203,62,87,254,89,191,18,104,35,62,102,94,6,62,53,43,43,188,30,77,105,190,48,83,43,190,11,189,176,187,104,193,57,190,84,120,82,62,54,140,174,186,255,233,212,189,9,140,12,190,172,61,226,61,124,102,59,61,59,152,11,190,204,56,167,189,184,78,6,60,92,117,23,61,95,63,172,189,250,74,81,61,13,237,125,61,36,85,8,62,204,70,44,62,100,122,62,60,3,129,211,187,146,45,245,61,92,158,76,62,19,4,12,61,211,189,176,190,43,25,116,189,160,202,48,189,63,253,216,189,162,101,60,190,147,163,186,189,236,229,59,61,207,193,108,190,177,196,180,189,227,86,200,60,137,4,156,190,21,108,43,62,197,252,48,61,165,157,49,62,176,204,232,60,14,147,167,190,216,252,134,189,9,28,255,60,236,63,60,190,18,44,239,189,214,150,209,61,89,145,237,189,148,240,97,61,15,90,132,189,204,82,21,188,11,90,10,191,87,56,99,190,171,78,148,62,27,221,189,189,42,178,55,62,58,51,53,62,117,231,60,188,190,61,171,190,95,70,99,190,126,75,228,186,41,185,33,190,208,95,247,188,183,208,129,190,135,255,90,190,75,96,0,188,208,10,115,189,149,14,164,62,6,5,124,190,223,189,93,189,158,115,117,189,106,42,163,189,139,131,153,189,173,52,144,61,118,69,107,190,143,58,102,190,240,205,8,188,128,152,17,190,185,82,27,189,167,153,190,190,1,206,154,189,18,54,102,190,222,123,6,190,219,141,207,60,103,31,174,187,168,237,177,62,105,188,199,61,251,0,180,59,213,89,62,61,149,79,112,190,149,209,82,61,137,138,157,61,233,185,215,60,34,44,19,61,206,31,207,189,72,131,25,190,248,225,58,59,242,195,157,61,44,206,49,62,27,1,163,58,197,156,123,189,94,51,53,189,71,125,239,60,3,247,165,62,198,37,22,61,164,125,130,60,199,147,4,190,111,136,114,190,186,85,73,191,207,106,52,190,183,27,158,190,252,12,19,61,2,223,75,190,250,180,76,188,248,103,73,61,234,21,0,63,92,153,96,62,53,33,106,61,172,203,43,190,246,89,177,189,12,99,209,190,4,45,166,189,255,48,32,190,251,159,40,190,0,39,174,189,249,155,4,189,89,162,134,189,134,146,149,61,217,149,210,189,228,86,190,60,203,255,46,62,92,15,83,190,38,57,14,188,220,196,204,187,1,91,212,187,79,137,127,62,95,155,8,61,174,234,238,190,28,85,32,190,0,175,8,188,131,89,24,62,62,19,4,62,161,137,93,188,5,213,208,189,87,203,245,189,226,26,105,61,22,169,18,62,39,68,5,62,19,252,234,61,65,125,127,190,156,47,23,62,19,89,159,190,235,128,134,190,149,237,206,189,22,52,66,191,247,204,101,62,105,25,93,190,36,98,196,190,209,189,142,188,124,221,251,60,242,224,201,189,166,161,250,189,16,141,170,189,158,53,135,190,181,23,162,61,102,123,25,62,146,147,227,190,189,104,82,62,145,61,213,190,106,35,1,191,21,226,157,61,90,123,73,61,250,120,18,60,52,198,165,190,50,67,60,61,151,163,157,189,82,91,194,60,241,29,114,190,246,232,2,191,74,12,31,190,210,94,179,61,79,235,95,61,177,43,101,190,214,181,44,187,111,155,41,61,161,136,8,189,96,103,97,59,139,28,111,62,88,21,20,62,1,137,64,61,194,91,15,189,82,103,54,190,137,5,173,190,30,108,245,59,206,203,64,61,23,27,108,189,230,39,4,62,83,59,134,190,143,151,218,189,167,236,38,58,134,80,198,61,165,159,59,190,98,243,0,190,253,95,46,62,224,27,163,189,137,208,87,61,128,241,148,190,117,52,235,62,112,189,193,190,111,64,3,189,133,161,138,190,47,35,179,190,109,174,80,189,183,200,85,62,156,109,54,190,67,126,181,61,152,248,108,61,133,54,249,61,250,27,213,189,19,113,22,190,132,25,46,189,16,153,26,190,131,133,34,190,167,185,145,190,128,119,24,191,145,164,12,188,39,68,227,189,15,65,226,189,123,41,213,61,113,143,88,60,101,236,129,62,192,77,13,62,140,59,209,60,70,235,103,190,167,193,135,190,2,187,58,62,152,196,10,190,124,35,163,190,89,56,58,62,254,73,183,189,38,222,42,190,192,247,73,61,113,250,227,60,140,232,145,60,125,137,17,191,183,12,40,190,5,18,44,61,13,153,174,60,229,184,42,189,86,249,6,191,158,189,235,189,65,7,1,189,244,73,79,60,171,28,12,62,135,216,183,190,94,196,198,61,163,160,153,61,219,170,26,190,149,63,250,189,243,145,138,190,44,113,64,61,64,79,12,190,246,216,170,62,121,253,231,61,189,171,161,190,85,1,164,190,192,238,139,61,56,145,128,189,241,95,252,61,141,13,139,62,42,40,56,190,146,17,245,61,84,145,152,61,122,236,164,189,131,161,0,191,124,8,251,188,43,158,224,188,175,85,223,190,209,159,122,189,129,48,128,189,77,103,4,61,118,72,136,62,60,76,84,61,160,22,6,62,11,207,176,61,156,18,92,61,39,232,213,61,187,232,23,188,61,54,132,189,154,174,95,189,246,23,69,189,89,225,23,190,238,125,4,188,61,254,206,188,117,117,44,190,103,236,170,61,201,199,247,190,37,25,201,61,11,201,43,191,10,51,254,61,168,83,16,61,246,0,225,189,103,6,151,190,78,155,207,61,156,28,61,190,110,178,38,60,180,196,212,61,171,16,55,62,86,240,13,62,8,31,225,190,124,73,8,62,123,217,0,62,141,158,252,188,50,92,146,61,89,183,43,189,84,189,196,190,146,97,243,61,126,229,136,190,161,66,34,189,63,114,9,189,124,172,51,60,144,162,184,189,131,127,63,61,124,87,160,189,31,209,154,189,123,59,16,190,114,18,210,188,161,135,77,189,149,28,96,62,243,35,65,190,55,65,86,62,139,3,180,189,13,139,58,189,98,68,81,62,164,112,84,190,159,157,99,189,171,123,223,61,214,210,41,62,20,70,221,188,92,78,70,188,236,199,95,190,151,168,110,62,233,57,233,187,63,203,170,190,232,159,113,61,132,18,111,61,244,131,207,189,21,32,217,186,166,194,211,186,234,225,168,189,116,6,147,189,214,88,152,59,60,75,96,188,13,47,39,190,227,255,91,62,122,125,89,190,224,111,145,61,0,13,55,188,59,127,22,191,8,135,179,60,6,221,80,62,124,170,87,60,216,130,108,57,67,114,1,61,82,96,165,62,144,22,60,62,95,83,112,189,159,50,133,62,184,101,98,189,222,1,158,61,175,76,222,61,208,203,185,190,23,216,74,190,213,102,249,60,148,173,230,61,8,97,116,189,224,104,156,188,42,230,98,61,225,128,255,189,0,109,27,62,255,51,211,61,98,158,125,187,177,193,156,61,242,154,138,189,15,24,235,61,161,55,242,186,49,143,114,61,158,206,135,189,38,89,91,190,93,125,118,190,50,46,99,61,245,237,139,190,250,168,198,188,197,86,137,189,159,157,191,190,102,36,84,190,103,193,196,188,160,105,129,189,230,72,73,190,218,98,75,190,167,231,92,61,225,15,149,190,253,19,221,189,224,80,42,190,76,111,146,190,96,136,16,61,203,13,39,62,41,99,6,62,190,46,46,190,57,126,3,191,17,224,124,61,115,91,54,62,222,212,84,62,30,54,79,190,249,217,70,62,225,60,172,61,60,192,243,190,2,149,20,62,27,41,143,188,117,125,69,187,108,246,50,189,217,244,122,60,41,86,26,188,124,89,146,190,197,1,50,62,156,71,145,189,98,109,146,189,201,210,150,61,24,78,36,190,221,101,195,190,5,50,30,191,135,184,145,190,86,113,182,190,234,186,215,61,189,79,144,62,135,158,166,189,164,39,52,189,161,158,179,190,61,98,97,62,196,111,217,189,116,139,135,189,44,235,95,190,150,31,66,61,191,60,238,60,26,194,50,190,3,170,233,190,102,59,191,189,75,241,12,189,111,181,97,190,106,87,191,61,172,80,106,61,175,191,88,62,111,179,37,189,93,0,60,189,113,115,243,189,136,13,242,190,252,180,144,60,43,250,233,189,113,103,150,189,39,220,221,61,204,7,97,60,107,124,171,190,52,191,231,61,56,101,184,190,4,41,169,61,219,58,154,189,95,19,12,190,72,168,62,189,59,133,32,62,156,138,33,190,142,213,136,190,191,211,23,62,176,81,153,189,18,57,240,189,213,74,139,60,125,194,153,189,234,75,189,62,42,33,72,189,60,87,21,61,6,15,33,190,1,207,89,62,62,63,70,60,140,249,106,189,78,44,189,189,151,231,70,62,34,12,172,190,85,179,199,190,129,60,217,190,116,53,107,62,166,149,30,61,208,117,186,189,235,220,37,62,229,74,170,190,106,37,238,60,175,43,27,189,109,48,100,61,152,39,94,190,124,214,33,190,21,170,158,189,37,51,36,62,48,158,12,62,43,121,54,61,116,41,131,190,93,175,121,62,37,209,114,62,49,242,118,190,143,94,76,190,241,249,30,190,69,199,180,61,164,84,242,190,240,10,120,190,128,27,181,189,254,141,26,61,184,211,89,190,26,104,176,62,174,157,78,62,202,228,241,61,186,189,19,62,29,54,94,188,167,202,139,190,122,46,40,62,139,5,147,59,23,215,59,61,116,240,6,190,12,133,1,190,176,133,44,189,188,105,139,189,69,3,236,60,49,92,65,189,11,6,180,187,45,74,153,62,29,116,168,61,48,162,21,62,136,10,59,61,181,124,119,189,210,99,153,190,137,165,223,188,238,109,71,189,218,67,89,58,95,115,127,62,80,45,8,62,170,122,178,189,20,32,230,189,253,107,128,190,73,182,190,61,160,153,165,62,190,31,177,190,85,128,148,190,119,27,219,190,181,68,177,189,120,22,12,190,90,111,138,190,79,217,176,60,168,137,187,189,234,246,133,62,237,186,240,61,232,226,155,190,139,163,22,62,28,108,234,62,131,123,107,190,172,10,129,61,19,36,239,187,73,250,50,191,196,117,9,190,83,149,94,61,95,142,3,190,229,91,191,190,17,119,98,61,2,170,216,188,109,9,70,190,219,13,133,61,120,64,41,60,201,213,208,61,44,132,125,62,62,46,234,185,131,57,47,61,18,153,83,61,25,21,186,62,191,236,121,189,112,37,139,62,37,78,51,191,113,104,29,62,211,84,246,61,183,106,251,190,145,87,105,62,112,249,222,60,174,78,214,190,238,135,228,62,116,148,133,191,150,30,82,61,53,238,98,62,93,20,99,62,139,198,221,190,46,64,147,61,100,151,21,191,16,1,7,62,224,38,142,62,16,196,215,190,100,53,6,62,75,94,254,62,201,14,215,62,251,71,235,61,194,49,66,62,85,143,10,63,47,161,195,190,25,155,122,189,246,69,183,62,40,231,24,189,71,181,131,191,23,204,149,190,204,81,163,60,136,30,61,188,147,255,18,63,168,96,61,191,208,160,134,190,125,78,203,61,222,158,25,62,208,244,194,188,179,186,103,191,143,184,123,191,248,21,88,190,18,4,177,61,23,155,9,63,119,29,126,62,222,33,100,189,104,26,232,189,68,21,47,191,128,57,208,60,118,46,10,191,141,237,190,62,134,103,144,191,129,91,13,62,130,0,19,61,126,235,138,61,245,19,152,62,12,7,132,190,146,161,156,191,186,151,36,63,175,234,12,62,166,0,194,60,186,148,38,191,195,173,157,191,252,121,97,190,94,169,188,62,46,135,87,62,244,96,190,62,165,232,158,61,89,44,135,191,131,67,26,62,180,89,141,62,102,93,133,190,245,188,112,61,218,200,198,62,91,200,123,61,134,104,180,188,114,234,88,62,103,4,23,190,56,188,175,62,125,212,218,189,184,82,118,191,53,212,131,191,250,232,75,191,5,178,74,189,174,2,2,191,118,206,47,190,63,110,16,190,182,115,171,62,22,94,65,61,94,33,148,189,76,217,174,62,119,31,158,62,216,231,189,189,32,37,145,62,167,41,196,62,221,39,60,62,40,117,15,62,48,53,176,62,232,74,19,191,37,142,175,62,42,210,24,63,180,173,5,62,112,184,35,191,61,94,108,190,70,156,42,190,224,252,147,61,79,42,84,188,167,210,134,191,57,175,25,62,233,38,14,63,238,188,108,62,29,244,100,189,211,1,166,61,137,124,136,190,61,64,119,188,6,83,72,63,248,37,11,191,78,236,152,190,73,94,237,190,96,198,219,62,92,224,17,191,81,22,131,191,37,125,48,191,85,243,252,189,192,6,103,62,27,217,29,190,42,56,131,62,241,27,3,190,199,28,41,62,167,158,113,61,45,171,132,191,210,193,211,62,62,93,205,62,58,18,6,190,98,234,131,191,158,235,226,62,25,197,214,61,253,57,144,62,239,236,19,63,191,37,45,191,59,140,112,191,250,140,228,60,193,146,117,191,37,23,171,61,125,201,93,189,37,4,167,61,246,172,19,63,7,144,95,190,156,214,248,189,224,68,166,191,147,89,128,60,23,47,30,191,160,163,135,190,34,203,208,62,212,17,73,62,22,62,190,62,106,239,7,62,35,193,65,63,212,153,162,62,1,56,202,61,251,231,146,191,122,77,244,60,195,24,187,190,120,67,71,191,205,142,42,191,98,150,157,190,124,29,78,191,201,236,170,190,44,146,117,62,86,187,18,191,73,177,29,63,74,165,134,62,196,192,10,62,81,19,137,62,155,58,183,191,82,223,194,190,196,16,141,60,206,234,163,190,184,125,81,62,87,192,182,61,89,78,215,62,213,113,244,61,61,78,187,62,78,85,8,190,168,67,23,191,89,7,120,190,33,227,108,190,73,246,76,63,30,201,170,61,249,144,195,189,100,177,217,61,242,160,24,62,93,4,160,190,116,76,58,62,177,9,4,188,27,49,201,189,157,142,136,190,75,80,207,62,158,164,125,191,177,139,163,62,39,23,23,188,113,239,209,189,183,174,121,191,169,167,38,190,46,32,217,188,108,196,46,190,11,144,68,190,216,101,95,191,3,15,119,191,16,155,78,62,178,91,50,190,43,216,121,189,119,249,150,190,35,198,168,62,221,208,177,62,253,1,178,61,124,198,46,191,126,235,55,62,81,12,115,191,65,74,193,60,238,221,172,62,136,222,60,191,189,22,187,190,214,230,201,190,44,36,61,190,24,150,63,190,105,43,97,190,27,11,9,63,45,114,87,62,253,130,227,62,144,54,8,62,169,210,99,191,180,159,119,62,105,23,178,61,71,181,116,62,177,48,127,190,166,159,116,191,214,117,150,191,6,60,251,62,54,113,171,62,171,145,100,190,216,210,114,62,126,152,163,62,179,47,145,62,211,65,228,62,4,209,17,191,252,161,17,191,168,237,239,189,143,228,12,191,68,90,109,189,17,160,232,62,118,184,5,62,14,30,244,189,76,57,121,61,138,150,44,191,208,102,31,191,106,148,196,62,92,12,141,62,134,66,209,61,43,159,122,62,220,127,121,62,188,254,101,190,85,162,53,191,56,232,7,62,77,124,9,191,162,197,123,62,36,149,149,190,83,173,2,190,76,79,64,191,83,146,150,62,4,83,172,62,173,229,160,62,87,17,112,62,87,128,144,62,30,237,236,189,222,193,159,59,239,154,124,191,88,47,22,191,183,49,221,61,193,143,217,190,115,102,41,190,25,222,185,62,72,192,253,62,62,171,68,188,18,148,6,61,145,203,139,61,15,27,239,62,167,126,200,189,211,221,160,62,236,191,250,190,82,111,231,62,107,177,82,62,69,211,157,190,75,149,45,191,190,69,191,190,186,92,7,63,113,202,82,191,44,60,185,190,73,117,158,191,117,129,55,189,64,117,164,61,208,131,175,62,118,235,57,62,228,184,17,62,191,164,23,62,72,83,128,190,155,52,115,62,208,209,184,190,235,47,136,190,246,193,149,191,93,247,63,62,150,73,255,59,98,147,213,62,79,83,42,187,184,190,44,190,8,125,188,190,15,186,124,190,53,134,0,63,249,249,108,62,31,141,200,62,251,194,250,190,195,201,24,191,86,30,247,190,223,250,24,61,180,221,170,62,117,2,51,188,156,39,73,191,73,151,44,60,151,223,194,189,47,16,118,190,171,213,128,62,148,196,58,62,118,240,177,61,201,178,7,191,35,92,145,191,249,112,34,190,52,141,212,190,23,155,100,62,109,56,99,62,35,18,212,62,218,15,113,62,79,224,35,62,199,30,10,62,8,138,38,188,7,193,45,62,0,212,229,61,40,216,143,187,123,3,118,61,106,57,80,189,206,201,153,190,10,178,205,188,231,6,126,61,122,120,128,190,183,36,168,189,165,40,37,60,106,196,178,61,23,12,211,61,175,14,145,191,67,149,102,63,110,207,1,191,156,139,14,190,162,223,199,189,45,88,13,191,124,129,74,190,159,8,185,60,136,156,20,191,137,102,178,62,46,75,203,189,168,202,92,61,81,113,151,62,16,238,71,191,188,1,17,191,78,168,128,62,65,225,19,62,110,111,160,62,40,18,111,191,252,26,188,62,250,175,186,62,176,165,193,62,67,208,150,188,107,244,243,61,4,58,68,191,179,162,62,190,148,201,215,62,182,110,96,61,163,255,18,61,215,175,129,62,249,46,163,190,36,199,199,62,186,147,93,62,40,86,8,63,113,139,177,190,176,92,99,191,240,154,254,190,175,110,155,191,138,249,31,191,249,155,93,191,5,58,147,60,5,140,202,61,1,169,162,189,43,133,248,188,207,11,189,61,17,143,164,62,157,180,4,190,113,244,244,57,225,243,169,62,118,184,161,61,32,246,173,190,108,152,234,61,215,78,113,62,225,125,181,191,195,113,5,190,131,163,146,190,149,100,47,62,136,126,218,190,110,33,182,61,81,157,13,62,161,201,163,187,87,67,150,62,45,218,161,62,137,39,101,62,7,113,128,62,91,86,90,191,182,224,205,190,245,176,97,62,83,209,157,62,58,63,75,63,230,93,114,62,189,155,214,190,236,28,164,191,18,100,177,62,134,137,208,61,137,186,95,189,49,113,76,191,43,88,19,62,146,105,128,62,138,214,248,190,231,148,83,61,116,95,76,190,173,65,144,62,196,168,187,61,147,208,192,62,13,239,178,188,190,252,121,191,248,70,42,191,122,107,102,62,13,65,161,189,191,231,6,191,26,227,67,60,152,49,40,190,35,113,224,190,56,228,91,191,251,101,180,62,214,197,55,62,118,10,122,62,102,223,239,188,75,16,187,60,244,17,223,190,14,53,35,62,141,122,152,190,183,41,6,190,49,216,97,190,161,65,7,62,109,33,117,191,23,131,254,62,225,142,108,190,234,116,5,190,106,97,232,189,193,97,16,191,118,43,48,62,197,188,61,191,123,60,130,189,207,197,4,63,48,63,45,190,150,218,31,191,224,167,208,190,218,88,21,191,123,121,50,62,190,164,133,62,182,89,198,61,255,39,73,191,25,10,215,61,85,175,48,191,86,230,103,191,197,255,189,190,165,122,54,59,83,67,5,62,150,121,0,63,166,242,236,60,167,74,199,190,228,110,3,187,21,248,65,62,46,44,243,190,59,235,89,190,160,46,57,62,193,177,53,63,132,31,177,62,133,24,182,190,197,135,31,189,236,31,106,191,66,140,29,191,0,116,136,62,16,159,157,62,113,165,78,62,212,18,16,62,143,251,178,62,129,155,5,191,126,52,76,62,239,244,174,61,62,252,229,190,69,240,170,62,31,130,62,62,8,241,163,191,115,250,105,191,166,233,31,62,53,174,74,190,156,135,204,61,156,97,183,62,163,139,55,63,243,135,5,189,216,36,28,191,136,8,91,62,158,78,199,61,118,141,102,191,0,217,213,190,17,226,254,189,160,98,236,190,192,198,186,62,139,175,180,188,237,89,156,191,91,86,159,190,189,146,250,190,128,228,36,63,78,208,95,189,77,71,70,191,220,93,48,61,116,173,45,190,103,118,47,190,36,44,114,190,235,43,53,61,30,233,35,189,123,8,91,62,156,77,132,190,17,152,163,62,93,173,19,191,37,89,217,62,218,120,141,61,137,84,176,61,174,241,252,62,23,116,78,61,132,25,136,62,150,195,59,191,9,3,145,62,106,248,186,62,68,70,55,191,216,114,46,190,136,85,233,61,65,248,250,61,219,6,37,191,118,42,166,190,67,174,144,190,135,87,177,61,193,236,115,62,148,159,119,62,242,103,198,190,6,4,100,62,234,205,16,191,171,162,52,62,218,207,94,190,211,42,48,63,37,82,114,61,253,210,7,191,9,51,48,189,173,69,22,191,18,182,176,191,129,23,157,191,45,179,138,62,170,202,177,190,196,77,146,189,10,185,17,190,161,168,158,62,205,170,90,190,165,29,80,191,36,240,12,61,162,51,119,188,169,162,182,190,245,235,15,59,69,236,66,191,219,78,115,62,70,24,163,62,142,106,144,190,93,57,124,61,11,238,146,62,28,12,5,189,111,109,99,191,208,61,134,61,163,102,169,62,235,120,19,61,138,191,194,62,193,208,212,190,125,236,106,62,90,136,35,191,221,229,51,191,200,193,82,62,172,239,221,62,194,94,77,190,135,177,3,191,255,215,42,61,58,240,168,62,25,156,67,62,82,255,7,191,92,216,54,190,14,233,179,190,249,72,131,61,40,39,104,191,109,52,10,63,133,207,190,62,185,106,130,61,198,181,209,186,209,209,42,62,0,99,0,190,170,1,133,191,235,63,141,189,235,193,41,62,50,24,151,189,42,40,123,191,237,172,174,62,160,84,144,191,0,69,198,62,164,26,135,62,241,64,109,62,249,103,56,62,182,109,237,190,54,220,204,62,84,30,24,63,188,111,150,61,118,38,48,189,80,206,163,62,81,128,194,62,171,1,157,191,62,192,36,191,144,39,19,62,248,103,186,62,110,160,181,62,140,246,106,191,110,3,66,59,93,130,162,191,116,192,197,62,57,77,52,62,219,6,108,186,236,96,126,191,227,252,80,191,191,30,86,62,58,101,151,62,33,194,167,189,180,100,226,61,168,145,6,62,179,180,77,191,240,10,91,191,170,38,200,189,61,152,159,189,51,31,130,191,49,69,183,61,170,175,254,190,175,167,158,62,140,149,38,191,213,149,7,63,118,253,234,190,171,202,23,61,63,130,132,191,205,196,38,62,128,108,240,60,165,187,143,191,49,15,4,191,98,225,184,190,134,154,213,190,200,150,196,62,75,80,49,62,164,32,230,189,201,248,33,62,57,140,4,58,232,4,17,191,159,245,62,191,187,7,6,190,232,158,173,62,33,210,56,62,137,195,179,190,184,161,36,62,34,164,86,62,112,18,232,62,76,5,189,190,255,210,95,191,137,156,176,189,194,99,42,190,95,209,221,190,132,74,29,188,201,207,248,61,147,153,27,62,113,150,160,62,43,204,195,62,227,250,154,61,1,90,111,60,156,32,139,190,238,62,183,190,229,235,10,62,44,239,105,62,120,82,176,62,191,226,123,62,25,147,255,190,143,146,130,191,241,28,144,62,94,129,158,61,193,45,90,62,120,155,73,191,196,61,27,62,193,54,213,62,223,219,202,61,212,147,0,63,216,149,233,61,141,94,130,62,194,72,37,191,7,163,222,60,208,105,146,189,84,254,236,61,36,204,87,191,174,208,25,191,166,63,173,189,163,220,180,190,183,28,227,188,18,186,132,62,123,141,173,62,218,232,145,62,136,79,175,190,81,182,227,190,18,50,1,191,237,161,180,190,220,54,166,190,27,33,101,188,227,252,16,191,194,102,197,62,104,133,67,61,102,132,200,190,23,217,239,190,189,42,227,62,113,96,179,61,37,253,173,62,138,125,159,61,4,43,195,189,193,5,215,62,185,61,80,191,131,149,119,189,24,55,84,191,48,55,21,191,157,89,145,190,17,109,80,191,173,73,91,62,130,93,175,62,35,92,92,191,33,23,139,62,172,194,239,190,179,178,112,62,118,114,161,189,167,84,92,190,226,21,173,61,33,194,218,61,253,106,168,188,88,104,4,62,158,100,140,62,95,67,182,62,61,125,193,62,150,167,97,62,45,104,158,60,177,9,221,61,163,106,202,190,85,139,250,190,229,51,157,61,92,125,237,61,54,202,180,189,189,200,34,60,147,132,15,62,23,18,61,62,81,146,147,188,219,208,47,62,131,30,219,190,29,29,37,190,31,221,127,191,24,85,135,62,34,107,194,62,15,57,130,191,165,185,125,191,131,245,246,189,221,107,180,61,166,117,65,190,240,105,193,62,1,31,149,189,9,94,176,189,98,72,171,189,220,163,71,62,187,172,163,190,31,83,155,62,15,64,183,61,18,128,200,190,144,124,162,62,72,25,147,190,20,10,133,190,7,87,75,62,88,88,164,61,35,32,113,62,35,156,135,62,138,163,224,61,52,68,13,63,147,103,104,191,134,45,28,189,185,193,249,61,132,81,172,62,185,9,2,63,226,179,179,190,44,105,58,62,142,215,248,190,0,210,221,62,48,93,107,190,249,102,205,62,136,158,131,189,202,118,123,191,254,16,158,190,181,141,30,191,63,217,127,189,161,118,150,62,189,136,34,62,16,149,207,62,228,175,17,63,175,137,164,62,62,65,36,191,16,64,222,62,191,46,31,189,176,36,192,189,55,102,105,191,14,187,64,61,155,98,35,63,74,142,69,62,44,80,160,189,66,80,177,190,65,236,131,190,213,89,202,62,123,223,88,190,121,76,156,61,245,234,56,62,124,185,127,61,134,173,79,190,230,66,183,188,175,193,25,63,131,142,176,62,85,129,155,191,238,132,66,62,0,9,74,191,67,94,159,190,210,164,35,62,193,253,134,62,227,76,81,190,12,41,176,188,13,214,111,190,118,67,231,189,37,108,191,61,176,153,224,190,50,148,54,191,39,82,112,62,179,29,28,62,102,232,10,191,198,127,176,190,144,98,155,62,138,196,101,191,200,131,44,191,155,191,41,191,8,133,66,61,232,4,209,62,246,114,11,63,242,1,123,190,245,198,215,190,152,24,112,191,227,227,170,189,144,216,59,188,221,40,201,62,20,114,149,190,99,80,16,191,144,129,187,190,81,27,228,190,243,23,153,191,56,78,174,191,223,137,170,61,192,118,199,190,166,153,75,191,224,164,141,62,52,145,76,191,67,79,119,191,239,246,210,190,211,205,137,61,102,115,38,62,64,237,2,62,226,32,98,191,237,132,100,191,84,162,249,58,168,79,100,190,218,103,50,63,214,228,130,191,97,4,212,61,1,105,148,188,233,148,221,62,232,226,169,62,148,16,53,62,130,248,37,190,118,96,233,62,172,159,123,61,226,174,146,62,24,117,47,62,108,158,127,191,133,140,131,62,60,69,176,61,82,213,51,62,108,109,10,191,164,70,252,62,181,16,87,189,8,27,4,191,246,88,134,190,21,195,3,61,214,3,189,61,144,12,30,191,98,219,131,62,158,116,113,189,229,105,247,62,212,243,164,62,101,29,45,62,29,77,63,62,25,223,73,190,172,113,84,189,181,136,204,62,63,38,151,62,92,40,52,61,134,107,192,62,49,153,153,191,102,26,71,190,90,43,25,191,152,33,168,62,65,166,253,62,194,216,134,60,0,33,45,62,185,42,6,61,3,135,168,61,44,47,100,190,32,235,127,190,216,151,93,190,163,68,170,189,81,210,14,191,118,129,65,62,38,17,196,61,201,22,148,190,101,38,60,191,118,74,244,60,218,166,177,61,162,182,129,62,123,123,174,62,75,160,243,61,187,238,34,191,5,226,114,190,146,198,205,61,130,21,119,62,221,126,19,191,253,175,192,189,49,88,62,189,187,43,145,189,26,114,242,62,116,18,121,191,6,186,231,61,17,30,81,62,172,138,1,191,27,92,59,190,246,222,205,62,153,127,242,62,205,113,28,62,210,183,188,61,46,117,129,190,66,70,63,63,129,109,17,190,0,127,4,62,206,21,6,189,104,96,112,189,248,86,136,190,233,56,56,189,164,157,25,62,52,137,121,62,36,38,50,62,91,64,177,62,47,66,131,62,198,171,7,63,129,88,119,62,127,177,11,63,249,220,42,191,125,20,153,62,226,43,160,189,51,73,41,62,14,168,66,191,174,189,139,189,0,61,200,189,29,16,58,191,23,197,198,190,41,37,142,62,149,155,0,63,251,43,48,189,120,95,117,191,58,96,135,61,190,239,89,62,207,1,15,62,254,160,110,62,246,63,167,191,20,110,234,62,69,237,17,191,240,191,148,189,3,99,143,190,25,38,206,62,133,51,171,61,15,152,163,61,237,39,103,62,146,169,51,62,213,137,176,190,139,20,70,191,147,12,158,61,91,88,53,190,131,139,202,61,55,135,54,190,140,180,223,190,236,181,241,190,100,133,89,62,233,13,110,189,223,4,217,189,12,215,231,189,219,184,145,189,176,200,158,62,146,237,25,61,61,136,47,62,153,2,246,190,80,223,22,190,254,92,55,191,184,0,185,190,126,202,209,62,19,229,21,191,17,85,26,190,22,58,241,189,235,121,229,62,10,38,225,61,229,174,145,190,230,213,141,62,58,124,151,62,245,223,179,190,211,237,51,189,41,71,55,191,25,7,203,190,214,184,183,60,194,189,40,190,255,136,150,61,73,69,161,190,21,166,165,61,214,130,45,61,165,96,52,190,248,167,2,190,199,251,53,189,71,93,173,189,72,159,81,62,117,160,181,190,242,4,218,190,193,232,17,62,159,185,23,190,255,243,76,62,68,67,171,62,10,240,97,190,107,119,221,190,48,21,1,61,156,123,127,62,210,232,71,190,116,211,109,62,231,43,109,191,88,202,177,190,7,55,45,62,142,14,56,190,190,51,5,62,99,180,126,62,62,135,227,189,63,102,44,190,201,150,73,62,182,156,104,190,214,169,183,62,48,152,208,61,148,222,161,62,233,0,224,188,51,119,54,60,203,23,132,62,60,87,130,61,208,58,149,62,150,173,134,62,134,137,142,62,107,216,122,191,167,86,194,190,255,155,171,61,18,235,122,62,24,129,166,62,5,10,197,61,68,175,7,191,135,59,6,62,70,208,53,61,69,114,115,61,50,41,115,62,169,71,246,190,139,169,237,190,238,110,21,191,252,56,14,62,249,115,103,62,47,136,172,189,97,226,153,62,151,119,211,188,190,96,99,190,52,61,194,61,122,218,192,190,253,142,89,62,76,51,32,61,211,205,160,62,92,191,156,190,181,189,158,190,93,178,101,62,146,89,78,58,179,40,56,61,115,19,123,60,252,199,53,188,163,204,80,191,123,55,83,62,77,45,204,189,4,134,183,187,180,112,139,62,230,163,18,62,249,52,143,188,118,152,8,190,134,112,246,61,21,228,133,190,96,84,160,61,101,195,155,190,101,251,227,61,81,27,88,190,160,135,119,62,147,177,7,190,233,185,64,62,120,194,177,61,4,130,130,191,9,161,146,190,149,102,33,62,126,236,53,62,120,118,38,191,185,123,193,61,122,244,184,189,253,4,18,62,130,233,186,57,33,62,71,62,28,157,239,61,169,233,125,190,63,115,248,190,211,98,155,62,32,235,135,190,188,109,13,190,108,92,160,62,141,244,124,62,196,190,26,189,117,137,218,190,164,14,203,189,225,34,64,191,207,141,204,60,185,55,26,62,86,169,178,62,254,21,6,61,65,14,29,189,198,13,193,188,0,166,230,62,78,93,8,190,109,181,87,189,221,125,55,62,202,110,70,62,196,12,59,189,75,5,17,62,91,254,42,190,209,235,199,190,137,157,151,