{"meta":{"epsilon":0.3675161600112915},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[9,214,141,62,175,97,88,62,166,161,202,61,148,150,75,190,185,100,97,190,95,28,105,62,176,10,39,62,178,209,9,61,16,181,130,62,82,157,150,62,105,184,108,62,228,163,13,62,217,93,161,62,70,201,209,189,91,44,135,62,12,48,154,62,162,107,5,190,230,228,201,188,11,5,32,61,32,59,34,59,19,118,51,61,161,203,179,61,114,150,197,62,180,211,179,62,143,27,134,190,27,66,229,189,120,170,109,61,171,9,178,188,53,46,186,188,158,13,42,62,203,83,140,61,240,203,221,62,1,185,69,62,215,244,85,190,209,228,111,190,22,219,132,62,202,131,93,62,246,181,164,62,58,156,136,62,138,165,60,62,147,180,196,62,78,228,151,62,119,132,39,61,218,147,34,190,241,248,186,188,26,77,97,62,56,199,175,190,126,249,175,61,28,34,164,190,138,62,134,62,248,228,148,61,232,242,129,61,48,39,35,190,82,217,66,62,204,187,230,189,147,221,35,190,30,201,187,189,150,43,47,62,120,0,96,62,194,115,44,60,105,128,156,190,76,167,99,62,106,214,140,189,18,218,239,190,190,171,9,191,210,134,183,190,216,158,16,190,169,125,52,62,215,82,229,188,112,30,253,189,154,136,96,62,112,172,239,189,224,138,29,62,110,67,223,189,61,40,80,62,255,12,71,61,35,63,33,61,232,227,135,62,185,79,104,61,202,146,191,58,83,252,151,190,181,44,144,62,15,149,20,62,121,196,114,189,98,196,82,62,57,61,160,190,77,248,132,61,62,22,51,62,76,166,119,60,202,152,109,61,66,71,87,190,140,21,243,61,96,89,141,190,61,69,243,190,159,201,185,61,166,49,26,62,150,253,205,62,85,109,70,190,244,224,217,190,117,251,64,190,254,146,50,62,112,139,137,62,43,139,241,60,180,0,115,61,198,223,193,60,165,250,58,62,9,65,201,62,22,228,100,189,187,22,141,62,74,8,71,62,38,217,232,62,150,31,147,190,105,71,44,190,78,19,175,61,84,20,196,189,108,21,1,191,116,92,162,61,189,253,115,62,4,207,32,61,104,90,142,189,109,107,78,62,97,120,215,62,51,38,155,62,118,58,0,188,155,39,66,62,50,57,55,62,244,208,91,190,130,185,244,189,19,197,154,190,140,93,220,61,74,231,43,62,28,178,40,186,17,204,86,62,58,36,118,190,212,121,71,62,96,55,4,62,1,152,7,63,129,19,187,61,7,150,138,62,106,59,221,190,253,78,121,62,75,206,10,190,122,95,216,61,209,197,64,190,188,52,220,61,112,133,131,189,239,101,99,190,145,65,8,62,175,182,195,186,235,26,73,62,146,108,163,190,162,12,208,62,192,23,36,188,12,4,114,62,89,6,106,62,85,12,85,189,191,50,231,62,245,19,130,188,236,137,190,190,155,166,14,62,78,60,172,189,96,197,88,188,158,203,1,191,163,195,5,190,245,179,120,62,86,2,157,62,63,160,6,61,239,27,214,61,231,53,39,62,146,67,12,62,204,24,128,190,235,1,221,62,148,24,235,61,134,150,255,189,231,109,46,190,249,213,151,62,47,121,166,190,253,227,6,190,36,111,55,62,202,248,126,62,251,221,162,190,250,137,18,61,117,40,52,62,75,56,163,61,152,6,56,188,45,103,160,190,49,198,119,61,29,145,59,188,51,105,12,62,111,12,232,62,153,1,159,189,49,62,190,190,228,236,251,62,99,50,194,61,53,82,89,62,150,65,135,62,239,207,136,62,234,227,31,190,145,107,203,60,84,79,76,190,251,199,137,61,16,172,142,186,14,103,46,189,33,101,96,59,224,210,234,60,5,5,236,189,241,122,91,60,249,99,130,62,161,7,173,189,34,205,224,61,34,113,26,191,141,14,38,188,7,149,13,62,28,69,181,187,207,28,155,62,194,247,137,61,158,243,228,188,203,58,98,62,163,188,67,62,194,127,73,61,148,188,36,189,44,235,33,190,119,238,167,189,197,128,165,187,188,46,43,59,8,114,114,62,75,249,194,189,11,26,159,188,197,174,59,62,29,108,254,190,160,56,116,190,189,250,189,62,115,186,164,61,20,22,119,62,183,32,91,190,153,4,173,188,94,1,221,62,131,169,143,62,209,45,59,62,88,181,108,62,85,141,206,62,46,0,215,188,89,18,47,62,14,252,178,189,225,235,148,190,161,150,65,61,207,254,149,190,60,57,206,189,140,177,130,62,79,91,216,62,181,191,4,62,53,250,131,190,237,9,108,62,193,177,219,189,39,188,184,62,154,9,137,62,219,172,60,190,222,158,15,189,44,193,6,191,73,113,149,62,174,69,55,189,6,68,100,62,252,227,134,190,7,141,197,188,250,227,10,62,130,214,58,190,102,49,178,62,109,163,94,62,164,53,46,189,138,56,125,61,58,221,201,61,178,8,154,60,73,246,143,62,41,217,111,62,135,142,57,61,103,155,57,190,71,94,89,61,76,250,132,62,179,51,175,58,64,222,253,189,252,211,106,190,69,74,21,190,134,121,121,61,239,220,113,190,214,52,89,190,163,243,64,62,40,159,197,189,70,27,52,189,78,166,32,187,254,159,62,189,33,127,109,190,5,121,21,62,244,50,205,62,12,189,38,62,220,115,14,190,70,201,49,62,176,117,25,190,214,110,37,190,119,255,168,62,128,15,173,190,110,221,136,62,207,145,13,62,125,153,160,190,35,51,157,62,150,212,173,188,120,35,127,62,54,3,237,61,133,228,27,62,213,207,40,62,209,18,68,62,128,143,188,186,249,48,13,63,231,169,89,190,80,90,228,61,180,173,226,61,63,11,233,62,60,146,141,189,13,183,206,189,131,207,168,190,20,248,193,61,168,238,126,62,105,205,79,62,1,69,250,62,72,144,65,190,236,213,130,60,175,226,37,190,47,5,56,190,218,250,110,62,150,105,180,62,212,182,239,189,111,33,100,62,38,93,20,190,72,94,94,189,70,103,146,62,44,76,13,62,234,164,151,62,242,196,184,190,3,222,33,62,167,9,183,187,235,245,47,190,93,216,89,61,88,85,135,190,11,113,196,62,174,144,140,62,123,22,52,189,164,5,219,58,190,96,17,190,56,5,206,190,125,97,142,190,153,1,194,189,128,182,230,61,129,174,21,62,248,142,155,62,82,29,230,61,125,147,2,62,154,140,137,190,21,51,166,61,6,174,36,62,121,39,29,190,124,182,196,62,221,138,221,62,101,100,154,189,97,67,102,61,170,89,203,189,35,177,109,190,215,27,35,61,75,163,1,62,197,112,206,189,209,69,184,62,170,231,83,62,80,155,206,189,173,124,198,62,187,131,98,62,222,104,230,62,219,205,59,190,93,228,121,62,209,104,132,190,91,123,47,190,228,17,177,61,115,171,12,190,203,131,148,61,97,201,143,62,25,144,203,189,221,245,86,62,82,148,89,61,110,41,108,190,193,168,144,61,0,95,47,62,180,128,92,62,24,211,154,62,11,203,227,61,38,7,209,61,45,236,141,60,90,122,164,62,21,229,149,190,15,193,60,61,180,18,60,190,186,246,216,62,133,68,133,190,138,160,141,62,209,63,49,62,195,132,254,61,70,123,143,190,253,9,205,62,50,241,25,190,38,187,219,61,121,161,39,190,37,37,17,189,46,78,41,60,255,172,63,62,251,131,169,61,208,58,208,61,143,120,184,61,120,208,103,190,98,23,44,190,185,192,168,62,215,175,17,190,30,161,16,190,109,202,164,62,239,66,55,191,25,79,34,62,49,93,2,190,34,219,152,190,69,103,70,189,50,157,148,62,176,132,129,61,133,229,55,190,172,220,84,62,198,85,181,62,161,97,249,189,83,35,13,62,190,233,197,61,117,109,194,62,228,230,26,62,14,252,152,62,175,81,46,62,181,62,199,61,30,198,7,60,67,17,7,190,88,17,16,63,239,66,138,62,79,20,219,62,246,149,167,187,228,114,223,62,112,112,33,190,148,244,33,62,223,237,58,190,124,150,71,189,87,104,193,61,217,148,197,60,106,219,185,62,180,129,73,190,122,173,157,61,140,97,168,61,73,26,49,190,114,79,206,62,113,186,228,62,237,23,70,188,27,210,29,190,131,123,37,190,138,132,137,190,132,21,74,190,240,206,163,60,211,57,164,190,28,115,32,189,242,0,11,63,127,211,175,60,255,204,62,190,142,127,92,62,241,101,150,62,54,222,147,189,120,240,197,190,174,39,167,61,219,68,142,62,250,195,98,62,10,250,52,190,101,162,111,190,115,172,143,189,128,25,229,60,149,16,77,62,240,58,133,190,20,8,222,61,5,230,168,190,138,170,132,189,12,84,26,62,0,158,182,62,2,174,141,190,236,185,166,62,72,135,216,190,236,33,196,62,98,29,243,190,13,93,154,62,115,180,144,190,9,210,147,62,210,196,92,190,246,180,10,62,155,77,204,62,126,88,2,190,208,92,33,62,91,131,176,190,180,97,115,60,227,223,160,190,28,144,187,62,144,59,206,62,124,240,69,61,238,72,32,61,205,240,188,62,102,27,172,190,213,80,83,62,18,87,177,61,242,134,128,190,206,202,233,61,30,170,100,61,244,171,139,61,45,220,33,62,78,181,148,62,127,162,195,61,230,97,133,62,135,24,61,190,148,126,168,190,124,242,8,188,108,53,106,62,31,95,140,61,29,141,132,190,11,241,182,61,188,241,161,60,121,226,111,190,23,112,200,60,50,248,36,189,35,100,113,190,53,112,238,189,55,172,247,62,17,136,54,62,5,119,161,189,244,242,253,188,130,183,173,62,148,24,241,189,4,18,191,190,214,57,156,61,167,247,238,60,128,88,156,190,197,69,203,61,53,137,169,189,170,15,34,190,214,7,29,189,242,48,169,61,102,6,133,61,110,27,48,62,96,147,46,190,13,133,161,62,99,244,168,190,194,145,26,62,49,7,27,62,210,124,186,61,148,99,23,190,77,74,8,62,176,200,252,190,178,162,33,190,214,147,112,190,70,21,102,62,159,132,129,190,90,86,51,62,171,63,128,190,176,84,204,61,25,154,19,190,233,6,4,191,118,22,55,189,153,19,137,190,135,204,189,189,20,240,250,190,250,111,163,190,22,245,246,190,72,48,208,60,31,32,158,62,252,197,161,189,36,129,75,62,36,99,188,62,62,40,211,62,106,47,21,63,247,184,36,62,189,87,221,60,180,50,8,61,235,238,0,63,111,171,232,60,234,105,129,61,96,169,65,62,4,182,172,62,93,116,178,62,160,43,33,190,212,117,150,62,63,144,164,62,115,123,203,190,178,160,187,62,205,233,31,188,159,225,198,62,108,105,10,190,121,221,147,61,42,225,154,190,242,21,198,189,137,27,2,62,96,84,189,61,245,19,80,62,139,183,143,190,51,209,144,59,228,59,79,62,169,44,130,189,209,196,179,189,203,182,96,62,19,1,128,189,155,39,159,61,16,60,52,61,229,160,34,62,109,4,243,62,203,87,238,187,3,229,161,62,47,93,89,189,53,236,37,190,204,112,77,190,127,23,226,190,128,39,105,188,17,9,31,190,41,189,239,62,234,165,23,62,47,200,0,63,110,44,157,190,18,175,134,62,79,66,207,189,141,250,141,62,99,52,185,62,126,159,228,190,167,145,130,61,90,206,236,189,206,246,17,63,72,163,153,190,3,200,19,190,122,101,129,62,211,43,190,62,216,194,191,189,200,180,108,62,103,77,132,62,23,128,3,60,101,158,6,191,124,150,178,188,160,18,66,190,29,137,72,190,99,19,126,62,163,39,167,62,126,254,114,60,16,237,42,189,204,50,22,62,203,66,12,190,55,83,159,188,105,253,1,63,187,49,24,189,10,54,62,62,47,53,181,62,196,219,157,62,165,237,111,189,182,5,126,61,156,175,1,190,133,32,240,62,42,42,83,190,204,217,151,190,93,45,72,190,56,93,23,61,181,159,167,188,132,12,41,62,10,250,255,190,155,73,166,190,132,125,151,190,81,143,13,61,95,211,30,190,161,92,80,189,119,93,14,190,59,225,198,62,154,151,61,190,158,91,181,190,192,60,154,61,255,69,73,62,170,47,7,62,25,48,172,190,128,203,77,190,205,108,212,190,38,73,32,190,110,210,21,190,112,2,228,190,187,64,254,61,58,187,212,62,218,164,211,62,241,168,149,62,197,30,94,190,32,77,100,190,232,224,115,189,152,221,229,60,215,138,97,189,158,2,243,189,118,93,116,189,115,194,148,59,94,44,44,62,44,67,35,61,129,171,192,61,221,175,117,188,252,229,178,60,13,215,167,190,222,11,246,61,56,98,228,61,188,212,231,62,12,233,203,190,206,43,105,62,171,52,123,61,147,27,8,62,144,238,154,190,165,228,103,190,28,250,14,190,218,128,212,188,23,145,37,62,199,115,208,62,137,253,127,189,115,132,130,61,42,9,179,62,195,147,162,61,188,63,172,190,76,52,219,60,194,0,208,61,134,62,142,62,139,25,71,62,246,148,13,63,23,71,238,189,164,25,6,191,171,86,95,62,39,58,201,189,109,227,25,62,192,199,222,61,244,134,130,62,191,206,242,61,246,92,89,62,217,184,154,190,99,178,37,62,197,2,90,62,186,222,155,189,116,169,53,61,66,240,180,62,42,230,5,62,18,127,163,61,135,24,148,61,233,207,198,190,164,163,60,190,187,116,83,62,141,182,233,189,101,100,239,189,27,174,237,62,67,91,201,189,84,48,200,62,141,20,181,62,156,76,30,62,247,109,181,61,203,153,143,190,142,216,174,62,133,253,153,62,196,208,84,62,79,253,146,62,55,215,25,62,236,170,243,188,196,109,184,190,34,29,103,186,65,149,42,62,83,25,240,189,102,53,195,62,76,52,130,62,98,13,72,62,212,201,11,62,177,240,54,62,208,174,184,61,191,150,149,62,177,186,11,62,75,78,25,190,110,165,178,59,129,34,32,62,156,85,46,61,233,118,67,190,106,34,84,189,144,245,114,61,190,84,99,61,200,146,252,188,174,230,74,190,208,39,35,190,117,98,206,61,186,51,237,189,66,176,36,62,108,86,102,61,102,157,114,62,240,9,56,61,159,24,60,189,37,132,143,61,129,184,120,60,226,192,131,189,100,80,109,190,134,121,164,61,141,204,195,60,124,10,134,189,255,60,113,62,118,27,75,62,58,210,20,62,211,198,233,59,22,35,92,61,176,236,253,61,139,161,45,61,141,200,146,60,171,0,209,61,242,245,30,62,76,186,129,188,164,227,220,61,144,93,249,60,52,101,0,62,71,107,32,61,145,213,109,62,243,213,1,190,140,13,34,62,85,6,223,188,195,89,227,60,194,22,119,61,57,41,215,61,64,69,2,61,134,44,48,189,6,115,90,189,141,37,221,60,132,12,139,61,185,129,219,189,76,195,250,60,9,38,96,62,7,45,190,61,21,201,49,62,149,54,155,61,128,206,192,187,38,78,68,188,55,162,192,189,11,167,11,189,114,253,245,189,100,108,123,60,34,253,159,62,199,254,218,188,153,115,122,62,29,31,139,61,117,160,204,60,36,121,187,188,178,241,44,62,3,185,155,62,80,66,149,188,106,52,146,189,128,152,94,61,211,185,246,189,134,177,150,60,11,97,125,62,215,213,252,188,250,169,35,62,150,10,231,61,168,77,132,62,98,194,120,61,80,228,224,187,128,192,16,58,35,183,80,61,1,166,175,61,227,109,14,62,108,39,54,62,245,133,166,187,177,145,47,61,218,162,2,189,2,255,223,189,115,184,50,62,78,87,157,58,68,160,18,190,169,71,21,190,204,174,75,61,223,14,130,62,211,3,189,61,153,57,183,189,24,206,190,61,0,244,83,60,199,54,147,62,6,124,44,60,146,53,244,61,72,38,192,188,165,138,130,61,197,66,135,62,164,249,182,61,15,64,177,189,95,43,77,189,218,221,29,62,141,226,167,189,38,193,170,188,215,70,79,189,246,131,22,190,73,180,12,62,3,3,233,61,147,75,88,60,212,120,59,61,161,93,68,60,230,102,180,189,186,38,166,187,92,102,28,189,169,57,101,62,118,88,213,60,157,240,29,61,211,198,189,60,110,19,64,62,112,247,31,188,208,246,193,60,10,176,14,61,209,158,149,61,192,41,59,62,164,195,132,189,36,217,85,190,205,136,177,187,234,139,225,187,118,109,67,189,114,140,51,60,251,112,14,62,141,184,58,188,231,39,251,61,108,181,21,62,105,72,94,61,249,160,129,62,179,179,223,60,229,39,31,62,115,123,23,62,221,239,203,61,252,252,18,62,149,96,131,61,246,27,92,62,14,56,52,189,241,205,49,190,174,42,0,187,190,192,59,60,93,145,155,62,149,241,196,61,8,61,248,189,146,124,70,189,74,36,22,189,136,45,101,189,112,106,64,62,72,132,136,60,50,127,208,61,150,186,31,62,8,63,60,62,139,199,117,189,252,95,23,60,75,87,18,60,202,15,40,62,62,19,61,60,182,237,55,62,18,22,19,61,216,158,189,61,73,174,146,62,174,150,22,190,216,157,174,61,62,103,40,62,112,249,32,189,175,146,165,62,149,243,180,61,191,16,159,188,67,159,111,62,190,242,133,62,108,31,29,62,19,206,0,62,54,209,61,188,119,66,132,190,239,175,2,62,17,91,128,61,102,188,156,61,73,188,134,60,20,231,15,188,138,159,237,186,42,148,93,189,31,133,137,61,235,102,34,190,109,154,174,61,165,152,185,61,34,192,179,61,35,134,89,61,255,124,185,186,77,218,119,62,58,191,136,62,134,76,219,61,172,247,171,61,226,158,29,189,26,155,239,189,210,127,210,61,210,49,150,188,134,160,2,62,200,207,35,61,40,161,214,189,188,37,203,188,186,216,206,189,106,44,96,189,180,138,126,189,67,88,70,62,93,242,101,188,170,81,138,62,111,139,233,189,118,254,208,189,31,85,38,61,91,247,39,60,82,130,3,62,203,96,154,62,96,106,89,62,141,172,83,190,117,149,234,61,172,238,152,61,236,200,24,62,159,225,19,62,134,73,93,62,138,29,99,190,90,190,167,189,235,161,196,61,225,75,80,190,207,253,165,60,220,226,37,190,157,90,12,62,11,47,42,189,32,62,2,62,146,40,1,62,133,158,47,62,68,41,161,61,112,77,176,189,83,214,216,190,226,253,22,188,133,207,249,61,9,28,76,189,241,6,38,62,221,209,55,62,0,88,59,62,19,186,21,61,73,74,170,60,188,51,212,61,28,43,101,62,164,162,119,61,227,227,53,62,242,31,119,62,173,170,116,62,205,157,85,62,255,53,98,190,59,5,232,189,52,174,146,60,116,252,94,189,120,109,161,186,106,231,166,60,121,239,117,62,164,114,29,62,101,187,129,62,5,253,132,188,83,198,140,189,244,74,182,61,27,43,20,187,245,101,10,190,210,150,186,187,253,21,112,60,43,4,203,188,241,103,8,62,250,143,189,60,231,185,146,61,218,9,83,189,231,184,176,60,160,186,75,189,248,9,161,188,184,234,78,190,190,136,240,189,157,58,25,62,237,170,63,62,196,87,249,187,4,65,10,62,53,234,200,189,153,179,212,59,203,185,7,62,251,119,230,61,171,129,163,61,225,185,19,62,155,56,223,189,244,59,16,62,142,14,188,61,144,45,161,61,132,70,144,189,55,14,94,190,161,51,67,61,217,182,240,61,91,200,66,62,20,150,200,189,156,91,36,62,57,20,47,62,113,76,33,61,93,39,109,60,72,28,73,188,178,103,78,190,123,137,23,61,131,40,57,61,201,209,134,61,139,174,146,60,216,195,131,190,109,239,196,187,216,51,32,61,58,250,179,190,162,83,16,62,3,179,135,61,93,33,162,189,1,174,57,62,212,123,133,188,31,123,191,61,136,187,175,187,121,227,235,188,23,62,237,188,48,117,155,58,97,168,158,189,165,167,194,189,151,154,155,60,232,28,6,190,205,114,93,59,148,168,225,188,238,0,1,190,169,236,214,188,227,232,174,188,39,32,34,60,113,39,172,60,37,185,79,187,120,101,15,62,203,48,32,62,138,0,100,190,63,46,100,190,241,231,136,189,189,164,57,62,248,168,190,188,100,255,81,61,48,112,173,61,122,255,179,189,158,146,178,189,92,140,39,60,206,104,109,190,211,66,225,189,163,83,147,189,154,154,10,189,24,80,195,60,207,94,26,62,224,189,39,190,207,98,136,61,134,46,144,189,194,101,134,61,231,86,206,189,4,207,184,61,26,194,212,61,220,30,241,188,91,221,189,189,158,179,77,189,225,28,208,60,16,56,141,61,27,251,204,188,138,66,70,62,148,142,37,190,167,66,84,61,46,180,4,62,158,66,135,189,70,166,1,61,146,231,19,61,139,49,71,62,224,0,50,62,65,142,51,188,213,133,67,62,166,55,147,59,9,178,169,61,198,21,226,189,17,41,31,189,5,73,233,188,149,168,19,190,249,210,228,187,212,45,210,189,163,45,20,62,229,189,153,189,217,31,165,61,102,174,52,62,199,190,218,61,122,202,37,190,54,126,203,188,49,11,18,62,60,11,245,189,64,49,134,189,94,224,153,189,67,93,6,62,210,184,131,190,132,227,242,189,89,26,64,62,140,27,146,189,149,164,109,189,13,63,134,60,181,108,193,61,97,175,203,61,213,137,166,60,193,50,213,61,135,123,0,62,41,209,90,62,85,156,59,62,252,59,42,188,216,76,63,62,167,183,60,189,46,103,64,62,173,144,164,61,152,92,51,189,209,90,180,189,46,54,43,189,179,69,4,62,48,92,28,62,255,130,137,61,101,197,217,59,174,185,190,188,221,243,206,60,16,216,26,190,107,172,179,61,170,180,23,62,25,177,136,61,14,229,83,188,210,123,37,62,42,17,98,61,35,96,115,62,16,128,139,188,59,16,18,62,236,186,150,62,26,13,239,61,145,94,167,189,126,116,191,189,63,142,205,189,221,97,24,189,159,158,128,189,53,219,70,61,145,81,185,60,122,91,67,62,239,108,146,61,179,243,254,59,77,5,90,188,220,151,29,62,88,188,130,62,177,253,53,61,161,253,188,61,95,14,49,61,137,143,20,190,119,91,150,61,138,179,241,61,53,38,58,60,166,250,68,61,51,56,139,189,103,28,98,61,213,239,38,190,110,231,24,62,177,158,120,61,2,139,135,61,235,164,118,61,157,251,115,189,246,2,50,189,152,159,94,61,153,133,2,62,188,95,35,62,184,100,130,61,235,139,183,61,94,172,86,61,199,117,8,188,14,19,27,62,74,251,167,60,193,96,33,189,108,93,67,61,173,213,27,189,129,106,242,61,6,172,61,188,133,225,228,60,18,146,26,61,4,186,175,61,235,199,56,61,120,239,17,190,137,100,140,190,162,202,7,62,192,121,158,188,210,203,17,62,202,102,127,58,75,159,152,61,170,135,238,189,110,97,47,62,142,24,128,61,43,36,246,60,51,246,1,62,75,182,58,62,116,88,27,188,28,164,86,60,243,126,127,190,203,53,216,188,56,39,21,189,178,212,31,189,114,28,4,61,171,220,15,190,225,27,99,61,104,221,140,60,194,133,76,61,113,42,164,189,218,107,1,190,153,246,65,190,64,40,129,61,70,109,191,61,32,3,193,188,108,89,105,62,98,132,50,189,246,160,114,62,207,47,150,189,203,223,38,62,97,3,8,187,49,206,142,189,24,129,101,62,198,43,88,189,112,191,134,60,31,50,65,61,188,13,188,61,229,1,185,189,74,210,19,189,176,126,0,60,60,32,180,61,133,103,232,60,212,42,219,189,38,213,168,189,243,234,186,61,74,29,116,190,89,41,40,189,115,61,92,60,210,227,105,189,9,200,13,190,225,71,130,189,238,208,252,60,65,44,56,189,177,218,4,62,19,246,140,189,72,213,69,60,52,0,6,61,35,56,199,61,249,24,166,189,99,108,67,62,73,39,163,189,150,73,34,62,31,152,13,62,219,79,169,189,76,174,44,61,172,190,7,62,70,128,139,61,40,154,139,188,83,180,240,59,249,146,22,189,18,147,10,61,215,203,13,62,0,95,247,61,34,2,28,190,6,253,46,61,48,64,164,189,51,148,113,190,240,202,135,61,209,196,134,190,219,229,161,61,86,165,197,61,142,89,172,189,64,162,223,61,143,220,149,188,85,158,219,61,250,196,4,189,175,18,249,60,251,210,141,189,131,123,27,190,74,86,50,62,57,12,124,61,17,89,141,188,229,22,62,189,29,114,170,188,43,214,73,188,130,163,252,188,44,22,166,60,153,217,112,61,2,219,168,189,253,69,1,62,82,11,107,62,250,21,42,189,63,233,142,188,127,238,208,189,39,168,75,62,235,207,208,60,116,67,4,190,84,190,140,189,187,36,52,189,97,184,241,61,83,63,205,61,82,237,100,189,211,16,148,61,176,235,86,62,30,251,205,61,159,31,114,61,221,238,207,61,11,215,179,60,8,174,170,60,251,35,4,189,178,182,252,189,225,3,82,61,183,28,228,61,53,250,46,62,0,138,3,62,103,15,46,62,57,130,52,61,173,150,32,61,224,182,166,61,243,242,71,61,45,80,35,62,28,68,37,62,17,89,146,60,171,4,80,190,7,165,154,60,173,90,156,59,53,62,68,190,178,165,6,189,246,0,168,61,62,138,58,189,71,216,233,188,204,22,193,61,221,15,119,61,162,38,187,61,158,229,47,61,246,71,146,190,40,202,172,59,33,108,137,189,33,39,156,61,192,32,222,61,226,208,137,60,191,109,181,189,191,166,39,62,103,144,54,60,21,116,24,190,195,94,213,61,225,190,98,62,229,104,1,190,132,35,0,62,70,59,162,60,25,47,163,189,22,150,144,190,178,208,148,61,145,77,171,189,122,149,226,189,51,92,244,189,20,51,24,62,92,97,118,61,182,234,199,185,127,136,12,62,30,159,223,61,185,186,37,62,231,240,54,189,55,6,205,189,185,21,3,62,240,248,3,189,119,79,210,60,23,118,79,61,225,169,94,62,135,101,243,61,11,171,73,190,34,159,136,61,162,129,244,61,211,82,41,190,11,58,126,61,75,17,66,61,253,135,121,62,221,165,249,61,149,251,148,61,192,43,73,62,115,169,208,61,163,29,250,188,186,61,140,189,246,102,192,188,192,63,183,61,182,136,46,189,77,83,215,61,236,222,60,190,147,88,18,62,240,57,196,187,208,67,240,61,143,240,55,62,90,136,228,189,36,86,156,61,74,97,72,190,26,232,189,61,58,39,11,61,66,173,73,62,216,90,4,61,39,58,43,190,72,185,167,189,42,157,224,61,152,163,36,62,72,197,126,61,9,232,135,62,225,234,124,189,191,157,143,61,4,13,57,62,145,37,180,61,91,216,121,61,201,13,142,189,30,185,159,61,25,236,128,61,15,98,24,188,24,128,14,190,208,166,66,189,78,186,2,62,135,142,97,189,114,99,175,190,96,87,224,61,91,22,236,61,192,74,20,188,255,37,129,61,139,180,204,189,168,35,253,61,195,44,235,189,212,173,163,58,120,234,159,62,169,92,33,62,5,186,132,188,70,133,6,190,242,67,102,190,18,245,73,61,73,93,14,61,14,74,26,190,150,177,17,61,140,201,117,189,67,57,113,61,38,199,217,60,98,216,178,58,18,127,9,62,168,6,65,189,41,69,174,189,204,212,47,62,151,144,121,189,251,10,11,189,138,74,245,188,121,85,70,62,201,99,138,61,219,67,114,61,159,241,94,190,200,160,209,189,201,71,163,61,30,152,179,61,252,156,63,187,149,47,177,61,80,150,203,189,132,54,214,189,202,177,173,61,176,247,209,60,212,225,42,188,91,134,180,61,70,122,2,61,52,144,36,62,152,155,241,188,93,79,92,189,153,129,186,61,254,45,72,61,180,55,189,61,167,132,138,189,135,67,140,60,118,227,3,189,60,186,70,61,29,74,137,188,205,135,130,190,158,169,186,61,126,148,121,189,98,79,122,188,249,114,121,189,7,2,250,61,72,65,60,189,184,1,103,59,165,19,204,61,245,72,154,59,57,27,238,188,112,157,214,189,101,255,174,189,132,65,117,61,120,71,3,190,154,249,34,189,88,83,18,62,131,84,161,190,108,0,161,61,86,42,122,61,246,227,67,189,64,193,68,188,28,144,30,189,206,152,12,189,70,162,111,61,150,255,156,60,150,189,167,59,99,8,189,189,124,221,241,61,74,198,93,189,50,6,195,189,133,55,110,189,82,79,32,189,14,225,33,62,55,184,200,189,1,145,75,189,104,92,31,61,14,152,171,189,168,181,251,189,79,116,112,62,107,136,19,190,245,94,177,61,139,123,206,61,249,166,154,188,168,41,93,189,228,230,9,60,166,61,84,62,190,156,210,188,3,20,177,189,234,233,24,190,52,241,106,61,173,95,8,61,47,33,120,190,212,215,149,189,179,240,5,190,191,220,31,190,157,134,128,188,234,190,141,190,197,54,168,60,68,125,206,58,5,237,58,190,173,8,150,188,195,228,136,187,194,174,9,190,202,247,153,61,116,43,194,60,103,170,12,61,142,249,42,190,70,138,158,188,152,155,21,190,160,67,54,190,63,145,67,62,60,39,227,188,139,158,168,189,79,164,56,190,200,206,82,189,193,16,253,189,215,192,23,189,90,19,131,189,17,0,143,189,128,234,146,61,16,62,165,60,114,55,40,58,12,107,225,189,60,132,149,188,88,122,18,189,52,236,216,189,210,202,190,59,138,186,115,190,210,121,31,61,231,66,14,190,217,24,98,190,6,58,198,189,10,177,194,61,210,190,0,62,159,242,175,61,51,183,206,189,58,147,169,61,238,87,91,61,216,73,70,60,185,119,16,190,132,67,67,61,80,110,83,60,37,245,26,188,100,216,118,61,171,205,111,61,56,27,18,62,220,151,252,61,149,252,78,189,179,211,56,62,197,93,200,60,33,105,40,189,173,249,150,190,18,127,183,189,15,1,80,60,231,21,55,62,26,91,43,62,16,255,10,61,244,217,98,187,128,49,255,187,207,188,12,62,80,229,187,186,198,29,214,60,3,167,202,189,121,23,90,188,94,77,76,189,155,134,87,61,63,16,18,62,109,215,247,188,249,40,103,190,153,17,72,189,157,4,28,62,212,25,206,189,196,16,199,61,6,253,88,188,186,225,82,190,124,117,161,189,120,14,37,189,9,170,59,189,222,150,9,62,37,51,54,190,103,0,224,61,207,69,189,189,124,237,88,62,188,94,1,61,175,15,165,189,136,24,9,190,236,67,62,190,198,94,151,61,251,125,106,190,74,42,236,189,98,245,156,61,198,159,196,187,30,150,161,189,191,99,42,61,159,167,248,60,199,75,189,189,242,192,130,189,115,244,209,61,159,204,214,189,81,189,251,61,100,123,30,190,163,162,5,190,173,55,145,61,101,83,187,61,15,209,18,190,212,152,140,61,131,59,141,59,52,84,139,188,246,82,164,189,80,125,9,189,172,92,103,190,98,248,62,185,220,185,226,189,205,118,196,188,104,140,89,189,250,163,10,190,6,236,3,61,94,101,102,189,88,78,55,189,166,127,171,61,195,105,48,60,126,0,174,61,181,233,177,188,110,138,70,189,174,56,158,61,187,133,96,188,242,33,40,62,101,195,127,61,193,31,2,190,177,67,165,61,40,253,109,62,61,227,222,60,64,247,5,190,243,138,125,189,148,76,32,62,174,174,163,189,51,190,15,189,227,144,22,62,43,154,70,189,255,18,180,189,215,43,179,188,219,214,53,61,89,88,163,189,75,197,152,61,84,131,144,189,19,17,53,62,195,110,165,188,58,173,5,188,79,237,9,189,93,27,134,61,223,31,233,189,184,105,54,189,198,123,149,61,52,170,175,189,72,41,22,62,19,252,79,189,72,182,128,61,66,251,175,189,64,145,14,190,240,192,15,62,148,238,186,61,183,229,142,61,249,71,207,61,55,97,69,61,137,135,228,189,136,145,125,189,93,12,136,189,60,207,15,188,17,64,73,189,194,73,124,189,109,248,46,60,215,13,191,61,176,211,247,60,184,223,63,62,199,223,89,190,122,78,52,189,230,140,207,189,197,231,88,61,64,133,186,61,182,16,169,189,146,17,146,61,101,6,4,190,31,42,103,61,73,89,129,61,165,177,117,188,22,106,102,189,222,56,53,189,168,38,144,189,32,96,31,189,219,62,32,62,129,219,226,189,0,30,100,62,27,74,225,60,178,9,21,189,239,247,115,189,29,92,84,190,65,39,3,60,24,53,44,62,15,15,14,61,169,195,56,61,254,36,242,188,72,131,25,190,59,201,178,61,74,147,210,189,119,189,13,62,51,206,213,60,1,57,6,58,237,108,178,61,120,163,244,188,68,113,69,62,82,128,5,62,174,156,55,61,32,124,92,57,167,102,226,61,206,1,6,190,126,253,133,59,178,179,143,60,176,216,40,61,231,95,80,190,27,70,189,61,16,254,241,61,71,169,86,62,118,177,253,61,193,103,1,62,41,73,214,188,112,50,171,61,245,243,9,190,20,168,167,61,237,188,0,190,172,124,57,189,54,10,82,61,198,247,166,189,44,1,219,189,230,20,11,62,9,137,0,190,43,6,35,189,193,105,230,61,4,231,182,189,255,123,233,59,242,248,151,188,1,91,212,187,167,7,178,61,151,60,2,62,9,57,190,190,14,176,193,189,162,212,19,190,215,165,13,62,58,189,135,61,80,235,198,61,76,63,158,60,212,159,38,189,235,11,54,189,76,150,19,62,80,106,227,61,15,98,203,61,147,221,102,61,189,214,13,61,161,153,153,188,155,185,83,189,55,102,26,62,203,146,1,190,3,166,38,62,5,221,158,189,87,74,70,190,133,113,164,189,227,106,110,61,147,50,207,189,243,21,86,189,38,95,238,59,21,200,22,190,60,118,143,61,185,149,141,61,219,11,190,189,94,255,207,61,41,54,95,61,108,44,52,190,150,90,70,188,255,48,120,61,250,120,18,60,201,152,139,189,156,199,12,62,164,10,9,189,232,99,216,188,15,239,232,189,200,78,144,189,58,167,1,190,159,18,109,61,185,65,45,62,98,85,2,189,188,20,200,60,177,64,26,61,177,217,173,58,221,221,155,189,166,173,229,60,183,45,113,61,240,32,132,189,157,124,111,188,115,62,25,59,72,152,29,190,101,144,58,189,175,20,132,60,234,62,135,61,83,149,98,62,61,99,9,190,23,19,187,189,72,92,217,186,144,144,53,60,232,143,139,187,205,161,37,189,93,253,22,62,216,151,145,59,229,237,98,189,85,29,131,190,178,196,50,62,148,251,97,190,89,120,158,61,241,53,215,189,156,186,131,189,184,78,2,62,157,117,190,61,216,84,228,59,199,247,221,61,52,101,214,187,62,228,48,62,188,93,135,189,206,95,17,61,78,133,13,189,245,49,166,189,127,191,232,188,111,207,98,189,237,204,165,190,18,182,130,60,74,196,164,189,170,180,161,189,55,246,199,61,148,174,169,189,209,128,192,61,183,11,228,188,140,205,219,187,53,101,146,189,123,34,8,61,144,198,223,61,179,99,193,189,21,10,164,190,116,63,11,62,237,162,215,187,22,31,251,189,151,108,157,188,20,31,14,61,174,238,173,61,236,147,28,190,185,111,31,189,100,183,14,62,129,178,57,62,193,10,58,61,111,95,117,190,60,79,214,61,60,15,248,60,47,54,175,61,19,245,152,61,170,188,62,190,88,11,41,61,126,105,179,60,53,63,189,189,246,90,180,61,139,126,187,189,171,252,143,61,132,145,111,189,174,172,237,61,132,102,27,62,251,191,208,189,66,146,143,189,129,38,142,61,191,25,80,61,216,143,46,62,215,134,217,61,210,171,119,188,139,83,52,62,43,14,149,58,138,48,111,61,166,80,10,190,92,190,3,60,90,241,13,59,156,153,6,190,114,19,77,60,121,194,129,60,0,121,216,189,195,200,178,61,220,229,9,62,48,203,201,60,211,84,17,189,154,69,206,61,203,0,211,61,189,250,44,190,118,108,107,190,182,232,6,59,41,219,8,61,252,235,37,188,79,114,139,61,225,129,1,61,132,200,166,189,204,178,24,62,10,88,84,190,83,7,90,61,223,148,122,190,198,254,23,62,156,131,92,61,152,121,12,190,110,124,187,188,125,195,77,61,56,1,49,190,204,210,4,188,211,239,110,189,223,114,69,60,18,136,182,61,178,127,42,190,11,157,249,61,252,102,60,189,229,56,66,190,236,239,66,189,52,59,157,60,112,148,88,189,71,187,139,61,223,153,66,61,30,49,121,188,13,110,16,189,245,208,17,62,75,248,223,61,131,172,144,61,7,192,178,57,57,115,210,187,187,90,255,189,123,38,65,61,123,245,239,187,112,144,25,62,114,30,66,189,10,241,64,62,71,209,141,189,224,208,214,189,39,45,197,61,123,22,87,189,247,37,163,189,71,217,223,59,122,230,19,62,163,42,120,61,113,156,246,60,54,236,85,61,7,228,183,61,69,7,52,61,208,31,2,190,128,189,88,189,61,54,135,61,37,4,170,189,117,127,2,62,9,70,105,61,101,152,17,61,194,46,37,189,214,88,152,59,85,73,104,189,134,153,204,61,238,200,35,62,233,72,95,187,231,185,5,62,107,66,206,187,92,110,60,190,13,115,46,62,255,95,242,61,56,215,175,188,165,203,237,186,1,110,35,190,234,173,27,62,155,241,192,189,65,190,170,61,105,24,88,62,75,92,73,61,27,49,5,61,162,14,9,61,171,249,183,61,108,94,234,189,157,16,118,61,142,190,39,61,229,193,15,190,230,43,72,190,65,217,24,62,179,13,167,189,76,189,144,60,196,47,165,61,237,34,91,60,44,24,170,61,238,175,156,189,118,73,186,61,76,127,35,61,137,250,230,59,137,119,77,190,89,114,93,61,193,175,239,189,50,46,99,61,146,188,168,189,85,4,201,189,218,245,57,190,203,122,23,190,99,185,145,61,206,210,250,59,198,162,178,189,177,8,9,189,176,210,18,59,146,206,181,189,63,193,184,60,156,168,187,60,151,32,33,189,116,189,85,189,230,127,162,61,114,123,95,61,7,156,15,60,226,197,213,189,82,92,60,189,83,211,152,61,35,119,210,61,9,39,165,60,234,29,14,189,20,205,7,62,21,171,130,61,59,174,131,190,255,64,0,61,2,242,98,61,132,47,226,61,135,173,71,189,33,42,60,187,28,168,183,60,224,5,230,189,50,3,5,61,152,172,41,190,95,70,235,61,202,21,233,58,24,78,36,190,192,8,190,189,10,162,67,190,154,3,40,190,213,54,76,190,45,248,184,61,79,73,115,59,78,33,83,189,120,48,32,61,137,152,203,189,136,178,168,61,234,157,102,60,196,149,176,61,189,44,103,189,64,108,136,189,223,219,136,59,46,189,201,61,95,103,133,190,153,138,135,189,189,65,237,188,246,219,189,189,151,9,61,62,7,111,184,189,213,17,57,61,179,30,41,190,176,157,215,189,82,89,119,189,146,143,38,190,180,149,34,189,35,9,37,59,177,11,43,61,186,65,143,61,69,139,165,60,13,230,67,189,221,177,51,61,95,9,175,189,194,108,20,189,177,52,192,187,77,37,75,189,128,75,64,189,77,214,242,60,107,237,15,61,142,35,69,188,199,24,5,62,133,4,165,189,217,203,10,61,49,30,150,59,215,55,66,61,43,155,20,62,197,69,194,60,55,187,90,189,155,199,140,189,211,130,59,62,238,239,12,60,200,207,219,188,89,115,182,188,183,20,188,61,251,230,48,190,244,4,177,189,242,105,179,61,186,13,42,62,249,51,184,189,21,7,35,189,155,118,225,61,7,74,50,58,58,41,186,189,45,135,13,61,236,218,213,61,135,101,0,189,126,7,252,189,129,215,74,61,173,64,48,62,186,120,152,60,170,109,200,61,166,99,5,190,145,27,61,62,8,141,170,61,140,218,84,189,172,111,68,190,69,231,25,190,77,71,36,61,52,149,63,190,42,54,240,189,205,42,203,60,59,93,250,188,168,44,96,189,80,191,51,62,59,50,194,189,231,104,197,61,36,115,43,62,197,100,107,189,18,208,194,188,27,91,156,188,77,230,30,190,91,59,39,61,130,226,65,189,104,250,175,189,227,124,176,187,107,11,133,61,247,178,134,189,16,16,1,189,61,88,68,61,113,2,92,61,234,252,164,61,15,1,195,61,182,243,115,60,118,148,156,189,25,169,141,61,169,246,141,61,134,185,6,189,132,76,184,61,33,15,182,189,11,141,154,61,24,196,20,188,46,0,174,188,42,87,20,190,142,227,183,188,94,41,102,62,218,6,87,189,233,122,3,190,76,248,48,189,171,73,76,189,238,121,181,189,187,58,44,190,85,167,230,61,208,178,9,189,66,150,86,189,190,171,192,61,34,167,133,189,118,219,53,61,43,255,145,61,131,162,170,186,168,129,25,62,73,19,93,61,71,112,93,190,179,116,6,190,199,250,211,60,238,39,195,61,126,59,19,190,171,226,214,61,145,67,0,190,239,54,195,188,145,155,13,62,75,135,228,189,93,145,251,187,195,7,223,60,228,69,34,60,55,85,184,187,213,120,137,61,146,84,178,62,139,174,79,190,21,240,159,62,12,91,220,190,97,79,235,61,235,243,42,190,57,227,232,190,53,218,68,62,155,15,67,190,197,226,98,190,244,50,151,62,9,56,164,190,150,108,142,188,219,86,100,62,15,130,15,62,136,38,43,190,200,99,55,189,197,42,71,190,246,201,243,61,81,185,41,62,112,248,220,190,48,88,73,61,76,125,127,62,165,228,143,62,195,182,49,61,224,175,131,60,35,11,204,62,110,79,165,190,180,22,41,189,117,232,123,62,40,231,24,189,100,172,47,191,44,17,111,190,205,118,164,189,243,202,85,61,241,152,241,62,94,93,39,191,246,160,6,190,51,43,33,62,84,39,228,59,17,136,14,189,141,132,252,190,7,47,52,191,197,34,187,189,190,116,224,189,189,200,144,62,209,13,200,61,238,223,101,188,126,184,156,189,206,178,248,190,155,228,2,190,161,93,51,190,50,122,119,62,206,132,57,191,34,0,211,61,247,122,151,61,12,112,70,61,87,21,7,62,56,138,90,190,171,131,24,191,104,67,0,63,77,200,233,61,164,252,40,190,16,109,175,190,243,198,41,191,251,249,97,190,167,57,141,62,150,211,173,61,22,0,75,62,165,232,158,61,25,14,83,191,188,184,201,189,184,175,85,61,246,57,14,190,246,14,48,188,213,244,136,62,173,78,36,62,145,131,243,188,184,32,141,62,182,122,182,189,110,129,68,62,51,197,112,190,96,35,247,190,153,10,195,190,37,66,191,190,172,154,28,190,138,188,17,189,196,130,65,190,63,27,63,58,146,239,148,62,19,147,27,189,128,248,249,189,5,6,7,62,57,116,68,62,204,189,95,189,183,11,141,61,168,117,131,62,209,181,31,62,106,145,23,61,225,40,74,62,210,53,238,190,139,204,134,62,148,220,158,62,156,32,208,61,135,115,213,190,114,134,143,61,128,119,45,190,224,252,147,61,183,117,77,59,139,90,14,191,231,168,106,61,219,100,211,62,103,16,55,62,166,78,134,60,229,71,227,61,10,1,159,190,42,182,208,61,46,208,6,63,217,43,255,190,149,224,24,190,217,167,111,190,47,128,173,62,205,4,152,190,60,43,16,191,202,182,112,190,140,122,50,190,219,143,50,62,81,47,23,190,231,148,240,61,52,28,18,190,132,23,215,61,25,77,16,190,100,210,67,190,203,180,195,62,170,152,162,62,177,117,11,188,54,139,15,191,47,56,100,62,72,230,246,61,117,91,23,62,221,238,146,62,82,67,189,190,42,28,248,190,54,50,157,61,239,214,193,190,84,136,171,61,156,136,1,62,250,154,150,61,145,64,159,62,178,208,153,190,157,142,145,189,207,147,253,190,136,11,144,189,199,158,59,190,91,102,166,60,153,216,114,62,209,208,27,62,92,115,94,62,32,255,0,62,139,116,163,62,156,34,74,62,255,96,4,62,218,0,10,191,29,95,154,59,48,195,6,190,214,222,142,190,25,85,156,190,179,31,131,190,53,44,128,190,43,68,43,190,43,144,12,62,124,37,136,190,196,106,143,62,18,37,19,62,203,45,5,61,153,206,74,62,90,72,26,191,85,46,198,190,2,251,41,187,71,82,20,190,55,254,207,61,138,57,85,61,74,143,7,62,134,175,191,61,43,81,123,62,243,107,173,189,241,232,68,190,143,64,151,190,190,123,12,190,49,95,131,61,153,227,72,61,232,87,64,190,165,162,21,190,229,122,29,61,50,86,106,190,74,202,52,62,122,71,149,188,226,153,102,60,67,177,170,190,160,253,151,62,182,141,12,191,72,203,50,62,179,6,29,188,206,150,248,187,62,243,51,191,173,197,108,189,219,158,237,59,107,210,157,189,103,253,5,190,23,248,13,191,219,255,4,191,242,129,61,62,89,116,158,188,84,194,234,59,111,239,64,190,120,84,119,62,114,163,111,62,206,37,7,61,225,154,17,191,193,110,63,61,13,92,228,190,196,133,34,190,128,197,28,61,33,209,170,190,108,34,116,190,204,216,2,191,182,139,85,190,177,114,238,59,203,6,25,190,51,13,157,62,92,53,143,61,82,230,205,62,132,146,60,61,248,156,223,190,69,20,116,62,138,93,229,61,66,238,226,61,167,95,234,189,166,207,223,190,192,213,40,191,142,198,155,62,6,169,5,62,87,162,166,190,15,126,203,61,93,120,107,62,44,234,15,62,205,97,174,62,192,181,172,189,45,127,202,190,112,46,247,188,155,97,224,190,162,14,201,189,180,88,249,61,135,20,186,60,98,135,65,189,110,34,129,188,103,90,130,190,129,132,164,190,241,182,107,62,198,83,33,62,63,113,1,61,79,109,132,62,97,170,95,62,148,171,50,190,142,51,13,191,61,6,124,62,15,224,191,190,22,115,245,61,129,152,241,189,24,56,49,190,45,122,122,190,246,51,103,62,62,48,106,62,196,17,48,62,165,132,132,61,154,8,53,62,150,203,22,188,124,49,25,62,130,183,218,190,147,174,141,190,76,140,95,61,196,88,184,189,211,144,209,189,146,24,90,62,99,240,156,62,233,182,102,60,18,148,6,61,102,61,96,61,6,51,8,62,14,71,69,190,84,174,51,62,166,45,201,189,177,98,179,62,219,227,3,62,80,227,93,190,120,31,141,190,222,127,138,189,199,58,6,61,19,131,225,190,72,200,141,189,80,107,14,191,18,129,46,62,246,30,54,189,218,197,101,62,113,110,233,60,237,142,126,60,196,57,88,60,239,137,194,190,99,71,16,62,22,60,129,190,232,45,48,189,160,198,4,191,210,118,151,61,180,233,158,60,134,154,139,62,131,117,168,60,237,86,39,190,114,108,131,189,36,1,87,61,72,110,162,62,239,190,76,62,130,43,126,62,25,83,69,190,6,23,6,190,19,62,190,190,223,250,24,61,106,165,14,62,252,132,178,60,92,237,76,190,58,59,20,189,103,181,252,189,124,72,32,189,216,96,216,61,152,192,57,62,107,178,204,59,252,88,130,190,169,141,83,191,100,74,197,189,64,153,204,190,25,46,69,61,211,3,150,189,22,59,125,62,14,103,251,60,123,46,79,62,241,152,229,61,103,94,170,189,77,158,178,60,215,241,199,60,230,103,62,62,150,204,108,189,227,111,108,61,87,161,145,59,241,97,152,60,182,185,151,60,205,92,182,189,63,138,235,189,230,118,41,190,56,244,180,188,195,192,208,61,196,78,66,191,127,20,223,62,54,209,179,189,168,229,129,59,162,223,199,189,56,229,129,190,73,52,190,61,20,59,229,61,79,96,165,190,79,6,112,62,151,148,30,190,168,202,92,61,59,179,111,62,33,201,230,190,45,240,192,190,229,247,94,62,82,205,251,61,84,36,128,62,16,241,15,191,114,101,147,62,175,96,137,62,253,60,95,62,214,65,61,62,174,43,121,61,189,182,119,190,219,177,58,190,250,162,150,62,74,99,153,61,20,122,183,60,31,166,158,62,192,197,142,190,65,99,8,62,242,181,13,62,254,168,166,62,117,12,97,189,46,51,29,191,21,155,164,190,234,133,20,191,158,174,186,190,214,189,31,191,45,136,154,189,79,104,222,59,47,55,53,61,114,162,101,61,48,58,237,60,28,159,206,61,173,118,8,62,74,9,132,61,234,33,124,62,40,14,64,61,38,186,175,189,155,154,129,60,166,40,84,62,28,197,6,191,54,209,143,190,221,187,191,189,247,52,181,61,39,201,169,190,110,33,182,61,230,159,230,61,132,116,109,189,89,74,165,62,52,71,162,62,138,53,140,62,223,239,160,61,212,161,247,190,244,114,5,189,163,196,189,61,82,109,127,62,93,179,255,62,182,76,45,62,190,133,34,190,229,47,43,191,86,93,80,62,153,236,208,61,17,126,42,61,38,168,20,191,207,209,123,61,151,230,186,61,124,135,123,190,13,162,153,61,190,38,240,189,57,194,58,62,58,28,25,62,67,224,155,62,27,93,223,189,43,81,43,191,134,208,47,191,184,77,179,61,135,110,84,62,176,142,12,190,125,144,180,61,50,49,21,190,156,2,24,189,180,108,132,190,156,128,94,62,93,74,15,62,164,53,26,62,199,199,177,188,160,251,163,189,44,19,168,189,19,18,213,61,115,234,89,189,97,167,215,189,46,243,237,59,39,235,13,62,223,216,61,191,50,242,172,62,78,131,156,190,235,73,175,189,121,146,51,190,80,31,7,190,204,143,166,61,45,54,234,190,37,112,42,59,43,22,151,62,191,35,114,190,22,248,0,191,12,33,163,190,241,141,75,190,19,220,80,189,76,247,250,61,193,78,211,61,181,139,161,190,157,39,230,60,220,229,215,190,159,109,250,190,176,38,11,190,86,195,203,188,165,200,18,62,53,67,147,62,224,98,92,189,161,163,18,190,35,99,149,189,99,15,224,61,26,31,71,190,174,105,169,190,134,120,59,62,246,28,199,62,38,136,161,62,169,78,87,190,36,27,77,61,253,201,7,191,216,199,52,190,191,118,90,62,137,181,164,61,18,136,103,62,51,178,66,61,89,228,52,62,44,80,187,190,242,51,222,61,200,48,4,62,149,243,210,190,109,126,193,61,51,239,239,61,146,35,76,191,250,57,197,190,199,170,29,188,155,156,20,190,101,243,148,60,130,202,138,62,64,61,2,63,36,204,153,189,196,85,12,191,42,222,38,62,35,252,245,61,3,59,187,190,254,151,140,190,170,133,209,59,226,222,94,190,52,30,107,62,87,5,63,187,207,72,24,191,127,85,79,189,190,71,161,190,198,120,158,62,91,9,128,190,210,32,13,190,178,118,182,60,184,42,75,190,140,22,167,189,23,116,24,58,173,135,6,61,30,233,35,189,231,50,53,62,84,138,167,61,94,197,60,62,49,30,225,190,154,96,112,62,59,158,172,60,100,74,170,189,109,139,130,62,63,255,150,61,44,218,52,62,82,70,239,190,80,12,232,61,66,171,157,61,7,210,167,190,120,80,221,190,193,232,209,60,178,54,248,61,229,115,205,190,3,70,42,190,162,7,131,190,187,252,163,61,250,252,176,61,132,151,239,61,86,137,15,190,15,114,210,61,182,20,220,190,55,136,207,61,245,172,11,190,145,73,246,62,52,90,154,189,180,189,94,190,127,197,141,59,163,103,156,190,70,64,26,191,242,207,30,191,68,117,2,189,129,92,71,190,54,39,178,58,10,185,17,190,194,106,78,62,123,242,9,189,22,71,163,190,251,220,11,190,188,229,78,189,131,252,163,190,181,76,136,189,82,77,106,190,189,218,134,61,119,113,90,62,253,212,229,189,19,216,190,61,183,204,129,62,78,71,43,189,57,176,137,190,148,17,194,189,242,197,67,62,75,127,156,61,158,29,48,62,130,129,171,190,64,39,170,61,25,104,137,190,221,41,41,190,189,40,7,61,97,54,113,62,121,248,110,189,141,254,139,190,3,186,89,189,238,129,50,62,142,77,99,61,169,26,211,190,90,209,38,190,144,24,101,190,3,44,243,61,219,109,145,190,167,137,158,61,11,100,71,62,185,106,130,61,120,238,247,189,90,73,160,61,15,32,140,189,62,60,148,190,175,215,234,189,39,141,16,62,50,24,151,189,41,229,236,190,41,43,219,61,51,169,28,191,198,9,37,62,214,56,188,61,205,243,207,188,196,24,236,61,35,154,157,190,253,149,82,62,149,128,71,62,232,132,131,189,115,15,60,61,87,72,63,62,39,214,82,62,225,61,125,190,143,70,187,189,38,69,131,61,60,41,233,61,254,84,80,62,130,58,255,190,107,130,81,62,16,86,23,191,129,205,120,62,112,36,75,62,71,2,4,190,53,242,2,191,127,108,35,191,167,41,55,62,120,124,15,62,84,244,82,60,55,201,189,58,38,186,152,189,178,251,35,190,165,242,188,190,10,53,1,61,12,238,155,190,222,77,31,191,92,15,8,62,117,161,193,190,204,36,232,59,216,178,156,190,116,64,135,61,239,174,235,189,211,150,183,61,140,62,217,190,32,235,223,61,128,108,240,60,139,103,235,190,25,128,158,190,0,50,27,190,23,40,158,190,188,209,245,61,32,8,28,62,255,202,9,189,170,119,69,190,129,36,231,189,58,75,60,189,187,186,190,190,185,80,182,189,204,50,152,62,68,187,90,61,110,98,211,188,215,10,96,61,165,248,218,61,241,232,179,62,178,142,131,190,233,167,239,190,140,236,135,61,217,100,212,190,237,52,95,190,1,81,156,189,250,12,252,60,112,93,41,186,148,201,100,62,147,57,222,62,130,189,166,61,84,68,11,190,111,38,127,189,144,185,140,190,250,77,16,62,179,49,240,61,204,61,48,62,49,244,117,61,167,183,130,190,47,117,28,191,6,241,240,61,173,227,237,60,242,182,28,62,237,101,67,190,33,138,193,60,83,228,138,62,138,177,145,61,243,95,156,62,145,145,130,190,189,151,8,62,134,249,168,190,49,22,14,190,36,207,221,189,253,84,137,62,201,190,165,190,208,53,155,190,113,209,134,60,160,117,122,190,120,234,200,61,187,182,56,62,1,115,68,62,185,248,31,62,35,17,151,189,167,18,17,59,191,97,159,190,52,231,238,189,34,187,252,189,253,229,29,61,230,164,211,190,170,233,160,62,135,171,255,60,83,128,50,190,186,177,31,190,8,49,226,61,159,54,76,189,108,204,118,62,48,20,137,61,221,155,51,188,57,59,18,62,149,175,192,190,119,169,241,61,103,31,219,190,200,4,185,190,217,101,56,190,132,97,165,190,203,219,0,62,112,233,29,61,114,101,226,190,75,24,55,62,110,229,8,191,155,169,80,62,62,34,94,190,148,175,152,188,111,9,217,184,53,29,225,188,57,95,49,62,249,173,187,189,136,141,115,62,248,201,16,62,166,18,76,62,164,137,28,62,178,156,116,61,49,27,171,61,54,177,214,190,169,65,127,190,96,49,233,188,83,234,50,62,145,15,105,190,71,232,39,61,220,68,42,60,86,68,122,61,62,127,22,190,36,114,43,62,254,99,150,190,150,153,220,187,69,94,71,191,134,42,140,61,167,193,224,61,222,93,16,191,44,153,88,190,123,196,187,189,97,148,152,188,177,235,1,190,219,61,147,62,74,196,198,188,0,175,33,190,98,72,171,189,94,241,27,62,71,149,76,188,68,106,33,62,123,26,44,188,77,149,144,190,83,125,149,62,1,76,158,188,113,109,103,189,184,93,50,62,75,19,154,189,67,77,34,62,115,130,43,62,163,245,203,61,114,102,217,62,178,41,250,190,187,175,197,189,41,42,4,62,233,30,100,62,177,222,156,62,138,64,21,187,217,83,23,62,13,217,150,190,142,205,155,62,28,110,160,189,36,176,82,62,158,108,116,188,128,128,158,190,138,157,173,189,100,255,169,190,12,58,33,190,11,186,45,189,235,54,141,61,185,231,147,62,181,30,182,62,58,193,142,62,101,75,136,190,140,236,89,62,100,191,22,62,176,36,192,189,181,73,249,190,67,113,241,61,85,59,202,62,5,176,76,62,99,85,41,61,191,197,109,190,40,127,137,189,56,52,75,62,7,151,249,189,120,252,8,61,146,11,4,62,229,119,183,61,241,150,49,190,54,204,158,189,138,105,153,62,162,227,63,62,116,196,17,191,174,248,113,61,30,207,132,189,231,210,241,189,53,196,254,60,11,254,143,62,42,203,109,190,223,248,255,189,104,143,150,190,199,43,163,189,197,17,31,62,224,223,68,190,183,121,147,190,194,34,226,61,15,98,184,61,62,130,179,190,9,21,55,60,157,218,24,62,31,173,234,190,52,77,191,189,228,164,226,190,8,133,66,61,251,29,96,62,230,212,129,62,187,185,140,190,88,11,170,190,11,113,200,190,157,166,191,188,144,216,59,188,81,165,162,62,15,75,61,61,200,55,193,190,194,112,149,190,196,25,108,190,1,235,51,191,198,44,2,191,210,7,155,61,27,4,6,190,31,34,73,190,225,226,212,61,244,212,32,191,251,4,223,190,131,139,155,190,0,253,168,61,210,97,88,188,58,22,149,61,173,93,16,191,23,116,180,190,205,112,162,61,68,164,167,190,165,180,163,62,211,243,171,190,158,253,179,187,111,184,54,187,94,12,147,62,95,96,13,62,224,119,53,60,173,45,65,61,164,185,82,62,106,218,23,189,240,58,46,61,165,17,198,61,157,244,42,191,12,200,21,62,93,194,156,189,155,49,163,61,251,124,169,189,67,78,63,62,104,23,7,61,142,219,196,190,5,248,64,61,132,112,193,188,70,185,147,189,53,24,211,190,107,150,52,62,158,116,113,189,12,234,145,62,170,251,75,62,12,194,49,61,81,96,47,189,34,117,195,189,81,113,241,60,138,36,138,62,85,48,145,62,136,154,122,189,9,34,246,60,47,108,12,191,250,114,131,190,51,179,197,190,0,127,253,61,97,119,151,62,66,69,60,62,141,93,167,61,99,47,78,190,200,181,75,59,222,2,44,61,148,164,251,189,60,225,210,188,241,81,118,61,218,233,253,189,87,84,224,189,12,243,135,61,93,153,49,190,3,25,4,191,176,99,233,188,77,124,61,189,126,19,20,62,250,89,139,62,40,131,30,62,225,158,235,190,110,106,5,190,35,138,10,61,159,229,140,62,139,18,175,190,113,150,234,188,206,155,42,190,131,56,57,61,235,137,219,61,200,245,15,191,70,152,175,189,174,154,163,61,3,194,3,190,244,239,1,190,44,63,163,62,145,103,152,62,231,15,228,61,147,77,20,62,219,11,158,190,89,198,224,62,34,248,7,190,1,212,42,189,206,242,8,61,218,86,115,60,26,249,152,60,41,247,152,189,33,254,175,61,102,144,162,189,242,185,121,61,195,149,123,62,98,26,56,62,97,10,168,62,139,78,0,62,86,59,183,62,146,224,198,190,10,16,16,62,196,88,35,190,52,116,54,62,221,57,188,190,245,183,130,189,191,125,37,190,49,83,8,190,20,144,175,190,15,101,17,189,139,247,194,62,79,162,27,190,156,194,5,191,30,191,228,188,109,97,24,62,157,101,27,61,189,201,1,62,78,95,4,191,190,130,233,61,146,96,243,189,211,140,13,190,239,65,213,189,90,17,131,62,151,8,165,61,177,15,214,187,27,160,140,62,28,69,196,61,129,191,166,190,35,208,7,191,159,166,185,61,103,64,137,59,131,196,157,61,104,139,99,190,79,23,155,190,253,146,221,190,64,22,104,62,173,63,201,189,80,119,119,190,120,206,48,189,79,223,104,190,59,143,151,62,240,242,95,59,141,252,149,62,32,101,58,190,11,29,105,190,47,2,245,190,235,253,161,190,101,70,110,62,214,151,249,190,102,165,63,190,36,208,138,190,58,58,160,61,81,76,20,62,69,148,125,190,64,56,139,62,195,207,80,62,98,19,188,190,211,237,51,189,77,173,227,190,138,15,214,189,212,203,207,188,130,170,240,189,158,209,250,60,134,87,236,189,75,83,42,190,28,83,29,62,14,221,147,190,188,65,32,190,137,237,99,189,110,140,81,190,254,161,10,62,79,80,85,190,222,109,231,190,94,176,244,61,139,52,53,190,237,66,56,62,99,29,8,62,177,55,230,190,221,99,131,190,197,58,146,189,195,92,81,62,93,139,11,190,97,207,3,62,158,234,183,190,132,196,134,190,43,94,30,62,241,109,131,190,48,10,18,62,210,210,68,62,172,181,82,190,105,218,189,189,85,215,73,62,212,216,115,189,188,37,156,62,55,175,183,59,157,11,141,62,233,0,224,188,37,14,152,189,133,92,149,188,93,231,26,60,223,250,43,61,116,246,195,189,85,122,130,62,105,8,187,190,88,244,166,190,155,143,38,189,223,97,133,62,229,168,155,62,78,19,76,189,169,239,253,190,184,104,130,189,230,20,183,60,223,141,146,187,70,109,37,62,228,1,85,190,248,89,189,190,16,171,27,191,251,99,138,61,115,91,29,62,129,246,220,189,208,58,101,62,205,154,147,60,137,182,214,189,155,129,49,61,104,243,159,190,172,19,174,61,34,204,64,60,223,18,24,62,134,48,202,190,64,130,119,190,252,22,41,61,29,8,23,62,4,68,232,189,254,198,169,189,252,199,53,188,23,194,2,191,9,19,26,190,106,109,74,190,2,153,39,61,4,205,141,61,171,100,142,61,249,52,143,188,31,161,209,189,59,160,130,61,96,244,25,190,172,243,22,61,81,70,173,189,193,208,8,59,170,235,23,190,142,75,83,62,63,139,145,189,157,140,91,62,162,154,148,61,203,183,209,190,47,94,251,190,71,185,184,61,162,16,38,62,243,232,200,190,12,206,245,60,241,194,14,190,150,10,38,189,185,224,50,190,147,172,154,62,232,98,164,61,66,90,19,190,116,219,162,190,29,145,91,62,251,108,159,190,52,61,197,189,64,236,196,61,238,171,227,188,134,140,98,61,33,198,135,190,154,63,38,190,107,251,158,190,203,199,251,60,178,9,62,62,216,9,133,62,95,33,106,61,243,144,83,190,221,48,166,60,7,224,106,61,225,242,2,189,35,166,237,189,209,193,221,61,94,246,246,60,38,174,67,61,96,251,169,61,89,185,11,190,49,203,127,190,73,247,138,62,127,227,48,62,228,2,27,190,68,170,43,190,24,155,162,62,180,104,177,61,120,91,159,190,105,39,201,188,100,217,28,61,13,249,26,