{"meta":{"epsilon":0.030847467482089996},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,22],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[207,247,165,61,60,211,225,61,20,161,41,191,59,204,178,190,75,17,69,62,49,139,77,62,108,143,183,190,24,199,136,62,213,128,1,191,36,227,7,189,41,150,76,62,195,124,139,62,90,163,23,191,90,196,23,190,184,67,48,186,179,21,149,61,8,121,252,190,119,44,237,62,166,65,99,62,181,3,143,62,149,14,60,62,36,200,231,189,49,56,161,62,230,66,166,190,37,215,240,62,198,43,123,191,50,150,111,191,255,187,58,191,27,244,211,190,64,167,160,62,60,74,255,62,98,165,203,61,10,110,112,62,246,67,62,189,141,253,3,61,43,91,29,63,69,141,1,62,30,211,43,61,184,70,193,188,54,178,19,190,196,206,142,61,194,205,250,189,199,185,227,190,99,127,143,190,97,70,228,62,89,155,4,191,208,35,52,191,237,216,77,190,60,222,171,190,104,99,152,189,109,105,230,189,197,208,134,190,67,63,165,61,26,192,59,62,239,164,139,191,41,165,122,61,99,214,188,190,60,56,58,187,96,212,1,63,208,130,158,189,193,180,142,190,71,98,215,62,184,27,152,61,248,50,153,62,58,136,243,189,57,130,220,62,149,236,240,62,238,254,73,190,137,201,40,190,253,167,4,62,107,190,224,190,132,182,75,60,86,15,86,190,3,53,42,191,215,66,232,189,213,238,200,190,229,82,128,190,225,59,151,190,77,27,234,62,136,241,162,62,254,216,146,62,244,22,234,62,71,249,60,62,72,115,249,190,197,198,28,191,114,148,12,62,119,182,219,62,35,11,16,190,5,36,128,62,46,137,140,190,50,25,208,62,113,201,7,190,18,63,27,189,182,175,38,62,141,211,127,189,1,200,107,62,51,213,142,62,184,51,143,190,31,55,123,191,215,138,199,62,25,177,82,62,91,40,80,190,63,141,10,63,146,50,225,62,27,129,224,190,30,184,133,188,215,41,129,61,90,223,79,59,229,187,187,62,20,79,72,190,204,167,182,190,203,129,136,190,23,203,105,191,216,230,134,188,223,143,138,190,208,180,106,62,88,142,229,190,124,68,130,62,29,26,167,62,90,108,160,60,71,204,37,63,75,88,133,62,160,212,157,62,240,43,180,188,16,160,156,190,23,197,188,62,84,68,87,190,68,60,176,62,8,71,86,62,67,22,214,190,189,56,26,189,194,17,240,188,150,81,151,61,242,134,23,62,89,180,12,63,186,153,58,62,248,107,219,189,248,31,86,62,207,70,169,62,50,136,142,62,220,84,231,61,160,68,191,190,164,138,159,190,58,88,254,62,8,150,224,62,201,155,38,188,224,73,162,190,26,194,137,190,248,83,172,190,63,78,216,188,218,240,6,191,65,224,110,62,198,151,21,62,252,86,138,62,211,111,13,63,87,221,176,62,197,164,27,62,201,174,121,190,105,134,246,62,57,87,99,62,26,73,112,62,217,214,231,190,168,68,123,190,194,157,109,191,22,130,22,63,129,245,85,191,41,226,220,190,36,78,199,62,27,30,152,62,42,24,148,189,59,152,2,62,157,109,136,62,203,152,176,61,16,121,169,62,27,102,169,189,22,91,164,190,233,0,39,63,128,214,169,62,93,40,48,191,126,120,221,62,206,92,54,190,53,246,35,191,135,195,64,62,131,158,20,190,23,79,134,190,67,90,111,62,101,202,230,59,122,141,35,62,189,146,29,191,168,244,156,190,85,19,43,191,82,244,16,191,196,234,247,190,214,96,179,189,9,60,173,62,109,96,175,190,132,80,211,189,112,4,49,62,137,220,30,191,189,202,200,190,197,228,199,62,103,180,174,62,246,62,66,191,65,58,205,62,81,85,239,189,84,110,187,190,85,184,15,63,210,143,182,62,228,50,226,61,249,62,74,61,68,81,36,63,103,75,17,63,224,101,200,190,26,75,226,62,207,77,149,62,28,58,112,191,147,255,242,62,107,131,248,62,222,56,55,63,179,167,96,191,38,235,21,191,133,224,5,63,147,17,107,190,226,214,186,62,193,183,251,190,123,22,91,190,84,60,232,190,42,53,46,190,203,163,20,191,180,243,47,190,38,67,208,61,34,20,103,190,131,212,95,62,149,95,67,191,190,214,40,63,245,142,6,62,181,208,33,191,207,234,225,62,32,12,96,61,128,237,171,61,235,97,127,61,13,164,180,62,139,150,236,58,44,225,72,191,146,122,54,62,247,110,85,191,144,43,207,190,247,197,250,62,143,106,115,62,87,113,170,190,252,252,73,62,231,69,109,190,113,169,189,62,229,250,219,190,66,9,51,191,107,124,196,189,239,255,100,190,120,38,44,63,235,156,208,62,131,255,22,62,156,113,102,191,223,25,137,62,235,92,83,60,143,241,5,191,46,210,25,191,103,172,149,62,65,110,225,62,184,92,211,61,147,188,154,61,249,119,170,189,231,4,224,62,134,114,61,63,80,71,167,190,141,113,148,189,100,31,60,62,67,35,150,62,80,234,9,188,149,24,96,190,148,141,184,190,23,169,84,190,11,18,242,62,251,216,218,189,213,99,174,62,228,14,100,190,209,160,164,190,18,223,247,189,241,173,161,62,24,76,44,63,67,112,18,63,235,38,24,190,109,241,139,190,184,23,32,189,130,236,244,188,73,135,120,61,143,34,13,191,19,254,40,63,124,248,12,62,97,0,18,190,33,233,4,189,114,0,22,190,34,229,139,62,8,100,220,190,187,115,197,60,226,173,99,191,209,243,140,189,200,208,210,190,221,242,137,190,74,146,77,190,231,109,59,62,92,72,181,187,94,207,3,62,179,86,23,63,192,247,74,191,40,182,249,190,75,59,147,62,102,74,220,190,168,147,19,189,131,200,140,190,27,43,50,63,184,212,161,60,119,241,141,191,132,109,171,62,199,110,187,190,62,69,130,59,254,155,96,190,109,174,138,61,198,82,132,188,96,236,169,62,179,7,114,190,79,108,2,191,113,134,151,62,158,173,249,190,114,228,169,188,211,133,226,189,253,192,170,60,173,52,39,191,190,65,86,191,146,2,174,62,42,228,212,190,226,71,93,61,245,221,178,189,72,145,169,190,150,39,226,62,57,68,188,188,25,179,8,189,53,92,216,61,13,232,192,61,230,81,83,61,59,67,129,62,48,10,127,190,167,45,13,63,163,80,54,63,99,141,237,62,92,113,73,62,17,210,186,190,34,38,239,188,130,135,37,191,243,129,148,60,32,174,154,62,58,26,30,190,71,183,178,61,80,50,39,62,41,157,134,62,165,215,244,189,25,167,250,62,172,199,216,189,130,227,250,190,33,255,64,191,121,58,183,188,108,139,5,190,200,173,178,62,0,177,200,190,92,218,208,190,28,223,81,61,162,163,72,189,4,190,56,189,52,117,231,189,123,71,20,62,35,78,11,191,78,53,220,61,64,94,123,62,254,125,131,62,82,56,245,62,60,73,70,62,221,250,20,190,38,180,25,190,204,232,140,61,123,174,235,190,34,170,49,63,153,211,12,190,17,8,197,62,159,116,188,190,129,214,73,61,96,251,128,189,36,138,164,190,81,41,155,189,169,138,63,63,172,143,250,189,18,135,179,189,185,57,206,190,171,84,153,62,125,46,39,191,12,54,224,190,163,91,231,188,164,161,99,190,195,152,32,191,233,189,150,62,93,221,47,191,104,108,234,188,9,252,5,190,84,24,197,190,60,249,163,62,26,239,219,62,75,242,84,62,121,198,85,62,51,245,148,62,46,251,9,63,193,208,218,190,49,219,199,187,242,189,106,190,242,253,121,190,160,172,139,62,45,87,91,61,192,29,9,189,230,20,94,189,130,107,35,191,113,218,233,61,24,79,92,191,64,41,182,61,90,58,238,189,58,203,201,190,104,252,238,190,50,165,24,190,29,155,40,61,97,175,133,190,254,35,151,62,141,23,84,190,21,32,182,190,148,125,172,189,98,24,193,62,6,192,207,190,70,255,209,190,170,195,236,190,80,120,75,190,115,183,212,62,41,21,157,190,231,87,67,189,250,86,64,62,252,69,71,190,170,176,168,62,5,82,42,62,2,93,15,60,113,172,65,63,110,94,120,190,158,41,163,190,79,2,110,190,70,83,166,190,183,194,0,63,110,217,92,190,117,110,251,189,10,76,72,62,70,106,197,190,81,176,215,190,86,178,201,61,254,174,97,191,191,13,250,189,84,217,239,190,250,104,255,62,189,8,185,189,79,215,35,190,245,110,213,62,227,66,52,62,220,65,13,191,90,242,168,190,31,120,190,190,212,119,54,62,52,155,1,190,185,200,158,62,248,105,200,61,220,213,164,190,36,140,96,62,184,152,253,61,216,22,210,190,8,235,227,189,217,251,13,62,138,103,39,190,125,83,154,190,150,175,185,189,183,102,105,190,110,129,171,189,253,197,24,189,178,108,57,62,12,185,23,190,247,131,200,190,37,108,195,190,43,184,0,63,47,136,72,191,104,191,196,62,145,111,27,190,63,255,77,62,147,58,23,63,22,174,171,62,98,71,153,190,82,254,243,190,220,1,117,62,106,73,88,191,8,66,95,189,26,5,227,190,13,121,82,191,82,252,215,62,200,252,86,190,114,61,14,63,247,231,195,59,242,218,9,191,98,38,228,62,177,22,117,62,249,35,236,62,35,82,65,190,94,234,244,62,117,32,24,63,89,209,199,189,181,48,68,191,162,138,203,61,254,4,226,62,237,179,165,62,15,184,243,190,11,50,117,191,248,73,60,62,72,117,16,191,160,15,129,190,249,0,125,61,38,78,226,62,9,181,52,191,195,250,71,190,61,136,90,190,178,33,99,61,216,210,186,62,164,102,93,62,34,60,202,62,82,172,27,190,183,98,100,190,218,9,80,189,1,236,24,62,119,4,169,190,181,106,41,191,100,36,182,62,203,204,52,63,126,131,49,62,234,84,131,190,21,135,23,61,6,78,130,188,253,21,15,191,0,71,42,191,232,153,30,61,104,147,149,190,30,67,56,191,22,87,253,189,17,189,252,190,12,212,94,61,227,91,30,189,158,253,174,190,145,143,190,62,41,103,73,63,204,251,223,189,225,201,199,189,15,217,186,62,84,103,180,189,94,200,219,190,240,225,194,190,153,46,165,62,57,222,234,61,228,186,235,189,75,0,144,60,39,254,207,61,24,128,25,191,145,192,25,62,125,174,89,61,85,88,188,189,57,159,200,190,107,52,165,189,185,164,102,62,31,223,212,62,210,213,31,190,22,155,66,62,234,20,144,62,123,45,158,190,153,133,11,191,234,224,206,190,4,166,232,189,122,74,151,190,53,101,243,188,251,148,5,188,61,237,2,63,154,19,244,62,221,55,66,63,18,48,54,190,250,67,155,190,49,94,201,62,148,250,14,191,98,239,11,63,62,134,139,189,7,141,66,190,162,161,161,62,214,147,34,62,25,40,79,190,200,167,16,61,93,130,27,191,91,69,135,190,222,80,130,190,55,16,12,190,238,251,54,188,92,14,168,190,26,70,22,63,217,99,214,61,31,26,140,189,60,173,156,188,143,35,232,190,69,32,205,62,39,124,60,191,221,32,195,190,129,15,41,63,163,162,232,60,76,232,159,61,205,145,17,63,131,28,193,59,18,218,58,189,124,225,31,61,156,206,207,190,140,195,232,60,84,153,149,190,130,124,209,61,198,168,204,190,210,186,167,190,209,140,203,189,253,115,154,62,222,225,178,62,184,211,138,190,77,65,214,62,171,133,58,191,207,217,53,189,28,166,132,190,6,192,207,190,172,133,39,60,186,204,230,190,248,143,185,190,193,78,250,62,49,77,161,61,77,247,229,190,107,62,41,59,149,174,21,190,31,152,82,62,183,56,99,62,91,141,242,190,48,31,156,62,181,14,69,190,239,216,6,190,208,19,248,190,89,189,68,61,236,201,251,190,163,48,115,60,230,242,157,189,39,162,4,63,52,140,223,62,235,32,51,63,178,57,159,62,60,252,250,62,34,141,142,190,232,197,172,190,153,205,46,62,198,234,242,62,254,28,143,190,58,198,63,62,144,45,17,63,124,173,224,62,12,130,153,190,50,2,147,189,30,247,187,188,214,165,13,62,84,94,220,60,0,89,82,191,171,104,160,61,31,209,179,190,199,94,229,190,10,110,20,63,177,208,156,62,240,108,204,62,204,96,89,191,235,210,76,190,203,80,206,190,83,128,148,188,185,12,19,190,165,22,224,62,125,71,250,190,244,29,131,60,49,21,201,189,94,88,158,62,143,192,125,62,131,77,22,191,165,17,66,189,231,168,84,62,197,9,195,62,23,22,189,190,31,158,100,190,5,238,192,190,49,152,80,61,125,200,174,190,64,185,37,189,216,65,19,63,11,219,211,190,77,242,129,189,101,48,96,61,91,150,237,187,216,102,31,63,233,144,244,61,185,142,111,62,122,65,193,62,204,255,255,189,185,35,30,191,189,41,26,62,22,215,249,190,116,76,196,62,91,123,203,61,245,135,223,190,177,224,176,190,103,17,193,189,149,29,153,190,219,220,97,191,107,74,52,62,196,164,205,190,104,210,160,190,92,23,216,190,118,79,109,62,74,86,196,190,1,192,148,62,250,14,194,62,58,21,26,191,2,184,2,61,2,70,149,189,93,86,17,191,102,255,96,62,140,82,29,62,180,41,130,62,160,78,74,63,106,149,9,62,58,38,209,62,130,2,117,62,96,218,110,190,177,118,34,62,3,211,11,62,107,112,175,190,3,215,20,62,88,91,113,190,143,100,0,63,8,139,178,60,37,121,73,62,218,132,187,61,183,152,141,190,8,220,131,62,199,212,168,189,95,170,234,60,200,229,132,190,146,220,64,62,241,32,87,189,29,220,129,190,234,191,125,62,61,192,103,191,119,2,29,190,211,106,44,191,46,11,242,187,70,192,57,188,73,172,111,62,169,106,15,191,203,251,220,61,88,115,19,190,40,118,90,190,113,230,13,190,85,41,85,189,140,195,110,62,93,185,55,189,167,71,62,62,156,24,114,190,174,127,199,188,60,178,247,60,139,4,36,190,101,69,56,62,192,116,250,62,141,114,101,190,9,142,48,188,192,184,56,190,237,67,19,62,174,91,136,62,55,102,61,190,37,73,74,62,195,154,190,190,219,152,148,62,229,67,141,190,6,70,159,61,98,99,38,190,209,68,196,61,187,199,76,61,182,154,154,60,27,150,71,190,80,227,119,62,18,189,0,62,167,107,23,188,92,82,8,190,181,117,31,61,19,180,227,60,133,175,227,61,27,91,77,62,186,27,231,189,27,141,5,188,184,158,7,62,78,200,134,62,39,155,148,190,176,202,24,190,159,155,26,62,147,39,33,190,244,73,246,189,224,153,57,62,88,111,47,190,71,82,148,62,88,241,177,190,135,223,166,189,160,168,132,190,161,158,166,62,118,114,173,60,190,231,130,59,97,0,147,190,44,209,24,189,227,181,52,62,113,182,149,62,72,86,21,62,117,1,145,60,133,231,140,190,99,56,143,190,97,232,56,61,146,127,131,189,54,209,232,190,147,176,75,190,81,162,143,188,115,67,130,189,78,213,160,189,228,201,181,190,154,186,18,190,196,95,136,190,123,205,234,62,181,149,151,189,144,61,85,62,99,211,142,62,202,29,88,190,72,255,196,190,84,209,165,190,74,205,65,190,59,43,59,190,146,40,11,191,142,97,218,62,140,119,71,62,253,150,152,61,151,119,194,62,216,172,156,62,216,60,52,61,165,60,205,61,94,153,137,59,144,223,67,190,203,144,131,190,72,217,160,190,205,236,161,62,58,130,63,62,240,122,0,190,0,240,16,191,250,184,66,62,36,79,15,190,173,117,162,189,118,238,161,189,39,13,166,61,144,87,30,190,20,180,182,58,113,59,22,62,142,151,16,189,25,48,208,190,204,130,106,189,108,120,48,190,111,1,17,190,193,201,233,189,165,134,243,61,24,4,1,62,233,122,34,190,180,20,99,190,77,116,199,189,236,185,127,189,110,178,97,189,66,86,67,189,33,153,12,62,33,157,177,189,137,44,184,190,151,110,20,62,220,127,229,189,101,195,213,189,146,56,122,61,159,191,178,60,206,153,136,190,175,29,111,60,246,181,57,62,140,116,153,62,247,130,250,188,96,163,185,61,15,79,88,61,107,38,135,188,74,51,101,62,68,202,155,190,1,35,147,61,126,185,100,190,226,118,13,190,116,191,186,61,1,65,143,62,90,84,158,61,140,15,80,61,73,113,71,190,153,155,197,189,162,128,30,190,226,34,214,61,79,175,183,61,46,108,29,190,111,128,65,61,29,223,182,60,251,91,46,190,48,141,230,61,127,228,2,62,145,169,135,190,61,58,18,60,120,122,81,190,223,225,197,190,94,182,139,62,94,54,3,190,120,109,196,62,182,117,231,190,100,99,156,190,93,168,129,189,72,109,83,62,82,185,196,62,145,254,56,190,195,164,208,61,167,69,0,62,41,62,37,190,134,43,178,62,76,54,131,61,186,21,10,62,171,155,149,189,242,197,34,190,231,58,99,62,247,231,71,61,129,224,2,61,222,53,136,186,197,27,144,62,134,188,35,62,112,152,21,61,237,238,2,61,77,0,148,190,68,51,88,189,192,66,201,189,7,34,161,190,80,53,150,62,117,36,80,60,255,61,151,61,59,82,250,62,31,89,42,191,220,231,188,189,176,209,6,190,177,154,107,61,89,34,5,190,97,90,251,61,223,77,204,60,35,238,169,190,237,161,161,62,196,12,191,62,137,252,174,188,121,13,72,188,18,42,231,189,26,161,9,63,43,135,60,190,242,58,115,62,65,252,117,190,85,185,55,190,107,214,145,62,26,11,153,61,126,174,204,190,8,48,45,189,183,29,53,62,45,58,50,62,251,237,5,62,250,246,38,190,227,64,0,62,43,115,78,62,166,180,75,188,88,77,3,189,242,181,24,190,222,107,0,190,31,13,83,62,111,5,243,188,186,84,165,189,74,42,60,188,38,131,124,62,225,188,40,62,168,73,190,186,140,125,125,62,39,224,141,62,129,147,10,62,99,81,255,61,142,212,19,188,143,210,94,61,117,206,179,190,240,148,171,190,246,41,14,62,84,72,18,190,237,66,243,189,69,31,37,190,41,56,126,62,78,113,107,61,0,51,159,189,17,232,98,189,141,181,215,60,80,103,201,190,231,83,227,61,129,176,240,61,35,120,155,62,221,46,163,189,125,228,249,189,228,208,74,60,51,156,180,189,184,35,170,61,103,110,46,190,230,190,137,190,22,155,157,61,199,21,224,189,8,185,68,190,41,232,155,61,166,21,72,190,125,206,76,62,99,86,153,190,49,12,131,190,76,129,216,189,61,200,28,189,142,103,102,61,88,37,221,61,200,109,116,189,99,82,150,188,198,222,19,190,199,143,70,190,186,187,22,62,134,145,80,190,122,34,142,61,124,198,9,61,25,238,136,189,214,139,14,62,55,3,149,62,0,107,33,62,224,49,63,62,75,11,61,190,47,169,232,61,78,49,78,62,223,203,228,61,250,61,210,190,39,22,102,62,16,68,55,62,115,58,161,189,177,73,132,190,71,38,196,61,167,153,6,189,72,136,134,190,149,2,20,62,245,207,81,190,163,69,91,189,242,179,12,62,180,231,1,189,204,225,16,62,20,186,130,61,88,142,36,188,4,2,38,189,165,117,145,62,179,24,52,190,247,69,161,61,114,23,253,189,147,187,150,189,3,75,82,190,45,250,104,188,46,190,106,61,31,202,186,61,201,172,205,190,133,126,59,190,54,151,117,190,92,69,64,62,109,100,187,189,145,121,194,190,58,54,235,61,105,64,239,190,162,53,249,190,198,28,24,190,242,57,114,61,187,206,120,61,244,84,123,190,204,14,143,188,255,222,27,62,245,220,189,189,206,120,99,190,95,37,183,189,184,112,139,60,61,80,196,61,77,168,113,61,85,29,199,190,84,253,16,62,20,161,45,62,19,20,149,190,80,240,189,61,89,15,153,61,65,26,158,62,79,222,0,62,48,0,73,190,127,72,115,188,219,118,66,62,121,206,94,61,155,148,62,62,42,93,133,62,68,85,165,187,74,250,192,188,69,218,18,62,173,52,158,189,114,81,82,190,102,141,57,61,228,150,169,188,9,37,238,188,251,62,3,61,157,144,7,190,33,56,159,61,228,146,124,189,17,102,52,190,146,132,195,60,175,225,172,189,129,143,206,62,35,172,154,189,163,132,107,190,190,192,41,60,120,106,3,188,68,106,36,189,96,187,226,188,86,45,77,190,46,248,227,187,253,189,70,62,168,75,177,61,111,87,34,61,63,172,244,61,46,229,120,62,28,97,7,62,170,220,11,62,250,184,52,60,51,68,237,189,70,187,126,59,171,96,189,61,142,102,80,190,20,166,74,188,105,119,100,189,5,190,239,60,26,104,155,60,194,227,149,190,105,72,95,189,227,252,19,190,32,227,109,188,90,131,99,190,98,114,192,60,128,51,182,189,25,9,103,190,52,50,19,190,158,96,179,61,155,129,160,190,46,68,74,62,249,77,100,189,201,103,156,190,238,44,5,62,46,188,45,62,251,100,23,62,251,204,206,61,183,241,7,61,129,131,72,60,14,33,122,60,199,221,202,61,181,199,189,62,82,9,160,190,212,121,10,62,181,211,106,188,90,36,138,60,165,95,24,62,237,247,26,190,5,32,192,61,101,77,215,61,42,234,14,189,197,205,224,190,135,11,199,61,56,205,108,189,74,175,193,60,74,75,180,189,144,155,214,59,132,181,232,190,211,156,145,62,163,243,20,189,71,80,183,189,68,233,114,61,105,83,59,61,184,252,12,62,204,7,3,188,67,229,9,62,6,250,128,62,164,127,145,190,211,136,119,188,28,173,75,190,157,21,34,62,141,222,205,61,1,17,202,189,195,149,139,189,104,27,184,187,132,244,39,190,252,110,86,62,2,147,39,61,211,80,120,62,90,21,30,190,79,173,226,61,225,252,237,61,39,253,207,61,40,60,92,62,92,186,5,61,137,114,165,61,223,193,140,188,80,227,239,61,122,154,17,191,235,73,168,60,25,149,6,62,87,210,109,190,41,96,234,189,138,187,25,190,217,152,201,61,22,85,6,62,166,161,37,190,187,190,195,62,132,106,18,62,227,111,68,61,125,18,94,190,194,252,147,190,106,43,6,62,70,209,79,190,19,167,32,62,0,64,5,62,64,70,160,190,63,130,19,190,116,175,14,189,157,63,207,189,2,88,175,190,138,91,199,60,103,75,13,62,103,188,82,62,53,164,153,61,163,233,51,62,145,82,5,61,219,110,140,189,148,46,31,62,233,190,165,62,79,43,136,190,103,66,170,188,121,114,94,59,162,19,120,61,221,225,109,62,123,28,49,61,24,35,34,62,33,71,60,190,231,19,91,61,142,198,136,189,57,232,178,189,81,104,196,61,106,235,239,190,233,22,18,62,224,235,101,186,51,12,74,62,121,21,109,61,51,57,201,189,243,72,208,61,211,86,101,189,199,191,217,61,240,121,136,190,44,156,235,61,35,140,139,62,232,69,23,62,5,78,135,190,159,153,45,191,50,5,146,190,78,102,131,62,140,176,105,190,107,242,227,189,19,145,240,189,204,225,169,190,78,132,37,190,23,129,196,61,65,108,233,61,239,2,189,62,199,131,98,60,50,67,30,190,21,249,182,189,121,218,154,188,173,87,213,59,11,159,9,190,197,237,253,61,48,211,119,188,80,221,104,190,110,58,135,190,67,207,141,190,125,84,175,190,31,170,36,190,6,187,191,61,182,39,199,61,49,238,155,62,173,247,167,61,10,254,189,61,102,241,109,190,21,88,19,190,178,171,100,190,247,166,182,189,153,101,217,190,128,60,137,190,36,248,49,190,245,41,156,187,68,195,118,61,157,21,17,62,200,54,46,62,220,115,65,188,213,189,186,189,170,175,95,190,73,169,86,60,195,184,47,61,240,20,138,61,168,72,250,60,20,10,192,62,77,69,33,62,125,80,51,59,148,82,50,61,137,1,122,62,187,57,179,189,28,68,128,190,136,80,43,190,77,127,35,60,50,251,220,60,104,130,43,62,216,161,130,190,156,53,23,189,224,151,255,188,0,24,62,190,133,147,133,61,49,111,242,189,36,70,183,190,90,53,147,60,171,98,93,60,39,35,126,62,24,210,125,190,44,143,186,61,212,181,94,188,117,167,49,61,19,91,204,62,158,249,109,62,135,138,3,62,123,109,153,62,35,188,213,189,206,167,215,187,238,104,2,191,249,111,235,188,39,131,114,190,186,36,17,62,227,152,65,62,87,212,27,189,202,88,247,190,34,20,5,190,129,149,230,189,57,112,43,187,92,209,155,59,9,14,68,190,9,143,84,62,158,20,30,190,164,156,246,189,89,160,92,190,76,108,17,190,235,14,57,61,86,114,98,190,246,67,33,60,41,78,144,188,226,210,177,190,38,110,123,61,67,154,99,62,235,154,140,60,108,48,64,61,57,70,129,189,245,250,69,60,244,133,136,188,110,114,139,189,186,98,82,57,28,210,52,59,231,208,215,61,250,223,152,190,151,105,131,190,230,70,108,62,134,14,130,190,66,82,18,189,179,198,232,59,50,75,64,62,252,114,29,62,42,91,190,62,121,207,71,61,170,13,138,189,91,49,36,189,15,156,43,188,221,252,97,190,251,135,138,190,5,94,11,61,172,81,128,62,68,113,149,62,47,62,147,190,194,6,140,190,223,223,40,191,12,175,78,60,89,167,83,62,91,184,21,191,112,155,115,189,126,41,136,190,179,200,26,190,98,173,41,62,252,205,49,62,236,165,17,62,10,9,149,62,221,39,134,190,182,56,172,61,14,178,86,61,84,253,106,62,17,5,63,61,150,228,56,62,199,74,53,190,13,94,47,187,125,23,188,189,117,92,49,61,159,230,32,190,195,164,34,62,102,155,13,190,218,199,151,187,51,190,200,188,168,183,194,190,71,241,184,62,197,105,121,62,0,190,221,62,135,177,145,62,67,8,36,190,185,117,61,62,81,103,235,61,179,9,179,188,227,142,249,189,91,223,26,190,104,143,141,190,203,205,124,61,26,200,239,189,4,80,250,60,95,138,190,61,110,164,113,62,66,157,204,189,158,149,44,190,234,115,150,61,72,24,8,189,126,24,248,61,174,177,8,190,200,227,92,62,190,224,122,188,91,40,134,61,251,79,3,61,118,144,200,190,164,156,192,62,122,97,14,188,153,15,156,189,89,112,75,61,107,245,58,61,94,249,209,190,8,9,250,188,72,98,139,60,154,51,168,60,49,161,41,190,114,179,89,60,236,3,45,190,22,174,119,190,97,122,160,61,86,140,56,190,6,249,235,61,197,207,194,190,138,201,23,187,179,246,216,188,214,207,135,62,122,247,241,188,124,231,140,189,140,44,75,61,238,217,131,61,25,216,154,189,116,55,160,190,65,250,1,190,23,223,129,61,59,203,167,188,78,26,160,62,181,71,144,189,49,42,16,190,83,234,110,61,98,227,189,61,57,236,47,62,168,244,183,189,143,199,44,189,128,95,119,61,246,179,70,62,235,221,18,190,152,17,49,190,132,66,223,60,172,198,145,190,156,101,174,189,44,63,102,61,10,85,183,60,42,100,145,62,71,205,65,62,137,123,207,61,20,135,14,189,146,190,254,60,129,191,193,189,61,41,255,60,88,186,195,190,38,1,25,60,136,220,42,190,39,87,45,189,10,138,197,188,124,165,88,190,158,91,73,190,99,130,156,188,240,137,122,189,37,153,148,62,171,63,43,191,192,168,120,190,31,246,162,62,13,174,230,190,200,143,133,190,39,225,6,63,247,121,178,61,153,49,169,62,23,21,58,191,107,133,1,62,105,24,189,190,76,90,25,188,193,38,211,62,205,233,51,190,172,114,82,61,18,150,183,62,112,100,33,191,246,222,217,189,32,106,14,189,185,107,201,188,105,231,82,62,210,117,20,62,204,59,52,62,66,173,195,62,19,113,160,62,155,105,171,62,142,44,52,62,98,128,69,190,249,108,85,62,148,184,37,191,7,154,33,61,20,89,48,188,246,19,222,61,46,233,31,191,38,231,111,61,217,226,56,62,5,44,5,62,234,151,166,62,144,240,11,191,205,62,113,62,143,197,247,61,106,186,154,61,172,49,185,189,214,143,25,189,147,137,62,191,204,101,67,62,37,85,138,189,32,32,134,62,107,147,38,191,188,22,149,62,124,223,56,62,235,22,165,62,61,50,84,190,155,227,33,62,110,43,58,62,142,180,70,190,171,222,71,188,54,221,14,62,201,16,41,62,128,202,242,190,76,79,150,191,126,186,149,189,72,34,220,190,108,1,208,190,90,112,129,190,34,174,115,62,210,77,105,62,166,198,136,190,71,252,177,190,173,154,233,190,114,10,207,190,221,119,114,189,118,77,1,62,237,235,41,190,56,112,22,62,36,219,90,62,46,237,140,61,227,163,150,62,70,93,149,190,194,26,152,189,61,149,42,191,93,5,148,62,141,220,142,61,40,208,38,190,169,240,49,62,187,197,80,191,125,47,57,191,125,101,107,61,138,182,252,188,234,255,39,60,49,48,186,188,243,33,182,61,237,115,234,189,245,215,89,190,223,24,56,191,173,93,213,189,187,18,50,61,123,102,129,191,44,62,172,190,95,172,138,190,154,217,80,62,41,127,91,62,171,138,182,60,181,139,236,189,241,172,91,191,212,10,146,62,108,22,140,62,233,34,221,189,67,93,97,61,252,24,104,62,222,84,193,190,59,200,154,189,138,206,143,62,255,130,41,62,29,215,170,190,115,196,49,191,203,188,89,62,23,65,213,188,166,43,3,191,74,131,185,61,59,174,81,62,89,78,227,190,249,89,118,62,154,108,135,188,84,123,23,191,167,165,6,190,162,225,158,61,97,116,158,61,62,243,55,62,238,245,144,188,85,32,102,191,2,229,241,190,233,222,192,61,54,204,83,190,169,204,168,189,5,195,222,189,88,88,168,190,177,196,62,61,90,5,34,191,88,219,8,191,168,46,0,189,110,146,8,62,69,216,69,62,221,230,139,62,161,243,13,191,47,152,54,59,206,94,212,189,135,87,94,191,197,252,123,61,6,106,193,190,139,184,48,61,215,117,24,191,186,52,216,190,11,50,220,62,136,134,233,61,133,17,57,191,29,228,204,190,123,125,91,62,80,49,3,62,216,150,194,187,52,109,132,61,180,49,211,190,162,65,245,190,205,243,49,191,111,66,52,61,98,25,210,189,235,52,165,62,44,40,88,186,66,197,129,62,128,169,194,62,162,178,149,190,201,191,127,61,0,195,168,190,136,1,148,62,191,63,132,61,25,117,189,62,31,84,95,190,33,47,82,61,47,10,243,59,93,178,71,62,32,164,205,62,124,56,122,190,233,89,214,62,157,28,13,190,45,193,16,190,190,170,24,191,150,199,35,191,81,74,111,60,44,116,5,191,29,149,167,189,132,35,148,61,159,27,13,62,79,180,78,189,103,13,25,191,163,196,93,61,79,28,123,62,87,113,67,62,137,197,69,62,57,114,47,62,131,203,120,62,233,69,185,62,162,167,16,62,66,182,181,190,59,116,132,190,157,73,94,62,142,5,160,61,27,114,111,62,117,110,41,62,114,38,164,62,130,100,94,190,159,195,172,62,245,225,91,61,220,173,75,190,136,247,71,62,102,105,47,191,97,121,4,191,242,202,115,62,243,124,222,62,76,19,121,60,135,73,54,189,1,66,146,189,65,222,26,191,229,20,7,191,109,222,113,62,28,151,214,61,176,58,36,190,248,127,177,190,132,159,136,62,178,3,104,62,38,153,187,61,46,194,2,63,3,141,176,62,194,173,110,62,33,33,174,61,153,24,244,190,206,29,163,62,101,232,55,190,0,51,21,191,5,42,5,191,226,207,243,190,121,191,67,190,117,132,41,191,214,188,181,61,29,197,131,62,210,65,37,61,101,23,24,63,190,114,139,190,13,168,96,62,211,130,16,61,191,238,250,60,29,227,31,190,20,179,4,191,165,57,122,60,53,113,158,62,94,149,111,62,27,76,82,191,157,187,133,62,130,32,18,62,155,16,54,191,148,222,154,61,147,10,0,191,87,196,67,191,252,139,165,62,40,143,167,189,98,94,202,62,156,245,151,190,98,119,223,62,189,112,135,62,106,106,56,191,199,216,41,61,21,104,149,188,11,185,96,191,65,226,20,189,250,196,129,62,183,25,52,191,157,249,86,61,11,145,88,190,232,19,22,62,218,163,121,189,110,163,53,190,144,64,129,190,138,152,255,190,42,42,149,187,19,173,237,62,2,112,199,189,58,150,143,190,186,31,199,62,16,101,30,62,187,137,13,191,100,124,95,62,247,234,207,189,118,232,54,190,168,109,33,190,108,83,64,62,7,40,165,62,127,32,65,62,110,104,147,61,134,208,143,62,27,0,57,190,42,237,183,61,21,25,147,62,194,70,244,189,141,49,65,186,47,196,201,190,22,168,11,190,138,70,225,61,69,158,24,62,184,79,147,190,57,129,144,62,230,133,62,62,32,93,216,61,232,203,8,190,65,167,10,62,19,118,212,61,33,38,89,190,132,171,183,61,231,99,91,62,162,58,251,189,207,65,151,190,13,105,164,190,14,147,177,62,144,235,35,190,224,55,136,62,187,122,130,190,162,29,125,190,69,18,152,62,13,141,144,190,147,32,191,62,85,251,112,61,159,176,72,60,8,237,212,190,201,44,93,62,40,3,32,191,11,117,122,60,185,152,140,62,199,27,250,61,254,2,45,191,156,192,142,189,118,116,181,188,53,77,167,190,134,169,214,62,178,11,159,61,105,66,67,62,236,11,136,62,242,184,146,190,11,12,168,189,196,110,187,189,12,26,31,61,85,135,110,191,165,222,71,191,123,108,54,62,106,135,118,189,176,170,180,190,122,178,183,62,1,97,5,191,73,58,59,62,124,105,142,190,216,50,72,62,14,207,193,62,52,93,142,62,132,128,35,191,249,53,128,190,184,68,143,61,221,167,19,62,187,96,148,60,160,12,238,62,121,207,112,62,111,207,186,189,233,218,197,189,169,62,85,191,9,209,104,62,34,89,38,61,213,165,219,61,93,68,194,61,79,50,7,62,71,155,134,189,15,155,252,190,141,20,38,190,177,146,15,191,111,165,228,61,241,225,40,191,145,174,176,190,200,62,10,190,72,110,17,190,28,228,56,62,188,43,110,190,49,159,178,62,229,234,230,62,35,225,98,61,35,44,129,62,214,38,37,62,9,194,44,62,247,196,26,190,184,231,65,61,145,96,69,191,8,239,114,62,63,120,69,62,132,62,10,191,139,19,19,191,16,224,135,189,114,253,171,61,101,167,152,187,92,212,33,188,114,244,99,191,147,121,56,186,198,29,243,62,187,223,71,190,126,180,207,62,211,43,96,62,35,215,64,190,210,225,130,190,123,81,136,62,128,236,205,62,157,45,8,190,73,60,56,190,137,141,51,62,47,55,166,190,42,12,125,62,101,102,186,190,120,8,89,62,66,44,215,62,68,53,111,62,172,64,65,62,148,228,138,188,222,160,212,190,225,185,166,62,144,161,48,62,23,70,95,189,244,96,255,61,146,68,228,61,59,193,84,191,170,39,168,190,183,30,215,62,176,225,6,61,148,231,129,189,62,164,97,62,196,161,91,190,215,55,162,62,235,159,193,190,112,49,190,62,166,222,58,190,247,11,61,62,187,28,186,62,106,111,44,188,140,101,184,62,156,167,49,190,163,100,170,187,37,16,150,62,76,138,245,60,135,4,148,190,250,43,103,62,252,69,2,191,171,177,213,189,70,222,85,62,58,62,65,191,57,46,128,61,61,29,70,191,25,2,232,187,139,113,104,62,185,146,135,189,226,11,146,190,142,84,70,191,218,13,24,191,147,221,145,61,110,66,131,191,185,64,132,190,114,38,237,61,55,72,74,60,129,49,82,191,71,41,72,191,121,9,88,62,179,184,248,61,18,60,41,61,109,75,43,191,104,21,20,61,1,212,220,61,210,4,53,191,225,211,33,62,20,52,15,62,151,79,146,190,13,39,238,59,85,76,179,62,189,87,33,62,15,177,171,61,129,91,89,191,119,28,247,189,228,23,205,190,91,77,33,191,141,138,203,190,89,99,129,189,1,22,252,61,208,82,89,190,167,6,15,190,224,113,19,191,140,17,12,63,97,123,34,62,180,98,101,191,37,203,83,62,199,13,68,191,167,8,155,190,190,250,129,62,109,90,50,191,62,206,137,62,165,173,162,62,196,56,99,191,241,8,144,189,10,2,132,190,169,107,6,63,71,137,77,62,65,227,147,61,2,39,134,190,198,53,82,191,200,157,29,191,0,100,167,190,152,216,217,190,255,65,39,62,20,158,231,62,186,36,34,191,165,35,1,62,156,249,241,190,2,68,136,190,51,156,189,62,210,41,46,191,139,89,216,189,49,110,143,191,207,178,133,62,219,52,175,61,133,174,147,62,186,190,213,61,208,85,185,61,43,168,154,62,23,183,109,61,202,164,210,62,158,102,3,62,179,87,35,62,131,250,167,62,70,76,136,62,182,111,70,62,80,236,144,188,210,41,243,190,14,5,188,189,219,74,201,62,63,39,30,191,169,246,67,190,32,191,72,191,235,119,153,61,199,18,196,189,35,210,196,60,227,210,22,191,65,235,102,191,214,218,212,61,54,86,98,188,246,215,40,188,14,139,68,190,203,18,103,62,103,118,210,61,67,175,164,189,57,101,204,190,204,166,50,61,162,25,213,190,12,22,32,62,137,25,64,62,212,43,150,190,174,207,242,61,166,79,14,62,222,151,66,62,47,145,73,62,73,215,203,190,119,190,129,189,43,0,250,61,244,137,244,61,91,204,195,62,201,136,190,62,110,49,35,62,242,142,157,62,105,128,136,62,175,154,114,190,101,113,80,62,69,109,168,190,48,232,23,62,71,44,145,188,120,200,117,60,162,14,114,62,163,92,91,189,146,178,206,62,175,196,107,62,123,108,178,61,84,120,234,189,251,99,14,62,13,25,226,189,81,17,190,62,57,191,60,190,214,86,208,62,224,245,157,61,240,19,141,62,173,2,48,62,106,137,138,190,137,252,255,190,20,123,22,191,199,180,91,189,115,182,244,61,75,114,180,189,5,175,53,191,172,239,43,191,84,0,132,62,73,163,216,189,209,252,245,60,114,222,147,190,189,44,172,62,49,140,133,190,154,201,165,61,234,15,237,190,185,55,219,189,253,103,15,191,6,228,171,190,168,153,177,62,221,156,73,62,92,234,157,62,225,76,171,61,182,2,254,190,216,132,44,61,237,8,82,191,134,60,199,190,78,178,74,61,108,56,100,60,222,191,190,61,49,180,192,61,203,17,140,189,184,244,75,190,199,53,170,61,133,151,251,190,215,175,243,61,172,37,136,191,23,44,226,62,209,130,240,61,226,125,219,61,31,108,37,191,102,126,173,189,69,34,142,62,16,192,72,62,226,52,91,191,74,158,120,189,81,248,86,62,112,109,78,191,26,175,62,62,59,89,23,191,229,148,154,190,156,151,253,189,60,73,185,61,244,32,220,59,61,65,249,62,123,226,161,61,47,209,22,62,226,47,37,62,208,205,108,191,208,145,225,189,174,204,236,188,240,51,187,189,197,12,66,189,124,151,244,62,128,192,163,189,64,71,214,189,150,72,191,189,93,251,133,189,228,32,146,191,166,218,5,191,72,64,38,188,82,129,255,188,23,242,69,190,219,25,32,62,189,189,176,189,96,63,106,191,90,119,39,62,127,33,99,189,226,213,8,63,125,155,184,190,61,75,24,191,48,180,150,190,15,242,35,190,79,238,133,189,198,180,161,61,96,168,105,191,87,38,5,191,29,94,152,61,38,82,56,188,188,55,252,58,145,127,140,62,49,87,153,190,119,184,169,190,187,151,5,189,193,244,100,62,51,6,254,61,57,160,150,190,166,249,209,189,174,218,118,61,142,192,136,191,58,173,173,61,128,123,58,61,46,161,190,190,126,86,108,62,16,69,169,190,115,249,157,190,196,241,84,188,191,87,28,188,213,7,9,190,254,233,250,61,83,178,226,189,251,12,200,62,162,1,15,62,88,177,251,187,16,79,175,189,132,161,65,61,77,33,241,61,201,34,64,189,186,50,62,62,138,63,114,61,46,142,152,61,70,206,49,189,242,133,53,191,125,128,144,61,219,218,151,62,219,131,139,62,10,32,52,62,227,180,163,190,64,155,217,62,91,236,166,62,203,241,89,191,152,18,49,191,61,227,0,190,91,188,108,62,156,9,18,62,153,38,29,190,211,125,140,62,168,167,8,62,154,100,93,191,86,74,196,189,8,175,7,62,26,48,67,62,206,246,247,190,177,155,246,60,173,168,32,191,235,144,211,61,199,58,240,190,28,45,174,61,192,176,69,62,185,151,57,190,50,254,169,61,134,37,98,62,125,129,236,62,128,30,99,190,252,21,138,190,244,207,22,191,129,137,110,62,141,152,86,191,151,14,176,62,203,46,86,62,104,58,66,190,46,112,30,190,105,18,170,62,23,78,46,191,138,37,25,62,203,241,171,61,79,171,203,190,146,94,11,191,28,230,67,190,208,25,96,191,69,71,214,189,103,144,161,62,76,234,4,62,218,241,178,188,76,252,197,62,214,119,5,60,90,234,16,191,155,76,37,62,99,202,167,190,235,215,131,62,219,144,8,191,102,60,52,188,210,38,188,189,116,29,153,62,188,12,62,60,40,35,16,187,206,106,4,190,30,81,205,190,212,42,186,60,48,253,170,190,17,7,205,61,133,82,239,61,105,221,68,191,16,160,206,190,73,159,169,60,156,87,16,191,48,198,191,190,217,242,188,189,72,9,212,61,6,134,121,190,197,148,95,190,122,176,179,61,223,174,44,189,187,146,166,62,244,221,18,62,89,24,10,62,1,122,83,190,221,75,51,62,37,38,164,62,143,205,227,190,65,223,0,191,133,125,204,190,234,57,180,60,40,76,62,62,205,51,8,191,140,217,31,62,235,141,177,62,71,252,118,62,7,65,77,62,108,116,17,62,234,30,140,61,40,239,64,190,200,77,60,61,8,238,46,189,66,254,72,190,155,160,112,191,134,205,14,190,158,231,110,62,112,185,26,61,63,183,129,190,62,202,151,189,107,181,8,191,43,42,79,191,154,85,115,61,129,246,149,62,226,192,91,189,66,43,135,62,49,74,64,190,205,213,155,188,12,50,136,190,52,73,160,62,230,168,92,61,130,206,160,61,121,30,139,62,218,30,57,191,35,41,103,189,62,82,110,62,215,239,30,190,132,51,236,188,15,118,97,190,118,13,167,190,93,14,89,189,82,63,138,62,138,168,142,190,50,169,92,190,107,184,141,62,40,188,254,190,140,233,182,62,183,104,98,62,3,93,4,62,103,190,177,189,60,6,225,61,247,80,44,62,181,44,164,190,158,5,173,62,182,74,165,62,99,109,174,189,141,165,204,62,116,71,231,61,172,144,150,62,120,227,248,62,14,238,234,62,99,148,72,61,220,223,184,190,114,148,228,190,86,192,130,190,198,65,218,62,28,119,64,190,50,106,201,61,92,88,41,62,193,252,228,60,7,195,78,191,86,162,205,62,106,77,38,189,73,79,102,189,38,90,132,190,71,209,34,62,161,2,199,62,233,30,23,189,78,207,12,61,125,25,68,62,112,57,119,191,203,177,255,61,27,61,61,189,157,7,56,62,109,208,53,190,217,82,14,63,92,95,64,62,158,131,103,190,204,13,182,188,254,255,92,62,235,22,172,61,110,100,124,191,202,114,150,189,220,199,31,62,183,193,108,61,4,221,119,62,68,227,170,61,191,194,169,62,147,96,45,62,8,111,208,190,62,165,158,61,206,61,208,61,68,211,63,190,196,44,202,188,172,23,161,190,167,151,96,61,2,236,187,60,116,91,35,62,199,32,160,188,216,137,196,61,117,28,62,191,117,193,112,62,16,65,72,61,43,235,130,62,75,249,149,190,176,197,142,189,221,68,150,61,61,12,58,191,252,158,170,190,250,5,95,61,138,106,150,62,55,184,22,62,194,21,93,62,39,47,194,190,245,186,163,62,13,226,50,60,163,187,54,190,123,223,180,190,231,233,67,62,96,153,32,61,96,149,36,191,150,83,180,62,75,254,138,61,12,129,91,62,178,6,8,190,16,209,202,190,56,59,247,190,97,152,81,62,133,94,47,189,196,190,7,62,137,120,173,61,178,19,141,62,209,250,32,60,93,148,189,61,32,114,84,61,253,252,51,62,5,226,157,61,140,211,164,62,222,232,113,190,35,136,183,62,202,7,234,62,169,246,99,61,182,172,201,190,218,1,168,189,53,247,147,62,30,75,92,191,9,151,156,190,142,112,40,62,66,232,227,61,141,181,12,61,171,73,145,190,241,254,6,189,174,140,99,188,145,91,72,62,235,140,115,62,120,171,39,191,136,204,167,62,24,166,83,62,121,54,217,188,40,193,16,191,121,47,94,62,3,153,190,190,34,235,239,62,253,235,208,60,67,27,1,191,164,117,153,62,228,31,162,62,101,184,238,189,136,82,242,190,74,28,2,62,2,168,132,62,255,0,57,190,84,142,220,60,219,203,185,62,31,125,101,190,123,70,61,62,85,168,204,188,234,110,244,62,209,233,3,191,217,211,102,62,165,62,197,189,80,203,159,190,223,211,164,190,177,129,6,191,193,177,96,62,213,3,129,62,79,130,34,191,221,234,55,191,42,153,226,62,96,95,23,191,34,50,213,189,200,135,41,62,173,19,2,63,10,156,231,190,77,249,17,191,215,219,110,62,71,65,48,191,210,200,22,191,151,108,19,191,120,211,15,62,192,255,46,189,213,245,154,62,21,228,140,191,82,195,82,62,77,115,108,191,191,246,182,190,5,232,178,59,185,20,93,189,175,223,13,62,210,64,42,190,170,192,246,61,37,80,148,190,141,45,31,62,226,219,175,62,72,91,152,60,32,190,77,190,28,97,126,190,176,19,33,191,107,60,14,61,234,127,9,189,25,246,98,189,158,209,128,62,41,250,45,189,70,172,176,61,181,199,198,61,49,176,248,189,230,26,209,61,51,218,78,190,193,55,183,61,232,97,238,189,165,49,10,61,146,11,175,188,85,143,29,62,16,116,198,188,108,220,152,190,69,216,117,187,169,141,182,61,168,150,178,190,253,53,81,190,132,197,52,190,205,136,73,62,135,44,84,60,12,143,248,61,11,156,70,190,114,30,252,61,207,233,190,59,159,227,129,62,70,165,175,61,11,76,134,189,227,228,138,186,122,210,67,62,30,44,34,61,30,51,171,61,45,23,16,62,3,157,91,190,145,56,75,62,204,118,62,62,53,191,0,191,71,128,15,190,61,146,133,189,46,69,130,60,41,126,186,189,76,245,138,188,171,60,2,191,210,206,33,191,214,38,144,189,223,24,239,61,117,237,154,61,107,88,207,61,232,104,57,62,46,225,133,62,65,36,204,189,61,244,8,60,21,149,120,61,55,162,54,62,90,98,105,191,241,55,138,62,226,1,67,59,41,8,33,62,149,75,87,190,110,164,248,61,168,242,145,62,183,179,12,60,37,95,2,188,33,200,0,61,156,238,199,190,203,39,174,61,210,104,158,189,111,159,224,189,93,211,245,189,103,188,22,62,156,162,159,190,124,211,7,62,4,34,8,191,50,153,204,189,174,26,28,62,37,60,250,189,88,249,25,190,126,192,186,62,156,208,145,189,126,43,73,190,2,172,3,190,236,69,88,189,226,47,98,62,248,242,126,190,110,164,211,61,139,139,98,190,110,57,23,189,113,10,140,190,54,245,105,62,193,11,29,62,214,29,154,190,69,163,80,60,197,135,58,61,162,92,139,61,211,3,30,62,110,194,79,190,180,134,46,62,232,218,244,188,168,172,86,190,250,246,73,190,95,208,69,190,51,233,229,190,193,84,73,190,6,152,149,188,166,11,49,60,111,142,66,191,226,44,120,60,164,81,206,190,9,117,108,62,100,23,249,60,94,184,140,190,85,17,129,61,191,71,211,190,109,28,61,190,6,16,217,62,44,22,194,189,162,239,248,61,87,18,151,190,105,100,18,190,238,211,158,62,243,200,147,189,246,124,112,62,88,25,247,190,196,227,21,61,4,79,254,189,41,199,69,62,0,80,19,62,173,130,94,190,68,138,195,190,26,223,154,60,147,87,216,61,78,204,70,191,7,41,108,61,3,204,18,62,255,13,176,62,214,118,174,61,236,40,9,62,43,187,77,190,167,117,179,61,65,82,107,189,242,192,11,62,175,184,89,62,208,99,140,190,27,189,86,190,251,159,51,61,44,63,136,62,70,201,1,62,98,73,62,61,51,210,159,62,224,159,26,61,92,169,253,61,107,229,39,61,21,11,223,190,202,179,186,60,111,32,62,191,5,0,62,190,114,171,238,189,21,41,211,61,242,20,225,61,16,117,109,62,166,31,80,189,71,62,69,191,120,154,163,189,165,202,46,188,196,231,148,189,172,93,55,188,93,128,179,190,212,191,29,190,122,144,125,189,187,117,220,62,69,73,144,61,196,119,10,191,154,122,38,62,8,118,9,62,147,52,194,189,80,183,36,62,168,229,30,189,95,32,233,189,89,55,14,191,204,90,25,190,38,72,84,62,204,214,209,61,113,137,216,61,249,130,163,61,9,15,235,188,54,214,171,61,88,124,245,61,237,187,186,188,203,45,89,190,175,65,142,62,179,3,200,61,49,169,94,190,192,48,10,190,50,184,182,189,224,215,31,190,58,233,67,59,80,169,3,187,23,66,50,190,66,228,249,189,126,1,181,60,6,76,127,62,176,123,48,61,226,72,139,190,96,77,162,189,120,253,150,189,33,143,232,58,57,210,233,189,202,35,201,62,95,199,201,188,179,12,212,61,80,206,46,62,169,190,199,186,89,112,39,62,102,253,114,61,197,12,194,188,33,93,142,61,144,122,191,189,56,177,198,61,246,227,226,188,71,231,28,191,37,19,38,62,207,19,181,59,15,4,88,62,90,215,173,188,1,184,129,190,131,21,219,188,171,160,12,191,30,113,115,190,26,10,29,190,49,1,246,188,198,230,107,190,183,115,135,190,228,240,9,190,191,144,152,188,105,170,238,190,73,230,74,62,78,249,84,190,200,195,32,62,47,181,196,62,200,151,85,189,159,63,197,189,50,46,206,61,20,110,1,61,182,20,139,62,88,39,132,61,30,224,185,190,36,251,32,62,36,178,46,62,217,79,42,62,98,54,74,189,26,94,173,187,151,96,246,189,182,117,165,62,192,160,77,62,16,120,153,189,203,233,68,62,216,96,214,61,0,69,34,188,122,42,133,189,31,253,221,189,216,182,169,60,22,44,227,61,197,171,17,62,9,50,218,190,97,210,58,190,234,46,195,189,126,103,107,190,251,124,33,62,116,200,127,61,190,93,204,190,36,212,134,189,134,230,110,61,46,27,231,189,227,22,175,188,84,29,191,61,41,207,221,189,181,104,118,190,104,206,69,191,25,22,205,188,187,126,179,189,145,216,159,189,20,223,55,62,31,120,244,188,117,252,157,62,5,188,43,189,13,36,121,189,143,92,189,61,159,196,70,62,204,21,151,189,42,105,23,62,0,173,185,189,22,195,211,189,27,28,119,190,151,82,62,190,127,249,6,62,136,242,105,190,59,63,204,61,2,250,255,190,147,86,58,61,32,3,25,61,48,232,87,191,135,184,228,190,150,26,93,60,134,217,241,189,117,55,138,190,133,57,36,62,229,172,78,190,204,25,127,190,88,226,237,190,201,55,90,61,246,98,103,191,163,144,75,190,113,163,134,189,132,82,42,62,48,248,152,61,92,94,230,61,234,90,161,190,204,193,159,61,37,97,23,190,102,105,135,61,106,212,49,190,91,67,96,190,254,47,154,61,99,21,71,61,59,203,67,62,206,2,159,62,1,254,19,62,112,102,128,190,53,2,17,191,215,210,234,61,203,179,130,62,71,6,43,62,135,169,214,59,62,161,237,190,162,135,24,62,159,38,35,190,82,109,48,62,125,210,39,190,46,54,6,189,172,229,1,190,120,124,141,189,143,165,163,60,229,222,144,60,26,56,59,191,60,181,143,61,97,248,36,61,132,109,112,187,53,206,10,190,136,172,131,190,19,72,240,189,79,31,5,62,233,54,76,62,157,21,163,190,206,242,75,189,125,101,135,189,179,90,236,189,55,112,19,62,238,222,119,190,110,99,141,62,157,188,14,190,231,174,218,190,224,140,137,62,2,94,226,61,196,179,215,190,193,96,128,187,54,194,29,190,90,177,171,60,148,221,89,62,231,28,42,191,4,110,161,62,251,118,8,191,92,71,64,62,83,75,229,58,161,232,252,190,163,202,226,189,101,91,109,61,27,195,212,189,139,55,22,191,210,254,207,61,147,18,190,59,2,167,22,62,45,78,84,62,41,10,143,62,77,165,39,189,39,137,162,189,231,77,193,62,235,166,35,62,22,53,118,189,65,62,248,188,58,248,127,61,159,25,214,59,220,134,32,189,31,60,189,189,240,182,41,62,110,244,155,188,217,64,23,62,30,244,209,185,72,200,13,189,11,122,4,191,71,209,82,189,177,221,150,62,87,205,176,190,251,143,15,62,96,202,20,62,197,12,72,190,105,4,195,61,116,222,230,62,163,83,77,62,92,120,93,62,149,251,126,62,78,135,173,62,40,143,150,188,7,168,136,190,116,229,120,188,215,98,228,59,162,198,214,189,179,14,218,60,14,30,227,190,236,55,3,62,197,108,150,61,158,35,22,188,34,41,202,61,21,144,19,62,17,246,119,190,92,139,91,190,187,176,70,190,22,3,3,191,142,106,220,190,27,97,190,61,51,52,124,61,243,52,29,62,58,71,244,190,39,15,188,61,72,106,136,189,225,128,251,189,122,207,186,189,168,208,103,189,165,42,44,190,99,121,161,190,4,146,243,189,98,130,4,190,252,74,213,61,238,56,54,62,102,137,207,61,40,24,9,60,3,93,31,190,9,165,18,189,94,15,91,62,149,249,156,59,107,210,173,60,101,57,225,187,44,62,100,62,121,171,7,62,32,101,102,61,40,45,144,62,181,164,82,190,96,97,222,60,93,42,31,62,9,249,197,61,74,3,132,62,37,167,96,60,216,210,68,190,252,9,224,189,202,229,41,191,179,58,106,59,164,10,62,61,2,40,77,61,186,156,86,62,126,183,47,62,64,168,131,190,213,115,205,60,192,148,135,189,27,203,183,57,60,52,192,61,222,8,228,60,188,224,176,60,175,241,15,62,65,194,181,62,48,21,164,62,153,40,179,61,70,163,68,190,85,55,194,190,194,113,85,191,170,128,94,61,30,99,189,188,199,201,9,190,114,57,150,62,192,180,106,62,52,10,77,62,181,209,175,62,209,42,201,190,7,236,254,61,76,122,204,60,123,206,249,61,97,154,159,190,114,103,197,61,152,194,111,62,7,31,21,188,237,122,170,57,92,8,61,61,10,82,59,190,148,7,50,191,26,27,132,62,250,91,224,61,54,6,39,62,96,128,208,189,247,253,243,60,6,21,160,189,148,13,77,189,53,148,95,190,169,25,137,62,144,159,143,190,235,15,160,62,149,182,35,190,15,117,36,191,255,116,150,189,156,29,178,189,35,3,36,61,11,77,159,190,176,129,93,61,198,228,251,188,203,100,1,190,148,173,129,61,192,124,29,62,110,71,42,62,3,175,7,189,251,147,107,62,221,19,170,61,229,234,119,190,5,27,2,191,12,245,185,189,236,29,128,61,234,122,209,61,27,36,78,191,211,203,96,190,8,194,137,60,141,33,105,62,99,95,248,188,125,17,74,60,179,123,201,189,80,119,168,61,77,23,96,61,75,49,26,190,112,201,244,190,59,88,81,62,112,163,92,62,241,15,244,61,42,237,88,189,7,244,3,190,40,185,199,60,101,217,20,62,235,231,106,188,221,100,0,62,44,184,104,190,122,251,66,189,214,201,194,62,12,105,90,188,73,156,50,191,142,123,91,188,248,123,153,62,197,54,189,61,48,33,44,190,73,182,241,61,141,129,102,62,49,34,216,188,145,150,68,190,155,151,119,60,245,99,51,62,33,100,49,190,152,77,47,189,57,61,212,61,17,49,79,189,212,20,8,191,238,96,14,190,16,155,110,190,211,248,245,190,57,25,92,189,11,86,144,61,140,121,21,189,102,39,47,62,207,169,197,189,111,246,45,190,0,114,217,189,117,10,5,190,142,252,157,61,250,248,185,61,239,22,73,61,134,117,157,60,187,106,218,190,35,251,202,190,141,71,171,189,199,21,17,62,238,159,51,190,253,111,39,190,61,219,10,62,246,97,15,62,114,76,75,190,139,126,125,189,87,198,110,61,185,205,254,190,221,116,86,191,227,125,21,61,174,77,168,62,215,66,20,62,76,55,228,190,234,52,74,191,38,88,217,61,19,107,33,190,219,190,153,61,170,217,44,189,235,199,190,62,209,16,229,189,163,93,38,62,211,209,70,62,194,220,222,189,8,223,1,62,134,188,243,61,147,17,57,189,65,156,117,189,110,43,153,62,223,81,192,189,22,212,164,189,63,240,149,189,21,92,38,61,169,124,238,190,75,13,23,190,241,74,107,191,190,154,133,61,31,19,117,190,129,60,132,62,195,140,38,190,9,189,175,61,22,80,138,57,58,246,194,61,212,64,3,190,78,34,13,189,154,27,137,190,242,101,74,61,138,168,112,62,95,246,123,187,162,33,16,62,19,217,91,190,132,88,211,62,170,60,74,191,211,156,28,62,248,108,210,60,208,142,43,62,196,97,24,62,149,125,46,191,42,119,198,61,165,26,247,189,112,27,177,62,150,171,3,191,61,186,165,188,116,197,172,190,107,104,152,190,138,221,63,62,50,207,40,60,73,11,46,190,122,37,131,189,81,120,239,190,120,38,125,190,74,78,128,189,76,51,175,61,85,208,10,191,32,22,197,190,185,111,75,190,8,237,251,61,105,180,233,61,128,0,131,189,214,136,2,62,176,233,34,62,2,15,63,190,44,233,145,62,147,139,40,62,243,38,157,61,66,0,15,189,69,218,148,61,149,129,153,62,170,23,250,60,16,20,241,188,184,247,154,190,142,248,18,62,126,56,225,62,47,110,115,188,229,12,133,62,224,140,29,62,222,168,134,62,249,82,14,62,151,85,49,191,145,185,30,189,109,254,81,190,105,74,88,60,58,116,189,189,78,22,172,62,235,3,95,62,59,216,161,62,129,28,153,61,191,141,90,189,134,234,252,188,60,226,68,62,174,76,216,61,255,157,0,190,55,44,85,191,34,55,46,189,30,228,4,190,92,182,38,190,39,101,91,190,29,202,54,62,236,66,24,190,173,84,149,190,40,165,42,60,86,187,69,189,135,24,76,62,50,145,161,189,192,216,86,189,96,129,139,61,139,118,2,189,34,161,249,61,197,247,182,190,90,143,48,189,13,160,237,188,101,145,192,188,38,79,142,189,214,141,69,189,81,108,229,189,6,146,54,190,33,179,146,61,34,207,205,60,38,234,153,190,217,221,187,190,52,76,45,62,218,193,107,189,168,5,32,190,85,229,157,189,82,250,84,62,124,80,38,62,30,163,45,190,151,82,166,190,201,24,121,190,159,91,144,189,118,130,220,189,123,94,140,61,254,23,106,190,161,204,15,191,24,241,26,62,83,111,208,190,178,40,5,62,233,23,115,190,247,45,80,190,12,188,186,188,37,99,114,190,22,132,123,62,146,47,130,188,220,29,36,62,49,230,154,61,151,228,0,62,23,156,103,190,192,142,139,190,89,1,126,188,104,198,164,188,53,175,110,188,200,150,221,61,125,181,163,61,41,184,10,191,125,109,205,61,143,77,214,61,165,137,102,189,5,248,109,62,187,134,254,61,124,156,197,190,104,31,67,62,42,61,89,188,78,152,12,190,51,46,143,190,184,246,36,62,197,115,145,189,12,7,70,189,211,173,55,189,20,106,241,188,52,66,229,61,253,126,130,189,244,216,255,188,230,33,11,61,162,151,114,62,207,23,157,190,242,43,118,60,253,197,143,190,18,196,13,190,36,42,91,62,11,167,134,61,119,195,191,61,124,120,57,190,165,156,135,190,32,60,22,62,75,224,75,62,38,156,230,61,246,179,104,61,140,229,97,61,68,240,164,190,234,1,23,62,80,160,56,62,89,193,2,190,107,91,220,189,188,58,12,62,5,66,76,189,121,83,196,189,147,72,9,190,253,137,193,61,13,105,5,190,60,242,220,189,104,113,216,189,1,153,29,62,46,116,12,190,233,179,225,61,154,8,16,190,128,96,254,61,120,106,19,61,238,157,177,190,15,209,117,190,63,94,227,189,210,14,125,189,78,112,81,61,121,182,161,61,30,87,202,61,230,55,224,61,227,200,25,188,0,227,0,190,31,165,185,62,179,217,108,62,114,112,135,61,85,172,250,60,154,48,12,62,148,248,60,59,158,131,45,61,13,106,4,61,119,27,69,62,62,130,158,190,90,41,168,62,52,188,27,190,156,174,71,189,103,144,74,190,246,171,229,189,26,26,140,190,189,127,191,189,214,30,207,190,103,3,172,189,241,94,131,190,173,162,198,60,144,67,137,62,161,192,32,190,106,188,0,61,37,122,4,190,116,100,197,189,22,117,40,62,171,227,62,62,89,82,36,191,89,104,200,190,70,37,219,190,38,171,201,60,165,40,140,190,165,84,55,61,92,37,14,61,158,248,240,188,165,170,56,62,162,227,36,189,19,178,28,190,130,72,239,61,136,82,128,61,203,90,22,191,112,145,79,61,144,197,159,60,87,93,187,190,19,120,115,190,171,148,168,189,247,28,182,190,244,34,192,61,246,58,81,61,9,185,6,61,185,23,2,191,52,229,133,62,174,206,124,190,247,20,24,191,80,76,129,61,65,176,141,190,1,113,143,190,246,247,254,61,25,243,253,189,25,192,33,188,172,104,174,190,40,76,137,190,188,81,12,191,76,89,137,190,108,75,235,188,153,241,140,189,88,190,128,188,77,80,169,61,118,129,16,191,200,101,4,62,25,239,86,59,56,227,112,189,250,40,213,61,86,230,216,61,151,34,206,188,194,24,81,190,155,105,138,61,44,55,45,190,98,63,109,189,20,92,175,62,211,16,140,61,128,17,26,62,111,244,182,61,148,95,136,62,47,53,19,61,88,18,238,190,126,220,192,61,17,244,90,190,18,26,27,190,79,