{"meta":{"epsilon":0.009986238554120064},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[193,80,1,61,242,80,147,60,139,52,216,60,231,191,215,189,37,223,129,190,24,90,208,62,26,78,132,62,91,210,201,61,178,65,183,62,59,122,132,190,99,250,165,190,119,185,154,190,76,206,64,62,248,117,207,190,7,22,131,190,129,29,1,191,220,85,54,189,219,177,41,62,38,70,131,190,50,110,37,62,175,161,66,190,156,224,84,190,80,160,101,62,81,220,185,62,70,230,81,191,122,177,78,62,48,241,161,61,129,142,54,61,179,43,167,190,35,219,175,62,121,153,56,61,198,171,159,62,93,207,1,63,179,91,193,189,40,42,202,190,247,80,43,63,173,253,174,62,172,188,51,62,179,69,63,62,22,231,229,190,187,3,212,61,200,9,99,62,228,118,193,62,235,237,70,191,216,193,4,62,14,165,166,62,120,156,171,189,38,233,96,191,174,38,181,190,23,13,138,62,65,148,35,62,125,66,20,191,80,196,142,189,243,246,44,61,114,234,164,62,249,78,149,62,127,40,3,191,237,136,194,61,251,89,195,190,254,98,66,190,92,92,184,190,23,92,134,190,28,144,130,191,56,2,15,189,141,156,168,188,15,177,81,191,71,60,160,62,41,246,132,61,143,231,153,190,49,201,85,190,149,125,116,63,105,161,19,191,196,10,140,62,66,117,199,58,45,247,38,62,44,161,181,62,144,35,235,189,18,70,251,190,168,32,162,62,164,136,228,189,246,179,196,190,235,55,94,61,157,141,195,190,125,89,67,191,171,117,4,61,119,0,116,190,104,13,9,190,124,87,81,62,174,54,131,61,241,187,45,191,10,134,185,190,47,180,3,62,226,44,25,191,85,174,5,191,215,254,131,62,243,216,39,62,20,156,223,189,173,178,183,190,162,214,82,62,176,30,217,189,97,77,225,61,97,9,43,62,202,4,188,61,72,163,42,63,139,208,243,61,161,62,240,62,148,45,77,63,22,228,100,189,202,107,9,62,233,11,79,61,8,41,193,62,174,113,143,62,172,231,124,190,178,201,61,190,92,116,215,190,163,205,141,61,199,154,157,190,229,106,72,62,189,61,216,190,164,193,208,189,98,37,192,62,222,119,6,63,164,209,138,62,137,164,91,62,205,89,106,62,129,132,35,189,150,11,99,189,87,73,99,189,245,240,42,191,160,237,7,63,124,240,12,62,231,99,135,189,244,177,128,62,70,103,132,190,250,212,132,187,104,233,186,189,52,183,3,63,60,152,78,62,113,9,68,188,157,187,83,62,94,24,105,61,51,213,218,61,227,42,65,190,149,238,36,191,225,225,101,63,21,20,73,61,41,56,154,190,17,10,247,59,165,193,244,186,197,241,10,190,241,28,12,191,47,193,7,63,74,242,35,62,209,91,100,60,44,28,125,189,207,135,83,190,125,96,86,62,140,241,21,58,4,68,206,190,27,121,133,62,22,128,93,190,61,121,124,189,41,44,230,61,167,208,102,190,103,128,246,62,221,167,246,62,115,119,142,61,37,78,149,62,195,130,241,61,17,137,17,61,119,181,136,190,71,24,38,62,202,55,46,62,233,191,208,60,180,34,50,191,242,124,190,62,240,79,9,190,222,129,167,190,13,44,196,60,134,174,7,63,71,118,132,191,172,24,50,190,16,221,158,61,139,95,153,61,197,123,114,188,135,172,178,191,165,215,67,62,13,48,160,188,163,98,220,62,46,95,29,63,31,143,128,191,203,222,157,190,109,41,40,62,119,205,251,189,85,88,233,190,163,190,128,189,162,44,46,62,204,83,31,63,15,59,243,189,10,113,252,188,211,198,175,190,157,224,106,189,190,48,209,190,93,165,172,189,145,10,61,188,103,110,165,190,122,164,158,189,60,143,89,190,116,125,48,61,178,91,0,189,171,11,139,191,152,23,93,189,47,65,102,62,242,25,169,190,63,57,239,189,95,191,143,62,34,2,226,189,142,195,32,191,204,42,168,62,115,201,155,190,253,188,75,190,204,233,109,61,21,134,134,62,96,108,12,63,128,77,151,61,108,87,230,62,236,82,0,62,175,180,1,61,244,85,144,191,96,90,24,191,217,92,31,190,216,103,40,63,205,193,153,62,202,222,99,187,18,186,149,62,185,184,30,191,147,166,96,63,154,112,246,190,51,100,37,185,195,85,200,62,238,145,72,63,198,75,60,190,55,182,144,62,43,61,50,189,89,55,157,191,114,155,97,62,104,82,171,62,231,142,242,189,127,148,188,190,155,75,128,62,239,254,137,189,220,145,51,190,246,129,176,189,183,212,60,61,90,133,99,190,222,61,102,62,207,173,136,60,226,63,167,187,76,190,105,191,237,74,69,62,203,162,75,187,246,103,91,189,149,155,33,190,88,80,115,190,167,36,215,61,246,127,130,189,196,236,8,190,50,146,97,190,53,120,51,189,154,207,176,189,38,38,249,190,110,181,78,190,104,39,1,63,98,67,40,190,89,247,163,60,146,158,3,191,185,89,54,62,7,73,206,189,220,81,10,62,108,54,162,190,159,247,111,190,245,108,91,190,190,22,149,61,108,149,156,190,185,77,3,191,236,243,239,60,51,166,245,189,197,68,18,191,143,156,68,61,91,75,78,61,80,180,17,190,197,102,173,60,204,194,184,62,233,121,86,188,191,49,239,188,189,39,44,62,151,239,139,190,111,144,38,58,8,155,225,61,20,26,139,190,153,106,55,188,230,4,62,190,174,87,161,190,166,37,224,62,53,11,67,188,74,37,22,191,200,248,100,62,43,170,192,189,29,202,169,62,157,242,143,189,78,71,193,60,100,146,65,62,192,243,92,190,194,244,184,62,187,87,153,189,55,215,116,62,15,75,92,189,128,137,11,191,152,213,30,190,254,161,107,189,223,192,169,62,109,74,83,190,240,227,187,62,128,65,13,190,40,62,127,62,38,72,249,189,43,14,64,62,202,157,181,62,81,143,227,189,149,220,12,190,115,202,129,189,138,183,188,60,61,79,135,190,86,27,234,62,81,9,40,62,23,146,161,189,90,70,17,190,221,215,45,62,110,236,58,189,146,28,57,191,171,8,21,63,219,227,204,189,66,185,160,62,189,165,94,62,135,140,157,190,77,195,68,190,245,117,66,190,91,121,75,190,218,13,29,191,230,132,45,61,168,200,193,61,36,192,26,188,161,176,236,190,59,225,51,190,70,200,251,188,60,143,145,190,119,73,16,62,130,52,189,61,161,154,148,61,41,240,48,190,41,98,154,62,184,95,206,190,19,177,147,189,170,89,203,189,175,105,170,62,86,184,184,62,41,255,148,61,190,43,147,190,108,172,198,62,194,255,0,62,9,235,8,190,198,76,232,62,86,60,58,63,213,133,7,62,184,226,24,191,123,151,195,189,187,178,132,189,103,34,19,191,185,135,22,61,239,196,79,190,208,56,42,190,178,155,241,62,228,147,83,62,197,87,204,62,231,8,215,61,204,22,220,190,14,68,182,62,145,205,36,188,131,34,240,61,41,146,60,62,110,119,129,62,163,101,33,62,104,4,117,62,227,250,108,61,154,246,43,190,69,13,76,62,28,232,162,189,164,216,238,62,121,42,46,191,68,107,233,61,216,27,206,62,134,250,95,188,67,157,11,61,214,222,213,62,62,6,135,188,125,158,54,189,51,189,6,62,100,81,10,62,236,207,15,62,22,44,97,61,151,165,137,187,131,25,167,189,86,125,81,62,171,116,77,190,110,134,16,190,58,76,191,189,219,237,252,189,30,161,16,190,204,200,135,62,75,95,81,191,8,36,127,62,216,147,48,191,134,79,83,191,230,186,139,190,76,103,215,62,72,193,11,190,66,132,109,190,42,118,7,62,248,153,186,61,49,177,220,190,242,178,247,190,54,230,66,188,205,214,185,62,57,187,134,61,235,204,82,61,228,36,233,189,214,27,178,62,71,114,132,62,162,114,215,61,252,118,64,63,55,10,244,189,110,219,7,62,36,79,56,191,87,59,5,63,176,193,91,190,65,110,225,62,78,14,163,189,143,56,226,61,221,134,186,189,255,114,59,191,146,77,6,190,63,197,141,61,85,153,84,191,77,87,201,62,214,6,137,189,182,221,75,62,153,29,183,189,173,203,70,189,221,168,219,189,196,137,179,62,208,136,4,189,154,221,228,189,88,106,118,189,100,95,15,190,18,47,28,61,27,16,167,62,172,94,182,189,237,223,36,190,156,25,239,61,84,190,94,60,253,93,187,190,183,88,20,191,155,151,27,62,80,5,5,60,192,114,183,62,2,183,15,190,108,176,130,191,247,23,227,61,186,168,231,61,216,75,21,61,100,41,217,190,136,201,13,63,36,80,31,191,242,29,108,191,145,249,46,189,16,128,99,62,52,114,175,190,198,47,223,60,2,55,227,190,210,181,150,61,39,32,242,189,170,19,62,62,48,89,252,190,15,53,69,61,68,215,89,62,151,133,223,188,200,139,132,62,96,149,24,62,107,244,85,59,151,220,224,190,172,71,88,188,110,45,81,191,183,30,145,62,243,123,231,62,127,218,16,62,110,138,63,62,196,49,59,63,197,182,68,190,25,224,93,62,59,240,4,62,170,112,161,61,99,73,156,62,186,80,22,62,98,111,73,189,153,118,214,187,138,232,118,60,70,167,181,61,101,194,252,62,7,250,6,61,209,12,174,60,57,203,30,189,104,208,10,188,148,145,114,61,221,165,118,191,151,222,10,61,59,165,121,61,191,115,124,191,97,158,129,190,175,57,14,62,159,205,117,188,60,200,117,60,153,180,4,63,26,70,131,61,143,217,169,187,176,220,239,62,255,212,196,62,63,92,180,62,44,52,191,190,178,156,247,61,219,147,67,189,71,3,46,191,188,193,64,190,53,137,169,189,141,223,172,190,19,150,197,190,191,52,110,62,194,138,136,190,191,38,167,61,23,68,202,190,109,179,164,190,243,152,112,190,3,239,43,63,143,118,136,190,155,13,113,62,58,157,73,62,72,250,235,61,65,124,148,191,134,20,78,61,15,85,12,191,49,171,217,62,57,79,186,189,169,40,19,191,149,162,224,190,60,2,7,62,8,248,182,188,239,189,120,191,240,195,91,189,31,91,136,61,249,178,10,62,124,238,43,191,35,231,146,61,187,32,71,191,22,22,88,62,113,162,142,190,54,146,2,191,205,170,140,62,112,58,201,62,209,61,212,188,30,92,39,62,226,201,79,190,176,204,30,61,189,108,35,62,40,16,61,62,140,115,22,189,224,242,18,62,15,33,4,61,137,47,22,62,64,158,153,62,225,165,43,190,109,216,107,62,85,248,135,61,39,229,8,63,218,56,59,187,182,1,110,189,68,55,46,61,136,90,40,190,137,161,21,63,47,106,197,189,76,21,163,62,181,58,182,189,198,142,10,60,88,30,148,62,84,16,162,190,255,118,79,190,49,58,127,62,51,82,3,62,206,80,29,62,188,215,6,190,21,94,207,190,90,223,176,189,46,225,157,59,21,254,133,62,89,79,11,63,124,120,85,190,210,5,111,188,199,242,168,62,81,41,174,62,153,121,135,190,241,45,40,191,128,39,105,188,114,81,41,190,126,173,88,62,96,31,112,189,176,136,201,62,156,252,98,60,25,77,243,61,174,73,88,61,129,201,6,61,80,64,31,61,54,11,83,191,247,27,178,189,221,171,138,61,93,146,85,62,69,158,195,190,191,95,167,190,177,43,173,62,216,69,118,190,184,197,38,189,57,31,255,61,162,128,11,63,194,221,78,62,91,142,215,188,158,2,5,61,82,125,69,62,5,218,140,191,42,70,163,62,122,246,34,190,16,184,142,189,76,10,60,62,77,192,23,62,17,96,37,189,69,139,118,187,127,238,96,62,100,96,210,62,139,82,84,62,145,190,156,62,169,30,134,62,141,213,114,189,1,185,136,189,148,102,149,191,242,27,144,62,152,171,224,189,220,4,53,191,35,110,239,188,122,137,64,190,130,22,110,62,32,107,106,189,48,99,153,190,28,4,248,61,177,34,175,190,16,56,12,188,146,155,17,62,217,148,132,189,119,93,14,190,5,48,171,62,55,168,245,61,99,167,7,190,111,90,90,62,105,148,175,62,93,155,210,60,55,74,248,190,110,253,119,188,150,2,251,190,146,201,84,187,43,209,104,62,38,35,33,191,8,39,172,62,91,22,211,188,73,74,141,62,9,251,4,62,163,255,242,189,233,116,234,190,102,3,214,189,47,241,69,190,60,177,185,62,15,14,26,190,93,80,182,188,123,127,213,189,51,216,81,189,144,137,22,62,183,48,173,189,115,108,163,62,250,7,20,190,3,59,57,190,30,111,9,188,144,133,81,188,41,251,34,190,254,67,98,190,195,2,130,190,233,80,48,62,61,168,95,61,99,74,86,190,168,66,66,62,151,41,104,190,83,196,71,61,211,10,196,190,183,178,231,62,98,171,197,190,194,118,142,190,242,93,128,189,116,235,73,62,246,80,112,62,74,46,68,188,170,77,147,61,59,206,33,62,104,74,205,61,29,15,197,62,126,169,141,189,167,33,77,191,119,106,148,190,191,101,130,190,181,211,180,60,200,216,135,61,205,27,35,62,203,64,158,62,179,0,148,190,75,76,115,188,50,170,19,61,227,156,204,62,4,132,75,190,75,47,229,189,209,59,199,62,179,199,198,189,190,145,178,62,85,67,248,190,77,204,122,187,220,225,159,188,101,220,130,190,74,100,159,61,141,111,191,61,188,129,10,188,114,62,9,62,31,125,1,63,205,150,125,188,134,131,129,189,101,221,166,189,124,112,199,190,132,24,163,61,39,48,168,62,44,194,62,62,198,67,76,190,216,252,224,188,98,62,195,62,139,122,115,190,135,208,54,62,96,70,31,62,66,231,62,190,230,174,135,62,194,109,3,190,100,68,51,189,82,209,168,189,189,153,246,62,7,222,251,60,85,81,102,61,95,195,64,62,118,27,220,188,22,121,195,189,2,133,183,189,136,74,46,190,130,169,10,190,188,140,70,189,36,4,195,190,119,122,107,189,76,244,43,62,35,226,214,190,59,117,173,190,4,189,229,61,157,253,221,189,42,191,35,61,127,70,48,189,196,252,250,61,165,152,1,190,61,192,244,190,201,114,151,62,155,117,223,61,230,191,208,59,35,158,92,189,31,113,110,61,11,19,236,57,152,241,60,190,74,228,223,61,214,179,193,61,150,79,19,62,212,147,156,62,40,75,187,62,98,104,10,190,57,224,247,62,158,197,165,190,24,118,225,62,65,105,157,61,203,43,192,188,136,30,59,61,158,30,4,62,123,82,119,59,29,233,248,189,117,157,89,62,106,27,15,190,218,3,192,62,228,81,162,189,25,80,10,189,251,176,170,189,60,218,116,189,123,16,180,62,157,55,98,62,211,110,254,58,181,84,203,189,243,112,133,62,157,141,154,61,227,151,208,189,47,162,21,62,27,109,255,190,11,154,225,187,153,85,111,62,192,104,130,190,143,138,76,62,38,87,52,190,146,135,253,61,23,143,101,190,70,192,164,61,168,242,57,190,252,236,45,62,186,197,8,190,193,248,88,190,255,76,168,62,210,229,207,189,161,109,172,190,162,201,80,62,148,253,36,62,55,135,59,189,246,194,110,188,103,11,195,190,61,59,219,190,58,142,183,189,191,28,211,189,53,38,195,62,53,87,149,190,236,178,20,63,107,46,230,189,106,77,235,189,188,178,68,61,34,140,223,60,122,237,169,60,137,91,25,61,237,4,70,62,43,35,14,189,2,146,37,190,149,83,100,60,92,152,244,190,171,83,145,61,84,34,51,62,239,132,164,62,20,197,50,61,26,93,119,189,146,26,76,62,70,178,90,61,153,57,183,189,47,220,84,62,45,225,34,189,0,99,99,62,84,86,192,61,161,29,175,190,178,146,149,61,68,129,213,61,242,2,10,62,9,177,70,191,147,33,73,190,236,182,45,62,49,198,182,189,210,157,134,62,91,67,249,61,190,123,85,191,237,97,118,62,146,38,37,190,100,2,129,189,153,104,214,189,0,120,6,190,95,214,124,190,66,217,5,189,58,148,110,189,81,16,181,60,17,231,135,62,125,200,44,62,25,208,165,189,82,0,33,190,142,61,150,62,26,64,152,190,88,68,89,189,195,88,125,61,51,97,52,188,171,242,249,189,27,130,36,62,18,232,156,62,112,197,14,62,132,121,247,188,160,247,206,189,40,85,162,62,201,195,25,190,47,78,5,190,53,134,52,189,14,14,132,62,88,39,26,189,29,96,211,62,59,182,180,189,63,95,109,186,63,228,43,62,210,24,87,60,155,222,197,187,87,69,25,62,16,172,100,60,14,56,52,189,29,143,163,190,22,85,35,189,194,245,24,191,12,99,0,63,138,93,90,190,218,65,160,62,112,17,26,61,77,212,47,190,15,239,139,190,250,89,216,61,181,7,57,189,190,75,117,61,59,10,143,62,7,100,146,188,220,66,32,190,204,25,79,62,158,208,95,190,147,65,69,188,151,179,123,189,159,103,122,191,220,202,172,60,17,244,58,62,15,144,161,62,205,60,134,190,203,188,213,190,82,179,166,61,21,143,228,62,59,24,157,189,15,169,175,189,131,129,229,189,195,169,138,62,235,245,58,62,227,102,94,189,151,214,103,62,67,255,111,188,51,126,212,60,223,16,160,189,183,247,84,61,26,21,22,62,68,66,164,62,233,227,129,186,76,94,42,62,148,116,167,189,6,251,21,62,112,79,227,189,35,39,190,189,0,66,125,61,160,221,31,190,143,199,213,190,240,3,33,190,67,59,27,63,92,175,57,60,236,214,72,62,88,200,155,62,225,163,36,62,127,147,183,189,187,63,122,62,56,245,51,62,245,64,218,189,190,44,240,61,230,71,17,62,185,149,136,189,93,85,114,62,73,211,78,190,208,64,140,190,62,115,168,190,134,133,66,191,109,249,176,62,66,138,213,190,16,233,47,190,94,219,136,62,106,35,74,190,17,119,229,62,101,169,43,190,223,82,207,60,161,188,113,191,141,9,65,61,93,102,160,186,85,239,142,61,243,139,172,189,27,188,217,189,208,188,23,191,14,238,151,190,201,133,22,189,125,130,101,190,30,229,229,62,254,96,135,190,218,108,82,189,40,191,3,63,185,253,131,61,14,126,184,190,74,178,37,61,88,199,137,61,183,223,9,191,127,161,176,189,178,32,16,190,54,30,77,60,185,86,202,190,82,120,130,61,138,229,89,60,44,52,208,189,14,102,142,61,230,79,156,189,172,30,115,189,140,94,181,59,129,5,113,190,154,20,52,190,213,214,209,61,101,109,212,62,14,254,200,61,63,107,33,190,227,244,117,61,170,223,141,190,159,251,32,190,237,24,133,61,37,205,134,188,67,32,209,60,22,47,63,189,0,237,36,190,216,186,10,189,86,40,183,190,131,167,76,61,231,146,134,62,180,218,124,61,210,150,186,187,34,160,101,58,254,60,206,189,206,179,207,61,116,57,63,190,166,61,249,189,218,205,210,188,43,170,207,190,249,42,130,189,89,76,138,190,155,96,132,190,100,112,197,189,17,172,10,190,90,185,231,62,30,145,79,187,86,12,12,190,205,248,178,188,39,239,207,190,233,19,168,188,87,11,236,189,31,49,219,61,51,213,100,61,4,107,235,61,224,115,108,190,252,206,71,62,225,168,27,62,248,170,254,60,25,218,221,189,9,142,253,61,132,102,78,61,23,145,33,62,120,201,43,190,110,21,219,188,62,135,141,61,224,190,167,60,220,62,119,61,157,42,32,190,65,241,238,187,249,56,234,61,173,251,0,62,167,130,233,58,43,47,235,189,243,222,209,188,149,179,153,59,47,188,109,188,100,53,123,188,17,233,186,61,130,209,207,62,152,78,116,189,46,6,242,56,121,28,222,189,178,119,19,61,166,94,225,188,159,49,176,190,211,116,194,188,251,255,215,60,114,65,50,189,74,51,35,60,158,241,52,60,64,120,182,189,76,231,247,189,190,68,1,191,88,217,81,189,133,0,59,189,163,59,105,60,223,166,251,60,171,47,162,190,211,18,150,61,99,59,12,187,82,18,146,61,217,202,217,188,113,70,54,189,248,209,211,190,228,247,41,62,120,195,122,189,2,249,44,189,226,30,12,60,122,255,179,189,43,126,14,190,68,107,248,60,161,191,206,189,250,41,131,61,248,147,78,61,24,18,52,59,160,242,211,61,146,175,215,62,117,136,206,190,127,108,247,189,121,238,238,190,21,85,235,188,134,23,234,59,31,9,5,190,101,163,146,62,225,229,102,60,203,32,25,190,177,39,140,61,232,61,98,62,18,236,148,61,230,179,125,189,231,130,118,62,66,211,87,61,150,179,195,188,114,76,104,62,88,226,39,60,125,178,255,61,43,150,238,189,48,228,48,61,200,162,82,189,169,100,22,187,48,17,134,61,141,61,137,190,121,120,163,189,134,244,176,190,252,181,59,189,233,184,86,190,205,8,246,61,204,65,167,190,47,147,211,190,203,119,149,62,124,164,112,190,229,92,172,189,251,118,75,60,41,185,99,62,127,103,87,189,189,173,26,189,172,159,59,188,207,13,31,190,44,62,110,61,134,37,141,61,231,126,128,189,64,95,130,60,132,227,242,189,137,194,227,61,27,116,50,189,161,240,145,190,225,247,59,191,129,198,26,62,76,91,194,61,123,141,128,189,67,108,22,190,242,91,221,188,95,163,129,62,137,59,103,61,236,236,173,190,25,153,162,62,142,159,6,62,62,6,169,62,77,136,76,62,147,209,71,190,32,86,242,61,198,240,250,59,179,17,137,62,19,141,76,62,225,165,158,190,208,183,222,187,68,76,52,62,26,210,156,189,23,44,72,61,83,215,42,62,168,70,226,189,190,108,34,62,161,152,97,188,139,90,130,62,55,156,100,190,237,243,167,60,19,143,106,62,10,130,149,61,140,215,156,62,11,101,7,61,121,106,179,190,210,225,39,190,67,236,145,190,189,62,12,189,136,90,159,188,220,49,250,189,206,134,106,189,20,178,218,189,177,40,162,190,195,40,146,60,89,211,139,60,93,85,65,62,216,56,90,62,130,194,204,61,137,112,60,186,159,30,222,190,103,154,175,190,101,0,196,190,162,20,51,189,168,68,4,62,210,75,163,189,237,132,42,62,74,103,168,60,3,112,37,190,255,222,210,61,144,163,140,190,169,16,189,61,9,208,73,62,201,133,38,62,55,238,15,62,152,191,178,188,22,255,75,62,40,165,1,62,116,218,166,62,8,22,39,187,192,186,56,62,177,140,28,62,19,242,3,62,135,154,141,190,185,67,115,60,77,132,254,60,21,140,18,190,228,229,48,61,132,157,26,190,241,251,203,189,17,84,130,61,182,21,6,61,62,255,159,61,122,88,166,190,238,189,196,61,173,1,122,62,7,40,58,187,149,95,19,62,56,126,9,189,85,78,184,188,13,215,171,61,159,185,2,62,226,23,13,190,42,169,145,190,96,124,220,61,71,174,54,62,145,149,118,188,51,122,253,189,164,115,138,190,204,236,17,62,228,226,41,190,16,105,189,190,15,119,156,60,212,208,69,190,229,105,8,62,34,217,142,188,123,82,218,186,249,210,183,60,213,246,113,190,202,201,9,189,24,82,185,187,67,66,17,189,128,162,143,62,78,228,17,187,198,108,15,190,22,56,192,61,213,0,217,189,173,52,83,189,52,188,227,188,173,236,97,188,248,66,154,62,89,12,243,60,112,191,134,60,121,58,25,61,85,137,213,189,141,167,191,189,12,198,152,189,193,213,118,189,57,216,151,61,54,127,145,191,145,24,49,190,120,37,239,61,152,231,2,63,233,226,14,189,221,30,41,189,56,216,87,61,80,75,53,191,130,191,128,61,242,138,252,189,145,185,10,191,93,39,208,61,90,121,142,189,0,198,164,189,241,66,8,189,51,193,255,60,77,113,183,189,167,94,175,61,3,2,32,62,36,229,89,61,55,41,22,62,26,199,184,190,122,124,67,62,75,173,45,62,34,165,245,61,174,204,196,61,184,18,233,189,177,64,3,61,108,49,59,190,6,95,199,60,170,231,34,190,27,139,182,61,245,149,137,190,5,111,34,190,189,102,50,62,18,206,84,61,107,138,15,61,153,236,53,191,231,248,146,189,192,174,40,62,140,206,199,61,201,134,56,62,25,156,203,190,54,250,95,61,137,207,18,190,173,211,77,61,65,20,114,189,51,148,226,189,128,76,54,62,22,73,191,60,109,72,130,62,19,214,63,190,118,33,173,61,67,67,226,189,199,236,148,190,156,232,14,188,24,197,218,61,232,176,237,60,210,221,209,190,133,164,193,62,92,145,112,190,209,15,6,190,166,242,208,189,231,109,214,189,75,149,236,58,18,220,171,190,178,153,155,189,21,80,75,61,90,73,63,62,137,158,215,190,82,237,100,189,214,108,202,61,228,234,57,62,11,214,60,188,168,238,63,61,139,59,111,61,9,10,190,61,168,213,136,61,191,81,156,61,233,243,73,190,229,238,159,190,99,206,70,61,173,176,52,59,68,219,116,62,190,55,120,61,145,5,115,62,204,143,233,61,32,230,66,61,208,241,44,190,37,180,12,190,100,73,29,188,105,254,215,61,244,101,147,62,40,33,81,189,146,92,174,189,249,43,2,191,115,188,95,185,224,85,34,186,20,46,132,190,12,126,8,189,76,135,102,62,202,216,247,59,159,103,94,61,38,2,227,61,54,166,25,62,67,62,163,61,37,221,2,190,98,10,252,61,103,155,178,61,69,89,156,190,210,71,71,191,243,255,151,189,6,87,50,190,1,127,149,189,230,79,191,61,138,164,106,61,39,81,232,61,212,236,50,61,66,143,61,190,120,96,184,189,161,196,24,191,181,208,72,188,221,248,0,62,54,98,179,58,51,92,244,189,45,20,63,62,2,155,254,188,70,85,84,62,167,58,0,61,42,211,37,62,15,19,139,61,225,205,194,61,108,26,131,189,203,41,137,61,70,12,117,190,192,60,132,188,29,209,144,61,102,184,238,62,121,218,194,61,115,183,86,190,127,124,247,62,226,198,93,61,92,0,182,61,133,249,25,188,252,9,130,189,125,248,84,190,135,51,2,62,175,31,72,189,205,97,161,189,235,9,18,189,194,150,2,61,105,48,90,62,203,79,7,188,162,234,180,60,177,175,126,188,21,249,88,61,247,24,205,189,104,187,106,190,137,136,17,190,72,130,185,61,171,87,60,190,235,133,134,61,59,178,97,190,122,191,58,190,205,194,220,189,28,234,117,190,38,198,38,190,20,12,77,62,243,218,146,190,71,250,172,60,122,203,19,62,208,119,129,190,162,188,67,188,154,7,35,62,3,122,138,62,105,239,196,61,143,118,180,189,222,121,30,61,213,221,62,189,147,199,43,190,216,31,111,189,22,74,50,190,55,69,8,62,62,26,233,189,141,243,193,189,117,184,215,61,76,184,209,61,103,213,48,190,187,48,211,189,92,21,48,62,200,225,41,62,63,167,222,61,42,97,176,190,106,72,47,62,143,121,13,60,219,170,112,190,184,53,165,62,94,159,203,61,246,13,136,189,227,71,198,190,101,28,222,190,8,252,151,190,9,218,171,190,228,220,119,61,54,209,162,61,80,63,146,60,110,220,26,188,65,73,114,188,74,194,59,190,251,103,152,62,155,155,65,189,195,197,68,189,57,254,109,190,251,176,50,62,109,209,124,189,229,99,163,190,224,103,42,61,18,230,202,61,141,131,246,189,24,192,225,191,162,132,239,62,28,250,28,62,236,15,18,63,133,56,242,189,95,144,183,189,40,221,133,62,26,249,251,189,134,171,177,62,7,163,164,62,59,2,134,191,58,141,7,62,207,15,80,63,83,170,149,63,63,202,131,191,210,158,76,63,200,150,169,62,25,54,215,61,228,210,139,62,177,86,43,190,159,212,200,189,127,14,53,60,122,186,141,191,226,84,49,61,181,92,10,63,150,67,87,189,233,247,96,190,212,227,84,190,71,165,121,190,80,70,97,60,216,31,142,189,61,2,49,63,16,245,205,191,35,208,23,62,68,109,232,189,97,27,174,190,134,26,137,189,41,66,236,190,83,92,14,191,14,255,58,191,23,176,166,189,90,37,183,191,48,228,168,61,79,202,141,62,89,94,45,190,140,151,149,191,62,200,165,61,245,123,173,190,115,65,130,62,151,162,189,190,205,250,51,190,126,105,87,190,173,169,11,190,107,178,152,61,71,157,27,191,123,209,212,190,27,115,87,62,205,51,186,62,104,91,15,191,196,229,38,62,192,168,75,62,78,50,63,191,116,98,161,62,144,57,229,62,86,215,44,190,170,21,31,63,218,34,139,190,253,238,91,190,141,148,63,62,92,80,250,61,226,40,6,63,86,205,99,189,152,231,25,190,249,2,89,190,211,252,142,189,64,114,71,62,225,254,104,189,54,195,207,59,167,175,149,189,222,178,39,191,128,203,233,189,4,87,56,191,172,173,79,63,27,197,142,189,26,11,134,191,39,10,140,62,126,31,115,190,71,106,221,188,4,243,94,61,134,40,157,188,8,98,111,62,41,70,213,190,126,15,194,62,185,28,19,60,73,237,111,190,62,54,45,191,90,35,50,63,71,247,26,63,227,254,26,189,218,43,21,61,204,133,154,61,129,91,238,61,99,210,171,62,49,18,152,188,234,59,234,189,125,94,13,62,224,208,136,62,12,248,4,190,90,44,11,191,130,193,25,191,33,148,54,191,243,66,178,62,100,1,162,189,177,43,186,62,213,112,214,190,209,21,31,190,200,4,5,63,29,173,231,60,54,68,74,189,175,54,74,190,33,251,1,191,227,197,53,191,218,76,233,189,98,39,77,62,17,164,171,62,242,72,21,190,158,174,55,62,77,250,63,62,36,47,3,62,204,242,32,63,67,24,0,63,169,120,87,62,252,55,76,62,17,124,147,62,48,236,148,62,247,135,72,189,185,247,84,190,151,178,48,63,62,93,159,62,11,141,40,62,83,215,30,189,216,37,238,62,109,231,239,61,10,239,0,191,203,198,15,188,58,65,1,190,102,16,228,191,61,77,89,191,235,195,7,62,208,47,8,191,158,225,19,61,145,169,205,190,26,43,132,189,87,105,80,62,254,89,19,190,87,2,120,61,117,111,132,189,110,198,85,62,121,132,146,189,148,190,81,190,206,252,140,190,206,115,181,189,57,2,154,62,23,6,130,62,230,219,149,61,198,255,125,191,245,116,168,190,46,251,87,190,113,203,254,61,189,58,141,191,174,228,109,188,102,228,98,190,174,146,25,62,156,234,220,187,135,71,188,190,41,227,170,61,99,44,70,188,173,101,84,190,153,177,234,62,39,205,240,190,161,112,181,190,173,230,43,63,169,20,196,61,107,178,213,62,92,195,244,190,231,53,33,63,221,128,203,191,83,178,207,189,155,35,14,189,65,173,134,191,102,78,108,190,209,31,69,62,170,12,146,60,224,192,205,190,77,163,117,62,92,69,9,190,167,175,149,62,90,209,5,62,23,156,203,188,203,9,198,188,103,128,173,61,240,160,21,189,233,145,167,62,99,92,86,190,83,129,221,190,176,140,179,190,39,55,170,190,173,235,43,191,102,134,21,190,217,192,199,190,79,238,59,62,231,173,71,62,231,38,160,189,184,2,177,61,198,164,97,61,135,8,189,188,84,67,175,61,249,188,168,61,225,17,243,190,159,244,4,62,131,195,142,61,238,185,210,190,131,96,50,62,16,124,231,189,116,129,215,190,122,212,82,190,176,191,4,63,79,119,208,191,25,168,134,63,113,141,136,189,226,241,165,61,3,16,45,62,37,163,130,191,217,197,123,62,92,46,242,188,66,52,165,189,93,193,205,190,47,73,69,62,247,96,139,187,55,154,250,190,168,3,80,190,24,88,203,189,7,172,139,191,175,106,145,190,131,0,132,63,112,231,227,61,84,84,137,189,9,110,19,62,211,124,34,61,89,9,80,191,99,120,32,61,180,224,34,61,33,123,195,190,24,105,132,189,144,101,170,190,189,69,20,190,83,67,83,62,50,126,20,62,239,89,56,62,190,142,151,189,98,13,8,190,32,51,43,61,250,128,110,189,157,216,66,190,115,141,127,190,108,243,104,190,10,217,14,191,13,27,73,188,252,225,142,187,37,64,73,63,42,21,146,191,158,94,132,190,103,33,6,191,163,198,30,190,190,250,93,63,156,146,102,62,173,118,29,63,152,8,153,62,220,109,89,190,198,1,212,62,183,85,166,190,36,185,19,59,87,153,193,62,163,98,207,189,250,239,145,62,246,23,247,189,223,130,49,190,218,26,158,62,88,137,148,190,141,196,169,61,97,53,176,61,27,131,56,61,130,255,4,62,93,22,62,190,142,179,30,63,34,220,224,62,95,144,220,188,29,130,159,189,251,194,166,190,185,82,18,192,154,156,14,191,202,137,26,191,247,24,250,189,57,163,183,190,113,130,133,189,113,245,238,62,214,181,137,63,152,233,0,63,210,97,155,189,184,210,197,60,227,120,193,189,152,8,22,62,194,63,168,62,209,152,68,61,22,26,94,190,250,108,74,190,44,121,168,189,1,6,221,62,222,199,64,62,64,135,30,189,15,246,73,61,101,166,179,62,70,66,209,190,86,151,190,61,237,189,56,191,6,76,152,61,151,36,104,189,146,62,203,188,142,151,199,189,166,48,229,189,174,162,166,62,43,231,140,62,236,162,8,63,254,22,57,191,15,7,233,189,81,207,16,191,115,222,4,63,92,184,165,190,100,12,243,62,6,115,40,63,33,54,106,189,78,104,249,61,192,164,196,62,247,137,3,191,25,67,14,191,11,8,254,191,191,163,34,62,155,187,173,61,172,72,174,191,171,114,159,189,80,221,144,190,245,18,205,61,252,118,251,61,148,161,115,62,106,79,140,190,234,74,252,60,201,97,191,62,176,118,59,191,92,135,181,62,35,174,85,191,113,82,239,191,73,30,59,190,208,181,204,62,129,175,49,188,154,205,80,191,175,114,168,187,16,107,150,190,208,7,186,62,202,167,64,191,191,113,56,191,138,128,63,190,90,161,18,188,63,162,18,62,93,13,206,61,238,86,185,189,73,205,29,62,86,101,196,61,134,13,162,62,149,156,29,62,73,150,172,61,229,217,176,190,210,189,57,190,136,64,51,61,214,5,191,190,128,187,19,188,4,157,199,189,230,212,173,189,224,143,138,62,104,5,21,191,218,76,138,62,212,61,241,189,185,229,164,62,145,129,187,190,88,29,121,190,128,226,53,63,103,169,94,190,181,103,208,62,29,246,7,191,77,157,32,63,76,142,251,190,247,42,176,189,226,237,32,190,181,243,3,191,240,209,219,190,6,9,147,189,133,14,91,189,116,227,167,188,244,52,242,61,80,67,29,63,210,0,103,190,195,212,177,190,234,28,250,190,38,173,132,190,111,143,12,189,223,237,45,189,167,56,77,191,204,25,200,188,215,235,3,190,173,133,202,190,14,234,239,60,36,245,130,190,103,129,85,63,4,192,153,189,157,191,73,189,86,148,23,191,65,215,120,190,38,101,10,62,135,155,196,190,30,165,235,62,78,11,142,62,209,89,92,190,201,125,126,62,227,126,135,62,166,146,91,190,255,244,146,61,88,92,118,191,167,168,176,190,57,1,52,191,184,21,118,190,143,189,111,61,128,189,171,191,61,97,15,62,45,90,166,61,11,249,24,190,244,59,231,190,37,102,6,62,84,111,39,189,165,95,43,60,16,38,180,190,152,227,197,190,52,178,4,63,146,208,203,62,183,57,124,62,76,192,131,62,196,64,220,61,243,4,107,190,174,206,140,191,207,65,82,190,48,139,164,62,25,227,63,62,125,3,206,61,216,73,154,190,33,35,182,62,157,178,121,62,248,22,138,61,102,57,138,191,217,237,187,61,37,18,164,60,119,37,243,190,108,205,10,62,8,108,177,62,97,69,33,187,122,17,192,61,153,174,173,62,11,109,187,189,203,144,12,191,184,4,197,188,33,188,25,62,219,204,150,190,50,68,86,62,162,71,249,62,189,98,39,191,41,189,150,189,171,213,165,61,113,117,46,190,44,84,156,190,42,47,233,61,247,93,141,191,7,7,183,62,134,230,216,190,149,44,159,189,76,181,206,188,91,105,151,190,2,12,141,188,191,242,167,62,99,3,249,61,12,135,119,62,80,60,96,60,116,171,157,62,173,176,117,62,234,92,158,190,72,232,155,62,159,19,148,62,109,136,32,62,19,209,26,63,29,253,219,190,5,58,219,190,116,55,163,61,250,32,155,62,51,152,47,190,39,22,129,190,38,108,80,189,241,215,61,190,235,200,93,62,190,42,133,190,83,204,248,190,212,116,89,190,123,186,49,189,199,160,227,61,221,128,93,62,216,108,204,61,239,89,167,62,228,132,184,188,115,0,175,59,17,200,13,62,132,26,219,190,10,195,141,61,177,128,206,62,36,48,229,62,145,0,92,62,164,61,213,62,16,43,250,190,58,51,34,63,47,9,150,189,161,17,183,190,27,218,198,62,91,151,24,190,145,114,1,190,188,189,222,62,100,47,163,189,233,98,63,191,201,154,145,189,248,2,154,188,6,145,70,62,215,171,169,61,104,45,105,62,193,97,218,190,81,62,86,62,147,11,55,190,93,4,45,191,200,76,154,62,41,201,3,63,211,89,244,189,199,0,34,189,112,213,235,62,138,203,3,62,36,194,6,63,76,152,208,62,103,230,108,62,218,145,149,190,54,143,104,62,188,11,108,62,53,204,48,191,22,182,128,191,32,55,237,189,205,50,155,62,233,94,117,190,4,239,171,189,170,49,145,62,212,53,28,190,170,219,186,62,142,240,116,62,86,163,195,60,237,79,172,189,131,175,204,188,41,232,208,60,132,56,43,61,92,8,184,190,146,215,89,62,121,243,76,191,103,195,143,191,135,111,144,62,36,28,30,190,216,127,201,189,98,29,5,62,226,215,216,190,142,232,143,186,233,244,211,61,183,189,217,189,57,28,78,191,7,186,145,190,56,232,50,62,39,229,144,191,189,115,41,191,76,231,28,61,185,223,136,190,130,164,114,189,49,185,51,62,105,234,55,62,69,234,182,189,194,65,99,191,245,85,168,62,155,92,234,61,220,65,246,62,152,10,76,191,66,224,25,62,200,47,29,62,120,121,142,190,214,197,17,63,20,203,158,62,90,217,160,62,167,200,103,188,181,184,205,62,19,184,183,62,142,64,40,190,17,173,225,189,101,215,133,62,217,107,45,190,121,80,129,62,79,145,56,190,133,115,188,190,181,99,174,191,222,74,189,190,246,125,204,189,232,101,229,61,92,219,227,62,214,58,228,189,110,181,47,62,90,130,8,191,238,117,82,62,212,174,180,190,88,212,156,190,67,180,97,191,177,224,215,61,125,8,223,61,133,35,134,190,95,186,192,190,200,216,89,190,115,180,92,62,69,20,8,191,124,138,68,59,69,199,144,61,112,111,4,63,194,77,139,61,208,190,16,62,180,16,161,189,110,233,1,192,67,171,9,62,238,94,104,190,91,239,52,62,196,95,11,63,179,107,62,62,194,77,146,61,162,82,235,60,178,146,54,191,217,219,172,189,130,75,6,191,186,137,100,190,240,172,20,190,9,193,88,63,18,19,56,63,156,37,98,61,84,249,170,61,227,69,38,62,114,246,189,191,239,120,58,190,238,226,175,60,52,52,72,63,203,134,46,189,239,25,192,62,225,200,28,190,5,112,53,62,93,159,242,189,49,18,154,189,60,145,42,190,241,105,159,62,186,181,39,191,43,133,8,191,93,49,221,191,169,196,38,62,14,190,150,62,107,192,148,190,197,101,1,62,232,25,118,61,88,68,89,189,36,229,130,190,233,10,30,62,178,140,94,62,165,72,132,62,42,28,15,190,161,94,205,62,213,231,54,63,26,143,106,62,245,131,156,190,52,198,28,63,206,57,26,62,115,22,32,191,232,220,205,61,64,252,85,190,132,8,178,61,237,90,92,191,252,86,6,190,120,21,35,189,128,168,225,60,98,105,102,190,20,92,174,62,40,116,32,62,232,134,62,63,164,5,2,62,118,255,129,62,74,219,13,191,40,245,11,63,149,170,194,190,103,224,18,190,83,156,13,62,236,61,89,189,68,45,49,62,95,193,149,189,78,218,32,190,76,50,48,63,193,189,175,62,238,40,74,62,247,141,167,61,160,36,134,61,4,183,15,60,214,205,73,62,46,70,10,191,70,246,157,189,244,155,2,63,186,235,43,62,38,11,17,63,133,15,163,190,130,92,159,188,178,73,95,190,142,212,36,63,5,231,130,62,87,62,7,63,210,22,13,191,173,6,194,190,251,217,145,191,121,124,153,61,193,229,90,189,179,158,181,190,175,183,223,190,12,230,186,61,203,190,166,189,33,97,0,62,6,218,106,191,220,143,240,58,137,226,150,63,169,28,43,63,189,227,25,62,114,187,176,61,202,157,140,191,19,100,120,60,150,2,23,61,19,246,58,190,151,139,43,190,188,219,94,62,235,81,15,189,202,17,12,191,206,12,191,62,245,235,201,189,137,10,250,61,89,26,157,62,58,113,231,189,55,15,0,191,135,142,3,190,34,85,184,62,202,168,44,191,58,36,202,62,209,83,167,191,99,220,145,62,123,250,129,190,53,182,60,191,144,117,105,62,4,104,188,190,103,230,131,190,48,65,16,62,47,43,204,190,12,126,136,189,21,166,11,63,136,163,144,62,31,51,83,190,100,76,162,61,192,159,237,190,246,181,52,62,216,129,123,62,156,177,220,189,228,109,216,62,168,244,207,62,47,194,27,63,35,136,28,62,248,58,180,62,57,254,4,63,56,76,67,61,165,20,68,62,162,152,26,63,40,231,24,189,238,154,231,191,26,215,0,191,21,181,42,62,93,191,5,62,223,6,110,63,185,19,38,191,28,123,233,190,78,89,127,190,135,232,136,62,110,78,4,191,231,186,181,191,83,56,162,191,83,47,158,190,14,108,162,62,69,246,227,62,110,7,234,62,22,97,77,191,137,255,190,61,95,253,50,191,183,64,36,62,223,199,141,191,38,70,201,62,162,140,159,191,85,216,229,61,63,38,54,62,26,116,49,62,248,255,220,62,7,67,21,190,81,15,137,191,253,93,81,63,233,121,82,62,123,205,28,61,115,249,78,191,213,92,204,191,14,125,255,190,76,10,181,62,86,120,40,62,67,206,255,189,54,248,160,61,113,49,142,191,208,123,30,63,177,222,224,62,20,216,9,191,207,230,135,62,77,141,24,63,118,205,49,190,130,211,240,190,31,170,152,62,212,105,52,190,14,141,158,62,115,132,184,190,36,37,229,191,150,68,178,191,154,231,159,191,166,172,236,61,217,128,104,191,222,225,152,62,191,139,254,58,173,144,16,63,169,242,43,62,13,135,184,190,251,173,27,62,11,119,236,62,77,201,42,61,7,102,162,62,100,70,190,61,25,230,200,60,156,128,2,63,218,164,250,62,17,2,81,191,195,214,17,63,141,68,110,63,149,2,44,62,122,74,83,191,222,164,235,62,188,203,193,190,17,236,86,61,166,13,233,62,30,176,222,191,100,197,35,188,224,114,51,63,42,169,211,62,127,31,70,189,80,180,116,61,208,170,27,191,82,148,28,62,17,30,106,63,247,150,132,190,141,84,44,190,252,50,23,191,180,60,200,62,219,14,130,191,57,163,194,191,217,223,134,191,228,212,214,61,132,74,213,62,59,140,7,188,161,107,216,62,2,221,128,60,109,130,179,62,33,83,24,62,114,45,240,191,19,21,25,63,120,202,5,63,67,241,93,191,21,48,172,191,127,232,159,62,208,220,63,188,200,26,154,62,24,12,47,63,88,50,97,191,72,130,4,192,219,127,53,62,71,190,146,191,3,31,100,60,192,38,236,61,222,85,110,62,244,48,26,63,209,162,201,189,28,8,117,62,107,206,180,191,72,26,134,191,227,173,213,191,2,175,3,191,97,70,243,62,141,73,1,63,241,17,8,63,94,212,152,62,172,9,97,63,156,152,32,63,1,56,202,61,13,79,9,192,206,145,15,61,204,8,112,191,217,27,157,190,184,145,94,191,61,183,144,190,103,146,217,191,104,11,243,190,149,206,193,62,120,150,78,191,93,157,96,63,182,12,12,63,133,53,93,62,116,20,39,62,7,53,232,191,93,152,46,61,38,177,12,190,37,1,137,190,106,158,161,62,131,208,2,63,223,118,25,63,156,204,126,190,104,169,40,63,68,150,119,191,85,155,19,191,232,162,155,190,76,225,200,190,91,4,87,63,27,168,139,189,204,51,133,61,169,157,62,62,84,0,151,62,114,84,86,62,187,20,27,62,221,228,22,62,245,49,190,62,172,28,198,189,54,139,47,63,28,170,83,191,41,130,7,63,227,204,61,190,146,138,0,190,4,103,152,191,9,114,205,189,37,76,143,61,252,55,142,191,183,167,134,189,27,50,140,191,176,172,169,191,74,175,158,62,28,180,55,189,27,126,7,63,153,87,187,190,35,165,12,63,142,29,19,63,106,12,98,60,135,120,120,191,63,114,50,190,102,164,148,191,42,121,71,189,2,85,62,63,215,93,178,191,107,152,119,191,35,23,87,60,123,105,101,190,45,163,8,190,6,168,255,190,188,251,65,63,210,30,152,62,160,58,128,61,88,93,173,62,30,40,112,191,202,165,223,62,234,178,233,61,119,47,40,61,243,24,15,61,154,51,155,191,125,211,178,191,84,178,154,62,221,20,184,62,76,79,88,190,201,58,9,63,214,17,138,62,22,186,235,62,66,53,19,63,64,200,116,191,35,10,119,191,160,42,92,189,229,100,225,190,131,93,230,61,248,126,27,63,55,127,123,62,149,241,50,62,116,123,192,62,209,172,153,191,31,97,183,191,67,127,171,62,153,223,1,63,244,19,119,62,111,252,217,62,190,174,237,62,73,47,164,190,180,255,79,191,166,126,217,190,154,37,57,189,28,126,172,61,159,138,237,189,163,96,44,191,126,158,163,191,81,255,39,62,133,227,219,189,125,65,246,62,126,162,28,63,251,175,7,63,247,148,165,190,191,250,236,61,69,49,204,191,183,72,45,191,121,197,62,62,219,200,137,61,20,44,199,190,225,211,91,62,66,23,16,63,37,221,9,188,195,23,26,60,231,20,0,62,254,91,51,62,122,1,20,61,93,48,37,63,51,208,202,191,150,16,194,62,245,78,218,61,248,75,95,190,231,11,29,191,49,48,60,191,162,205,108,63,140,7,189,191,34,248,49,191,196,224,159,191,17,219,164,60,126,204,60,62,173,60,228,62,104,130,67,62,126,20,37,189,73,171,195,61,153,161,10,191,109,123,195,62,157,252,181,190,14,64,22,62,180,220,182,191,126,130,36,62,10,157,122,190,57,162,4,63,31,216,242,189,85,108,174,188,71,121,179,190,130,231,168,191,242,166,31,63,239,110,172,62,133,234,55,62,191,25,34,191,187,248,54,190,209,235,219,190,59,239,166,61,22,29,235,62,5,18,241,190,72,253,197,191,91,20,185,190,238,160,132,190,48,128,177,188,117,251,144,62,24,135,24,189,243,232,132,62,62,162,134,191,87,162,241,191,213,166,176,61,18,8,116,190,254,26,69,62,116,137,104,62,170,156,17,63,207,106,61,63,167,146,68,62,201,181,134,61,210,88,174,190,77,210,146,62,33,34,143,62,217,182,64,57,230,125,69,62,183,137,167,189,139,82,132,61,152,81,201,62,43,51,113,62,47,152,140,190,242,37,144,61,216,41,178,62,6,107,54,189,209,172,56,61,1,11,203,191,4,85,104,63,149,22,171,191,24,230,243,61,162,223,199,189,40,137,39,191,42,49,97,190,55,76,33,190,149,231,251,190,103,241,182,62,88,248,247,189,105,215,167,61,194,66,5,63,140,218,157,191,201,210,160,191,189,226,177,62,177,83,168,62,57,245,190,62,101,151,189,191,3,192,200,62,95,116,193,62,5,88,215,62,51,124,189,189,80,225,196,62,119,49,249,191,39,201,67,190,0,81,190,62,240,151,81,188,191,87,38,62,113,170,107,62,123,243,40,191,201,174,8,63,129,119,208,189,83,238,69,63,145,185,24,191,15,11,160,191,157,61,11,191,109,98,0,192,26,169,80,191,223,242,187,191,183,20,43,190,194,191,65,62,97,142,134,187,215,122,178,62,99,67,124,190,73,250,220,62,33,123,133,189,83,200,62,189,244,188,4,63,186,78,146,62,248,177,179,60,35,229,33,63,5,174,210,62,189,255,171,191,189,45,213,190,220,20,236,61,155,93,155,62,95,167,171,190,123,135,145,61,109,71,147,60,146,241,8,62,177,204,128,62,246,50,57,62,211,154,223,62,71,26,220,62,22,6,220,191,123,15,12,190,105,101,171,62,61,49,102,62,180,54,61,63,102,139,165,62,252,87,123,191,95,68,234,191,254,227,10,63,68,143,182,61,198,9,46,190,7,58,214,191,101,0,140,62,200,44,41,188,140,144,39,191,227,237,7,63,68,139,34,190,139,33,7,63,166,236,57,189,141,65,3,63,223,85,247,189,242,84,129,191,142,61,40,191,203,138,187,62,93,117,149,60,212,69,120,190,52,123,178,62,115,170,184,189,27,214,144,191,238,135,28,191,108,154,48,63,99,113,142,62,172,97,142,62,253,110,129,190,82,189,233,189,145,17,95,191,1,233,146,61,138,215,74,191,219,63,64,190,117,75,85,188,50,55,14,63,89,171,111,191,109,26,249,62,168,56,12,191,72,17,13,190,255,149,161,190,198,231,226,190,242,37,158,62,42,235,100,191,16,209,67,61,57,175,63,63,242,201,222,189,41,112,140,191,78,186,17,191,101,214,89,191,164,92,158,62,120,38,13,63,251,66,138,190,250,59,204,191,33,51,142,62,43,64,20,191,247,12,199,191,135,208,14,191,221,231,132,60,19,13,57,62,8,242,57,63,252,235,85,62,42,2,156,62,66,244,88,190,166,129,23,62,135,63,84,191,67,70,111,190,153,193,131,62,54,8,91,63,211,89,76,63,146,244,105,191,132,164,8,191,165,55,211,191,203,112,158,191,199,33,203,62,107,202,23,63,86,91,148,62,104,97,254,189,199,211,1,63,43,165,92,191,16,34,171,62,176,74,110,61,193,91,175,189,30,45,201,62,87,160,131,62,60,212,130,191,144,94,185,191,31,246,75,62,103,163,85,189,201,87,140,62,7,154,10,63,129,93,118,63,60,199,146,190,34,75,83,191,237,67,193,62,87,158,190,62,73,227,2,192,63,84,135,191,74,134,83,62,121,181,161,191,166,72,135,62,76,188,121,189,238,233,4,192,203,103,137,190,61,74,247,190,145,31,87,63,10,54,32,190,167,223,198,191,32,194,130,61,108,45,74,62,247,143,9,62,142,148,3,62,210,64,26,62,30,233,35,189,121,116,142,62,142,143,136,61,100,150,221,62,21,117,70,191,135,205,134,62,200,155,139,62,160,38,254,60,15,138,72,63,184,8,206,190,157,96,72,62,31,93,126,191,211,205,0,63,191,148,39,63,65,69,132,191,8,195,138,189,175,79,50,62,170,93,131,190,169,242,140,190,55,131,244,61,17,20,82,191,196,67,191,62,197,197,136,62,200,48,67,62,200,238,186,190,54,194,180,62,125,251,234,190,141,101,206,62,87,165,174,190,197,1,91,63,23,217,62,62,138,230,171,190,139,112,140,189,58,192,183,191,88,79,212,191,39,154,208,191,50,102,204,62,79,164,2,191,185,207,42,60,73,18,188,189,99,211,175,62,125,143,83,191,74,106,193,191,157,208,175,62,42,235,86,62,80,131,24,191,102,113,252,62,255,2,19,190,165,159,104,62,222,212,10,63,213,161,86,190,142,109,136,189,122,37,199,62,119,224,147,62,5,124,101,191,112,225,54,62,94,58,10,62,115,219,221,62,229,52,82,62,172,72,95,191,128,212,144,62,219,8,247,190,162,38,207,190,118,180,165,62,194,3,24,63,88,238,243,190,106,232,196,62,199,250,119,188,17,62,151,62,235,231,154,62,44,239,129,191,219,247,213,190,52,229,235,190,65,134,54,190,230,69,133,191,8,235,235,62,106,192,190,62,185,106,130,61,172,240,178,62,219,122,224,61,32,46,2,62,195,74,225,191,237,66,5,188,49,85,211,61,247,97,190,61,77,130,111,191,54,231,251,62,3,207,186,191,146,226,21,63,41,194,178,62,173,155,23,62,181,192,225,62,159,8,107,191,132,175,249,62,121,83,70,63,224,52,167,188,92,23,147,190,19,67,178,62,111,119,0,63,9,255,140,191,116,59,187,191,169,113,46,61,63,24,3,63,134,116,146,62,194,111,153,191,198,138,77,62,231,153,183,191,104,205,65,63,92,70,128,62,239,201,105,190,36,27,209,191,8,184,90,191,232,50,160,62,147,44,30,63,111,140,45,191,204,95,243,62,73,12,187,190,174,236,133,191,210,239,90,191,20,2,224,190,94,86,235,59,238,226,136,191,115,195,235,62,201,239,109,191,180,62,99,62,132,132,170,191,22,37,85,63,57,250,135,191,214,220,52,62,244,187,172,191,31,199,149,61,128,108,240,60,111,24,155,191,104,58,5,191,159,4,12,191,21,193,189,190,49,40,216,62,144,60,57,191,20,146,59,62,196,87,204,62,12,9,153,61,83,147,149,191,58,147,174,191,194,175,116,190,183,160,245,62,91,51,17,63,75,72,204,190,19,185,43,62,136,218,15,63,184,112,207,62,198,180,210,190,218,126,64,190,111,177,6,190,42,172,130,61,235,200,16,191,85,55,92,191,141,217,22,63,9,182,189,62,186,109,251,62,76,43,38,63,232,0,104,62,138,16,168,61,136,71,202,188,1,111,202,190,188,188,144,62,141,3,10,62,102,252,182,62,85,250,248,62,139,155,52,191,192,161,191,191,187,40,174,62,86,240,231,59,185,240,14,63,200,165,157,191,196,202,110,62,72,177,12,63,66,181,255,61,196,89,143,62,80,173,225,189,73,11,252,62,173,60,66,191,3,189,14,62,229,232,28,61,79,34,225,190,237,132,195,191,248,131,3,191,49,144,145,189,94,64,103,185,121,126,190,189,167,1,151,61,254,137,212,62,21,96,232,62,208,80,147,191,29,94,171,57,143,196,92,190,153,176,100,191,211,60,43,191,119,175,110,62,231,106,26,191,242,207,254,62,251,13,148,62,196,221,16,190,20,91,170,190,14,57,246,62,97,218,42,62,58,43,189,62,63,252,55,62,218,186,96,190,176,181,46,63,35,177,215,191,118,18,87,62,116,243,102,191,126,64,213,191,230,127,235,190,57,62,149,191,172,8,152,62,123,24,195,62,213,231,127,191,219,146,136,62,35,141,131,191,45,135,134,61,247,234,213,58,2,11,219,190,89,92,5,62,227,230,90,190,49,176,99,62,242,215,46,62,41,43,10,63,1,107,214,62,230,202,189,62,160,166,165,62,215,179,6,62,18,220,238,189,207,41,198,190,232,14,40,190,241,195,117,62,67,125,11,63,137,123,244,188,90,170,141,190,216,196,15,191,9,92,170,62,127,202,42,61,159,247,248,62,23,51,143,190,193,57,1,190,54,67,248,191,190,148,161,61,11,33,209,59,95,93,186,191,122,213,205,191,6,37,41,62,222,198,10,61,197,90,83,191,219,253,255,62,149,161,171,190,123,161,22,190,98,72,171,189,150,254,147,62,30,29,178,190,214,138,216,62,52,229,183,189,203,225,249,190,188,71,193,62,33,190,178,61,124,116,193,190,212,186,149,62,179,170,41,63,54,218,173,190,103,120,68,62,48,186,22,190,196,210,29,63,148,213,136,191,227,203,41,60,170,76,212,62,169,237,132,62,163,139,242,62,2,135,17,191,71,187,138,62,24,218,134,190,247,195,13,63,115,216,208,190,230,215,198,62,88,226,15,190,111,182,217,191,215,15,24,191,103,51,138,191,139,172,111,61,231,228,1,63,240,74,164,62,62,13,15,63,114,109,57,63,222,226,40,63,178,41,163,190,99,208,17,63,110,152,45,60,57,230,65,190,2,121,154,191,100,92,101,62,204,23,16,63,163,87,221,62,218,70,52,62,245,240,76,191,128,78,31,191,58,183,19,63,113,62,231,60,116,243,87,61,128,218,136,62,50,140,4,62,186,52,12,191,195,10,30,190,56,126,43,63,53,109,253,62,199,227,238,191,227,21,50,189,196,186,231,190,4,192,1,191,247,73,147,62,215,97,223,62,154,255,133,190,212,181,4,62,252,225,42,189,249,176,80,190,50,90,215,188,33,158,198,191,138,243,86,191,15,109,175,62,89,165,179,61,107,2,71,191,101,59,55,191,243,201,243,62,75,191,147,191,221,194,155,191,58,49,33,191,8,133,66,61,216,63,148,61,46,123,69,63,96,6,218,190,29,202,120,191,108,159,240,191,219,230,90,61,40,89,136,190,45,207,216,62,60,120,46,191,10,208,12,191,2,54,15,191,167,78,9,191,115,69,6,192,10,46,9,192,171,171,152,62,2,168,165,190,50,82,126,191,155,109,13,63,106,49,180,191,196,118,224,191,176,85,212,190,81,159,41,61,124,247,101,62,252,70,133,62,226,133,165,191,92,23,65,191,18,46,110,190,150,101,19,190,240,218,51,63,18,168,159,191,225,31,84,62,140,82,95,62,215,26,217,62,65,245,9,63,39,203,201,62,148,237,38,190,243,84,35,63,151,223,244,61,158,39,72,62,248,195,185,62,174,168,145,191,47,46,74,62,174,122,71,61,202,5,109,62,169,230,127,191,17,228,76,63,1,174,54,190,166,255,36,191,77,116,95,191,237,169,133,62,118,7,83,62,138,173,30,191,196,199,151,62,158,116,113,189,19,106,57,63,140,212,226,62,22,173,20,63,225,154,196,189,64,85,204,190,138,198,111,62,19,112,160,62,19,3,171,189,199,114,63,62,253,191,54,63,242,44,200,191,245,225,42,190,181,170,255,190,139,119,211,62,56,195,247,62,230,3,110,62,20,204,6,61,29,209,84,61,244,95,247,61,50,119,151,191,71,206,68,189,105,75,119,191,200,220,74,190,191,206,221,191,113,64,196,190,89,68,126,62,125,250,98,191,140,175,83,191,81,115,56,60,75,195,108,62,127,64,164,62,48,130,225,62,8,131,6,62,63,21,157,191,9,246,55,62,117,142,88,191,47,101,91,60,133,8,142,191,84,57,22,190,78,254,1,62,7,219,207,60,80,26,38,63,190,201,91,191,168,127,250,62,243,235,163,62,233,69,85,190,141,253,153,191,50,96,236,62,51,255,56,63,248,112,209,62,178,211,199,190,236,183,4,190,223,126,102,63,223,98,55,190,206,187,168,61,171,170,12,62,9,164,156,60,200,16,163,188,51,106,4,62,109,110,0,63,120,163,242,62,36,92,77,188,139,42,130,62,205,184,249,62,222,199,59,63,155,179,90,62,219,53,3,63,242,17,173,191,46,102,187,62,208,234,240,188,186,224,31,62,131,159,112,191,8,32,229,189,129,254,183,191,250,181,17,191,197,84,255,190,147,102,120,62,42,242,34,63,38,48,227,60,90,91,169,191,24,242,67,190,111,88,147,62,194,34,40,63,199,154,131,62,146,23,168,191,141,231,181,62,213,253,156,191,123,66,154,189,182,83,40,191,143,105,8,63,142,223,87,62,21,67,74,62,195,152,86,188,243,108,12,191,205,177,173,189,158,131,142,191,57,46,195,189,47,245,151,190,119,32,198,61,102,161,14,191,249,4,8,190,128,31,44,191,139,77,93,62,13,13,140,62,187,133,125,62,208,242,114,58,17,164,57,62,228,169,211,62,173,110,163,62,188,164,37,62,185,98,27,191,222,64,124,188,146,203,144,190,15,218,194,190,68,94,22,63,177,27,188,191,143,47,209,60,255,242,155,190,231,250,40,63,168,92,87,189,25,81,169,190,142,76,237,62,178,65,181,62,111,209,228,190,211,237,51,189,82,81,216,191,224,234,56,191,146,189,172,61,221,242,145,190,51,145,221,62,144,72,193,189,238,235,243,190,255,0,16,191,57,153,4,191,35,30,81,190,56,81,55,59,145,114,177,190,75,118,146,61,235,127,201,190,200,12,246,190,192,248,28,61,17,137,188,60,57,24,81,62,17,180,24,63,186,243,71,62,214,50,35,191,37,8,205,60,90,133,89,62,215,239,57,190,198,29,42,62,152,242,121,191,3,139,167,190,168,7,95,62,125,127,229,190,175,17,34,62,215,160,26,63,111,95,55,190,172,5,45,190,120,185,174,61,185,88,72,187,177,198,56,62,108,67,63,188,195,203,67,62,203,76,107,61,219,144,90,61,22,186,28,62,228,190,14,189,104,22,146,62,134,242,239,189,142,148,200,62,47,141,189,191,82,168,25,191,81,205,102,62,126,154,238,60,85,140,65,62,66,44,93,62,157,211,195,191,172,142,118,61,81,161,9,189,136,211,246,61,87,87,130,62,193,200,121,191,153,7,22,191,85,47,160,190,44,126,174,61,239,122,141,62,161,196,71,190,24,208,183,62,13,132,201,189,214,151,229,188,205,6,100,62,166,96,41,191,255,248,186,62,124,141,138,61,215,100,187,62,139,115,23,191,27,196,1,191,133,154,138,62,23,77,162,189,109,177,97,62,114,12,137,190,89,255,252,188,222,181,141,191,130,18,90,60,158,160,131,190,23,170,7,189,225,129,24,63,116,20,174,189,46,19,112,190,99,167,145,190,212,236,93,62,217,36,69,190,3,36,186,189,2,162,57,190,74,67,10,62,206,16,178,190,203,182,76,188,16,128,216,189,210,54,243,61,101,137,64,62,97,97,141,191,131,93,14,190,189,210,181,61,2,164,84,62,172,23,135,191,190,189,157,61,128,1,152,61,117,251,117,62,181,49,245,61,54,30,89,62,141,202,254,189,57,113,5,191,92,252,27,191,113,129,191,62,122,188,57,61,47,44,90,61,164,50,192,62,212,116,229,62,145,182,107,190,242,173,150,190,184,82,78,62,56,202,109,191,242,7,222,60,183,120,124,62,127,137,46,62,189,116,211,61,222,249,105,60,31,213,74,62,207,12,235,62,170,255,143,190,193,173,128,190,55,152,192,61,138,104,28,62,158,252,45,61,44,10,14,