{"meta":{"epsilon":0.009986495599150658},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,22],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[110,129,103,61,142,137,55,190,91,132,23,62,139,13,131,191,92,6,145,191,190,53,20,63,9,57,254,62,184,167,112,190,22,104,143,190,51,76,195,189,10,235,249,62,36,64,223,190,70,204,77,190,205,152,204,62,210,158,242,190,88,53,20,191,128,86,15,63,252,175,149,190,122,187,33,190,19,26,135,62,184,123,243,190,36,71,247,190,113,224,213,61,237,195,131,190,215,52,196,190,115,114,159,191,248,1,28,191,139,62,166,62,170,176,143,61,46,21,12,63,116,175,120,63,224,95,70,190,130,251,200,62,237,251,52,189,217,226,77,62,183,84,218,63,82,48,66,62,234,186,144,190,213,250,221,60,19,3,229,190,103,19,131,191,183,89,12,63,26,196,11,63,251,23,29,191,37,249,130,191,119,161,249,190,80,153,126,191,109,24,209,188,183,237,143,62,61,202,67,63,27,3,105,63,111,88,234,62,40,45,111,63,163,85,249,189,161,177,70,191,113,232,7,63,52,255,179,189,47,4,135,191,233,237,33,191,15,83,26,63,207,53,183,190,24,85,196,62,72,186,156,62,111,97,24,191,239,241,51,62,121,171,101,62,203,198,95,190,19,74,202,190,14,65,244,62,0,24,20,63,243,210,60,63,184,137,75,63,52,191,0,191,112,50,108,61,186,76,134,62,112,111,179,189,90,187,145,190,7,78,36,62,211,190,6,191,178,121,33,63,15,226,180,190,181,215,74,61,21,134,198,189,250,19,12,190,106,50,250,190,98,233,192,62,38,75,95,62,191,232,146,190,163,195,105,189,124,3,208,61,110,251,9,190,246,205,10,191,232,230,82,190,184,24,10,63,184,56,156,189,77,37,223,189,239,59,6,62,71,85,23,190,38,88,16,63,79,216,225,190,54,173,70,62,163,21,152,60,17,32,174,61,57,235,173,190,49,200,48,191,28,32,115,191,28,179,73,62,78,81,238,190,15,0,227,62,46,228,113,191,134,86,20,191,96,129,178,62,142,97,57,191,230,129,250,62,195,178,35,191,32,224,135,189,160,220,39,62,29,210,176,62,14,163,126,190,37,150,22,63,80,193,251,62,94,13,99,63,167,159,247,190,128,12,178,189,156,183,58,63,249,110,193,62,173,0,141,62,246,221,186,190,171,224,54,191,176,12,41,63,26,68,215,62,73,126,246,62,53,73,142,190,71,211,234,190,59,230,148,62,42,169,53,191,204,27,106,191,170,139,10,191,115,221,112,62,119,59,27,63,114,83,138,62,210,135,18,63,253,83,29,191,116,15,9,191,243,102,150,58,42,216,114,191,41,240,50,63,126,242,164,189,119,130,147,190,203,220,189,62,27,44,96,190,233,90,112,190,129,179,101,191,13,81,27,190,46,63,33,190,21,249,122,59,7,59,237,62,135,207,46,190,129,175,176,61,12,56,177,190,80,183,170,62,235,129,6,189,81,248,73,63,67,30,18,191,147,250,161,191,31,45,9,63,151,84,211,60,62,201,10,62,212,97,47,63,144,229,179,190,134,184,252,190,18,116,130,62,58,119,61,190,46,181,163,190,74,95,240,62,168,42,78,63,237,29,165,62,77,183,90,62,228,168,240,62,151,53,91,63,128,253,54,63,233,130,110,190,201,17,123,191,81,43,197,62,7,121,162,190,250,169,67,63,106,130,100,61,234,111,116,190,123,222,223,62,197,204,64,190,202,88,26,191,114,241,36,191,194,20,94,62,78,169,56,189,225,242,105,191,89,171,198,190,84,148,203,191,39,221,44,191,136,222,24,63,62,200,44,191,152,2,36,63,198,219,65,60,229,67,181,187,209,167,86,62,17,191,154,62,233,4,245,187,146,58,16,62,11,218,78,190,59,5,129,62,115,228,223,190,125,231,165,190,254,171,154,62,238,5,98,191,196,79,46,63,71,12,121,191,146,39,64,63,183,27,38,63,10,68,237,62,57,102,222,61,239,190,39,63,171,48,100,62,245,141,248,62,175,15,129,62,150,88,39,191,19,206,74,63,26,97,105,62,216,113,153,190,244,188,3,191,203,43,53,190,233,52,220,190,102,42,57,191,67,92,233,188,178,186,8,191,104,6,57,191,1,106,169,62,197,122,244,61,123,62,61,63,61,96,3,60,162,179,61,63,21,197,134,191,129,251,26,63,65,178,231,62,184,67,200,62,247,144,7,62,212,29,36,188,124,52,133,190,188,157,56,63,158,11,9,62,112,229,67,63,161,75,157,62,86,180,163,189,67,32,44,191,229,97,188,60,132,103,61,63,84,193,218,191,157,154,224,62,21,192,218,62,78,178,137,60,37,4,123,63,216,47,116,63,231,241,76,191,255,146,77,62,4,236,45,62,71,164,151,61,74,106,197,62,224,207,44,63,85,132,223,190,110,190,115,191,31,150,132,190,119,84,1,63,110,30,39,63,156,36,145,62,110,59,148,59,233,237,137,62,206,62,32,191,207,76,26,191,252,227,117,62,56,207,157,63,160,164,129,191,192,182,64,191,180,134,57,63,161,144,46,190,19,202,166,60,97,250,60,189,59,92,7,62,55,255,53,190,24,131,6,188,194,12,192,191,5,84,150,189,160,252,139,189,187,36,218,190,53,169,10,62,69,100,80,62,119,107,130,62,229,126,143,190,127,0,212,62,76,166,124,63,156,91,187,190,164,60,97,191,68,37,174,63,130,167,100,62,243,106,16,191,246,145,43,190,49,59,0,63,240,52,101,191,17,69,55,191,94,244,180,190,140,175,102,62,255,205,96,191,41,83,89,62,200,11,163,61,210,42,215,62,160,175,125,190,129,154,153,60,124,99,192,62,31,12,6,63,251,53,14,190,29,116,130,63,44,219,44,62,146,32,133,191,1,133,214,61,187,189,200,190,40,234,19,63,248,9,189,62,55,118,16,63,218,38,32,191,93,189,80,191,253,226,18,190,131,155,172,62,91,136,46,190,86,2,39,191,255,101,62,62,50,143,133,63,158,110,30,188,141,109,188,62,152,140,241,62,167,114,174,62,39,196,192,62,134,223,239,190,239,156,154,188,96,50,91,60,86,205,47,191,196,154,70,63,132,1,80,63,79,235,240,189,238,125,143,190,190,47,150,188,95,102,193,190,70,122,90,191,223,173,84,63,141,149,167,188,238,79,73,190,147,47,170,188,226,191,94,63,243,164,23,190,190,92,56,190,72,241,59,62,14,31,217,189,245,63,86,62,143,193,116,61,69,134,47,62,149,163,33,63,195,59,138,190,171,209,30,191,33,155,129,190,172,14,94,190,43,38,152,60,157,29,96,191,51,136,90,62,185,182,191,62,199,36,204,190,204,57,37,191,70,96,62,188,143,116,175,62,13,90,1,191,100,113,8,191,66,151,198,190,92,5,134,62,83,229,27,190,70,55,232,190,129,183,81,62,199,72,253,62,180,176,221,60,224,193,43,62,50,107,65,190,193,32,122,190,141,231,255,190,112,12,40,62,98,149,76,191,244,251,83,191,109,224,158,189,180,10,253,188,220,206,0,191,146,6,182,60,179,27,21,63,136,78,181,62,210,49,9,63,173,126,109,62,208,158,27,190,160,189,198,63,225,153,84,63,16,13,129,63,13,243,161,62,14,47,75,62,140,241,169,190,118,97,212,61,164,230,111,62,31,58,162,62,52,237,33,191,33,198,222,189,218,52,45,63,123,157,179,190,241,214,58,63,32,157,38,63,207,40,113,188,240,59,131,62,80,215,129,62,193,58,178,189,131,149,109,191,71,221,136,191,74,50,247,190,19,193,109,62,170,128,196,190,92,138,49,61,234,131,48,191,51,229,11,62,183,243,173,190,95,183,86,191,175,25,132,189,250,121,212,190,195,70,171,191,125,68,166,190,241,175,134,190,180,164,126,190,191,157,12,191,49,58,42,191,224,80,224,189,188,68,86,191,160,89,135,190,255,2,211,190,194,238,3,191,173,193,93,62,85,8,176,190,205,241,63,190,5,5,105,62,130,111,140,191,37,201,138,189,96,24,23,191,250,187,22,191,192,64,228,191,49,214,76,62,161,102,44,61,61,23,15,188,148,117,161,190,71,128,175,61,5,38,157,62,203,7,51,191,128,166,14,190,144,145,201,62,94,241,155,62,7,153,38,62,147,203,217,190,52,238,47,63,32,106,7,190,145,185,170,61,187,129,56,188,179,210,204,190,217,155,103,62,70,93,51,190,223,114,65,191,226,213,116,191,144,96,232,190,122,254,86,63,176,12,124,61,21,199,59,60,110,90,48,191,123,126,19,190,217,128,56,190,189,154,6,191,242,114,235,190,55,161,35,191,216,94,82,62,195,155,93,62,174,56,179,190,5,28,204,190,242,96,89,62,221,210,81,62,142,214,180,189,172,103,135,62,6,36,166,190,245,113,239,189,254,207,45,188,25,91,209,61,117,86,145,62,173,76,249,190,86,45,73,191,217,198,28,62,84,12,174,190,20,154,210,62,152,191,24,191,67,5,103,189,57,185,139,62,151,180,39,60,62,192,165,190,37,192,108,190,233,39,92,63,141,85,164,191,73,160,254,189,167,90,201,190,242,73,190,62,165,136,198,190,210,54,33,191,169,6,143,190,71,86,81,190,63,203,88,190,52,30,87,63,213,56,74,191,117,144,21,191,207,153,58,61,183,94,39,191,170,194,13,191,135,31,77,191,225,153,16,191,187,119,142,63,78,59,81,62,27,243,136,62,178,134,82,191,153,21,150,190,246,49,214,190,121,238,152,190,212,117,87,191,233,32,118,63,233,237,254,189,130,189,148,63,29,253,151,62,25,56,126,189,184,50,77,190,60,37,6,191,27,81,92,61,210,125,173,62,1,34,100,191,100,109,182,189,247,172,0,191,113,130,8,63,77,1,139,190,81,85,34,191,156,182,215,61,132,122,101,187,190,106,133,191,104,203,212,190,23,127,137,63,1,28,9,189,162,196,138,63,87,23,85,62,205,138,188,188,157,170,66,63,170,142,161,190,221,68,125,63,53,174,162,190,246,195,69,62,136,71,20,190,83,176,16,190,61,63,139,62,131,50,227,62,226,217,158,190,244,206,193,61,5,52,234,190,189,224,212,190,10,201,210,62,34,79,129,60,248,155,172,190,244,110,164,190,3,198,58,189,191,63,119,191,36,76,201,61,243,47,174,190,220,230,117,63,252,193,132,190,64,71,211,190,53,28,184,190,158,66,238,191,77,8,5,63,41,146,125,62,24,17,65,191,222,173,5,189,36,192,140,190,1,65,183,63,139,17,221,62,12,214,175,191,16,209,145,190,70,92,105,191,35,160,138,191,220,254,139,191,40,183,162,61,18,10,50,63,211,15,230,62,90,1,55,190,243,91,227,189,219,197,210,62,7,150,98,62,14,176,122,61,96,108,163,191,112,253,120,190,186,108,167,190,2,118,219,62,26,154,6,191,255,121,150,190,18,114,28,191,228,52,146,62,103,112,44,191,29,99,209,190,236,230,54,190,84,92,128,190,10,197,225,190,75,135,61,190,89,37,38,190,124,186,13,62,247,132,66,62,242,25,209,62,171,88,240,60,228,198,225,62,236,203,79,191,183,157,140,190,239,126,222,190,41,219,39,62,91,34,229,189,255,65,211,62,66,232,35,63,178,126,70,191,131,140,34,191,197,1,69,190,152,132,89,191,187,176,109,62,96,213,8,190,54,143,200,62,33,204,131,190,43,50,185,190,51,147,43,63,33,87,18,191,242,252,84,190,163,117,84,190,93,116,133,62,90,229,35,191,188,238,204,190,182,109,169,190,182,110,221,61,71,251,36,190,228,2,8,61,226,185,1,63,138,100,11,191,201,17,141,190,89,63,60,190,152,86,5,62,15,230,202,62,188,232,253,190,243,158,25,63,75,104,183,62,200,31,160,189,28,246,156,190,235,72,155,62,70,35,199,189,167,174,151,191,27,131,136,190,226,17,164,62,230,204,146,191,17,120,73,60,40,206,113,62,232,235,86,191,8,100,148,190,20,16,227,61,254,154,22,63,245,195,137,62,186,201,6,62,193,78,147,191,78,82,181,62,142,190,45,63,120,165,82,191,115,11,63,191,75,179,216,190,128,49,185,62,219,225,208,62,231,37,14,62,38,181,229,62,29,104,112,188,248,153,120,189,43,61,167,189,73,193,29,191,90,211,174,62,167,2,16,190,120,1,194,62,10,76,254,60,31,224,147,62,250,192,61,190,95,128,14,190,146,81,3,63,113,191,190,190,156,67,172,190,26,241,167,61,212,240,53,191,34,230,207,190,177,249,155,62,146,193,57,188,109,105,174,62,72,231,197,190,236,107,16,191,97,140,230,62,232,5,236,190,28,226,116,62,89,223,191,62,248,55,248,190,220,94,141,62,235,221,134,191,114,137,108,190,88,7,61,63,47,74,192,61,13,157,156,62,167,237,197,189,96,208,247,189,75,197,239,190,148,121,208,190,86,41,140,62,146,48,222,190,21,215,255,62,109,103,20,191,177,49,209,62,50,140,76,189,88,152,20,62,238,104,19,191,191,215,66,189,37,83,212,61,235,193,206,62,140,248,110,191,101,62,176,190,4,51,184,62,85,12,107,62,2,12,185,189,126,171,165,62,129,228,242,190,243,207,40,63,225,175,29,62,62,113,25,191,153,31,146,188,107,214,117,61,117,231,243,62,165,155,91,62,74,158,21,61,116,237,222,189,219,17,164,191,105,171,126,60,96,255,126,62,129,109,173,60,92,12,92,191,3,44,215,190,113,191,234,190,126,45,41,62,90,177,86,191,133,144,174,61,44,90,8,61,157,177,84,190,114,108,154,190,165,178,147,62,131,150,236,190,199,77,70,62,176,124,236,62,115,200,165,190,4,101,164,191,247,109,16,191,138,240,194,190,227,116,89,191,92,59,24,63,45,115,133,190,17,212,191,189,0,99,86,191,37,81,74,190,60,190,102,62,191,225,9,62,249,41,137,62,170,152,110,62,19,111,76,191,213,232,228,62,200,123,34,62,89,225,149,190,243,166,228,62,67,5,231,189,207,201,216,188,194,42,228,189,88,197,53,191,179,37,147,62,148,8,13,191,128,128,182,62,222,225,153,62,20,145,138,189,221,127,129,62,217,64,129,62,42,169,27,63,136,187,66,189,179,232,158,61,126,249,27,63,92,190,14,191,90,14,174,62,218,26,17,63,14,252,24,62,41,166,172,190,98,35,18,63,133,178,81,62,252,203,57,60,48,124,142,190,66,189,46,190,34,20,77,62,51,62,163,190,212,10,14,61,240,48,107,190,204,239,181,62,87,90,194,61,227,139,236,61,180,162,141,62,198,61,38,63,9,12,230,190,105,99,135,191,179,226,138,62,218,38,254,62,22,77,219,189,156,111,174,61,216,170,164,190,41,15,188,62,116,17,54,191,163,126,154,190,26,209,33,191,218,40,205,62,107,159,29,62,197,37,249,62,213,20,63,190,205,107,149,62,183,72,96,63,169,199,3,61,161,157,3,63,41,218,247,188,88,179,215,190,182,200,237,61,25,209,46,62,251,79,150,62,226,88,229,190,174,111,125,190,149,22,238,62,236,170,171,189,52,231,72,191,28,59,139,190,105,127,25,63,27,209,3,63,175,25,15,63,40,8,222,62,64,196,70,62,5,76,20,189,212,161,38,190,154,117,26,191,220,167,31,63,227,156,18,63,177,180,190,62,59,153,15,61,8,183,97,191,117,203,153,62,59,61,65,62,124,133,15,191,170,69,22,63,173,221,146,62,38,186,178,190,133,142,52,62,167,65,7,191,26,224,243,62,82,8,169,62,161,225,110,62,84,154,139,190,214,163,65,190,9,88,7,191,239,133,157,190,52,209,220,62,244,160,12,60,253,166,242,190,112,46,57,62,92,49,26,190,50,1,135,60,63,148,113,190,166,224,103,62,69,57,217,62,165,211,76,62,134,130,116,189,248,225,194,62,210,133,71,62,132,112,214,61,218,99,91,63,35,71,64,62,157,143,121,190,243,14,221,190,8,80,42,61,172,245,165,62,222,231,17,63,137,229,110,189,77,121,125,62,49,255,198,190,166,157,17,63,181,239,172,61,166,163,161,62,50,98,252,62,167,150,127,62,98,164,39,62,225,232,193,190,43,233,72,191,92,109,7,191,95,246,145,189,99,140,1,62,62,83,162,190,204,53,24,190,29,208,26,190,123,122,185,184,60,77,207,190,43,228,96,62,148,241,124,62,31,100,2,61,100,31,82,63,13,197,110,62,255,53,226,190,200,122,138,62,249,196,178,190,240,211,81,190,243,65,33,190,139,65,78,63,150,65,137,190,190,209,141,62,163,152,174,189,98,255,124,190,144,128,163,60,42,207,154,190,239,232,13,191,191,224,139,189,21,59,29,63,40,206,78,190,201,118,44,191,28,171,32,63,169,130,233,189,37,251,180,190,51,78,143,190,188,160,115,190,15,63,60,62,143,50,115,189,125,12,0,191,81,169,115,62,118,113,166,62,45,108,198,61,86,134,146,190,68,5,49,189,250,4,150,190,27,34,37,191,61,53,242,61,197,112,254,190,158,77,83,62,221,93,183,62,205,236,221,62,38,24,131,62,131,60,141,190,125,46,135,190,148,16,230,62,144,87,254,189,103,225,114,63,244,228,7,63,199,134,187,190,239,211,224,188,138,45,53,62,226,39,77,63,123,143,172,60,77,120,55,63,239,30,209,188,246,225,21,63,147,16,169,62,196,77,248,190,247,86,34,62,61,233,32,63,138,145,180,189,19,237,153,62,26,226,9,191,19,44,105,189,9,196,139,62,3,98,47,61,111,32,199,190,153,18,92,189,255,226,43,63,79,203,103,191,224,63,179,61,201,62,145,191,61,165,36,63,29,56,37,189,141,9,177,190,163,148,3,63,159,166,220,62,249,242,62,63,120,84,233,62,176,168,64,61,235,16,109,62,84,48,172,61,147,12,245,62,245,115,11,63,229,108,144,62,153,212,73,63,7,116,231,62,8,123,88,189,139,179,204,190,59,100,147,189,8,211,11,191,194,41,181,190,196,99,227,190,245,52,202,62,16,27,61,63,61,252,19,63,41,151,3,189,191,7,156,62,33,91,144,62,207,116,208,189,161,2,47,190,40,231,80,190,114,3,47,63,215,211,85,63,126,30,79,189,52,100,142,62,199,60,193,190,161,246,93,190,199,137,173,60,71,8,20,191,172,190,230,62,184,150,149,190,220,137,133,190,77,179,59,190,166,250,143,62,185,191,204,188,70,237,198,189,76,153,202,190,18,149,216,62,155,204,167,62,60,41,159,62,99,184,16,62,115,43,16,190,182,75,232,62,122,134,13,61,214,135,14,190,128,243,228,190,133,31,62,190,100,165,142,187,8,96,253,190,67,162,238,190,93,140,106,62,248,224,212,187,0,249,146,189,194,158,20,190,9,184,33,191,85,21,38,62,132,50,236,62,64,60,97,190,191,42,218,190,127,30,63,190,157,218,128,62,74,216,176,62,233,212,45,190,54,83,94,62,58,253,249,61,6,129,156,188,14,199,117,191,246,228,120,188,156,205,196,190,213,109,28,191,201,11,228,61,221,231,139,190,21,170,95,190,96,229,249,62,212,201,100,190,203,191,122,191,253,193,189,62,179,178,222,189,166,146,181,190,126,251,180,189,38,101,129,62,132,65,165,62,136,247,245,60,208,219,171,62,17,205,33,62,2,250,190,190,188,97,239,189,25,58,7,190,239,168,207,62,251,143,9,191,5,42,157,62,80,32,159,189,67,163,149,189,131,202,13,188,28,108,6,191,22,109,35,190,104,101,241,62,174,190,67,63,232,192,84,63,69,61,25,191,81,13,176,62,19,246,56,189,29,212,254,62,221,39,83,62,16,213,99,62,228,206,19,62,210,97,158,189,206,63,228,62,30,13,146,62,224,225,189,62,151,151,193,190,221,147,139,60,69,79,108,191,19,167,165,61,104,99,192,62,60,195,180,190,102,78,33,63,186,194,213,61,5,239,5,63,213,247,192,190,46,30,18,189,160,110,220,189,239,116,48,191,80,198,26,61,120,116,13,63,119,70,13,63,130,152,170,60,24,137,42,61,62,197,17,191,240,83,65,190,0,193,21,61,21,10,156,62,66,183,187,62,223,103,145,60,100,226,82,191,184,206,191,190,117,192,7,62,52,74,86,62,187,224,22,63,219,22,197,190,214,178,253,186,128,144,106,191,235,173,176,190,15,124,102,61,5,71,180,190,129,214,186,61,149,92,2,62,6,96,48,190,217,231,175,190,218,9,131,62,247,10,21,191,59,245,14,191,32,11,133,190,68,245,32,62,155,226,187,189,249,12,92,190,116,1,54,191,148,242,5,191,17,138,12,191,70,248,25,189,47,16,138,190,142,187,16,189,97,90,98,62,227,123,23,63,234,52,57,190,57,61,8,191,71,44,180,61,179,200,112,191,157,124,222,190,89,198,212,61,139,71,166,61,242,126,205,190,205,140,28,191,8,25,239,190,15,119,116,189,109,15,181,61,40,226,58,63,1,70,42,190,216,92,120,188,6,224,117,190,235,19,30,189,27,22,0,191,103,147,196,190,62,110,218,62,234,15,110,191,220,30,150,188,97,34,141,62,225,27,66,188,156,108,97,62,171,242,149,60,226,170,149,190,112,233,139,62,191,226,221,61,85,254,128,189,7,96,20,62,216,229,22,188,116,203,140,190,185,239,87,62,117,217,74,62,148,151,189,190,51,68,115,190,230,108,95,191,115,26,58,189,230,186,168,189,200,122,69,190,133,31,235,60,103,243,49,191,174,73,187,59,181,247,165,62,60,165,115,190,198,13,221,61,83,192,226,62,44,57,205,190,99,202,33,62,31,122,223,62,31,89,83,61,248,182,25,63,110,207,241,188,236,66,22,190,164,164,7,63,64,218,172,190,58,49,6,191,199,43,38,188,66,73,81,62,25,104,100,190,18,124,125,61,50,56,66,62,244,252,125,190,24,161,8,191,38,145,144,60,235,78,200,189,87,226,63,62,158,13,167,61,57,196,20,191,116,41,146,191,237,143,144,62,249,49,139,62,57,185,153,189,55,166,219,62,5,169,156,62,164,38,97,62,87,128,230,190,179,14,128,62,198,140,4,191,244,205,77,62,70,155,39,191,166,80,247,62,244,79,44,61,6,41,165,187,102,45,250,62,207,164,2,63,101,130,80,191,69,242,102,62,64,156,207,62,28,205,12,189,235,96,50,63,176,74,139,62,164,13,227,61,118,170,96,190,51,20,151,190,37,47,157,188,168,243,37,190,191,58,89,60,34,84,14,190,77,28,137,62,47,146,9,63,168,14,152,190,89,94,28,190,249,131,10,190,186,87,146,62,179,197,27,190,15,132,31,189,164,123,16,63,166,134,90,189,70,60,250,62,176,105,163,59,71,106,9,62,52,89,122,190,98,149,187,189,172,211,157,191,38,37,95,190,189,181,75,189,189,198,138,61,54,118,100,190,191,141,119,191,217,183,131,62,126,7,176,61,60,167,186,61,158,239,233,62,211,72,219,189,59,122,72,191,188,9,142,191,249,73,131,190,220,239,10,191,151,230,16,191,72,0,42,191,14,215,51,62,234,95,72,189,231,76,111,189,90,210,51,189,107,231,180,189,182,147,154,190,12,245,223,188,123,134,182,62,87,102,182,190,204,178,39,190,252,181,221,190,167,52,65,189,242,197,59,63,235,116,138,189,29,181,191,190,44,37,239,190,27,168,138,190,64,190,160,61,150,107,166,62,37,222,159,190,188,63,235,190,111,84,67,190,163,65,238,188,222,203,4,190,82,143,164,61,240,53,255,62,39,52,44,62,61,197,188,61,203,204,12,63,142,221,66,63,215,152,189,190,244,120,219,62,226,91,17,63,114,227,55,63,86,196,53,60,150,110,34,63,167,134,222,62,222,248,71,61,130,203,166,190,135,254,121,61,201,186,80,190,134,163,70,190,21,162,50,62,252,63,181,62,178,213,149,61,22,45,49,61,47,144,170,62,93,34,100,190,41,123,4,190,181,170,8,62,13,144,200,61,254,80,189,62,111,78,58,61,63,251,54,191,4,140,133,190,153,255,224,190,41,113,252,189,128,109,34,191,119,127,4,191,214,186,198,60,1,162,219,62,126,58,155,189,21,149,182,62,195,166,231,189,80,203,145,62,224,91,56,191,202,142,173,191,172,45,150,190,109,202,213,190,29,101,43,191,220,214,241,190,206,72,212,189,36,93,77,190,102,81,177,190,149,149,69,189,232,146,91,190,88,152,39,191,83,191,39,62,228,144,83,62,133,153,148,188,52,32,90,191,28,168,113,61,180,176,239,60,132,155,223,189,174,34,134,61,211,172,2,63,183,18,142,62,10,58,0,191,74,71,146,191,94,11,8,62,200,178,139,61,66,54,181,62,191,82,85,190,88,253,181,190,171,35,166,190,118,4,137,61,10,144,4,62,6,219,147,62,165,166,19,62,198,137,181,190,236,89,199,61,94,237,133,61,225,181,9,63,146,200,75,191,110,59,169,190,255,87,218,190,138,19,161,62,31,6,28,191,254,35,80,59,168,17,32,190,242,30,179,62,68,66,196,62,125,56,73,62,116,162,135,62,174,44,235,62,192,216,140,189,204,136,43,63,98,36,28,191,79,51,6,190,202,252,29,188,135,18,191,188,188,58,123,190,215,168,234,61,253,216,62,62,164,106,200,190,100,84,112,62,229,149,178,190,217,254,135,62,234,14,147,61,134,42,145,191,115,1,178,190,26,155,204,62,235,228,193,59,46,3,91,190,142,97,101,189,161,114,201,188,109,213,63,191,31,127,195,190,201,10,171,190,146,45,196,189,133,11,147,189,3,173,231,62,16,231,204,190,101,187,101,190,251,109,14,191,8,169,208,190,173,76,159,62,191,133,4,59,118,98,180,189,149,106,0,190,146,194,9,189,2,204,238,62,210,136,11,62,159,1,240,61,126,145,190,61,56,57,8,190,106,4,77,190,151,16,198,190,25,45,223,190,9,224,199,62,215,60,129,190,113,29,237,62,184,58,165,62,212,158,213,62,176,241,9,190,112,151,135,62,65,103,215,190,171,101,254,189,30,153,57,61,149,74,9,190,251,202,71,62,247,237,73,62,145,77,77,190,239,76,136,61,180,241,111,191,24,160,203,62,215,59,49,190,86,221,201,62,64,187,155,61,189,53,139,189,46,107,28,63,42,29,183,60,90,96,198,62,100,54,90,60,195,196,33,191,36,108,188,62,233,17,137,190,76,252,2,190,253,9,38,190,14,32,111,62,221,180,114,190,141,90,16,190,126,134,224,62,180,82,130,61,253,31,17,191,99,112,88,190,157,83,135,191,23,162,137,61,205,235,67,62,168,101,24,63,91,92,101,191,181,247,1,62,117,208,250,190,93,96,48,190,194,118,231,62,214,235,228,62,19,198,4,191,68,207,184,62,152,191,238,189,79,252,200,190,24,18,91,191,170,18,20,63,37,213,162,189,123,247,133,190,211,234,113,62,133,220,195,190,27,75,203,62,251,214,168,190,215,48,95,190,163,112,22,61,132,117,98,62,201,244,182,190,197,137,142,190,113,170,1,188,189,112,7,61,79,132,81,62,198,87,18,190,132,186,6,63,68,25,118,62,192,93,20,190,130,182,169,62,111,126,6,190,170,231,255,62,41,149,31,190,203,134,241,62,214,89,216,62,181,215,23,63,215,12,134,190,241,221,235,62,186,153,98,191,77,89,33,63,208,227,139,61,40,105,66,61,224,30,129,61,153,32,252,62,121,8,50,191,69,79,224,62,222,134,129,190,45,166,21,62,11,235,197,190,145,30,193,62,31,49,86,62,137,69,18,191,97,135,148,61,20,185,143,62,109,40,147,62,15,140,41,62,241,222,1,61,187,99,6,62,48,105,232,189,200,97,137,62,85,115,195,190,0,212,37,63,139,68,167,191,227,188,199,188,79,215,5,63,133,148,148,190,228,149,106,191,169,179,69,191,253,45,35,190,234,201,151,62,127,138,124,189,146,145,188,190,170,86,148,190,152,236,37,191,191,228,91,190,15,107,133,190,2,62,132,61,82,70,80,63,206,93,112,189,204,118,48,190,73,130,204,62,250,5,112,189,72,46,146,191,22,46,220,61,56,170,211,62,83,129,45,63,46,110,245,62,225,36,124,63,199,103,39,191,151,201,242,60,146,205,191,189,23,179,0,191,23,34,71,189,72,92,26,190,65,182,209,190,45,117,48,191,245,150,6,190,97,9,250,190,243,199,163,62,20,120,20,190,152,236,215,62,98,217,190,191,204,16,91,62,50,121,0,192,5,67,80,191,255,149,12,62,75,79,115,61,115,10,168,62,64,161,197,190,222,103,203,62,233,190,14,63,244,126,153,62,127,105,24,191,9,206,37,189,253,151,116,62,234,125,144,190,81,5,15,62,180,45,220,190,253,250,183,191,251,144,66,61,220,77,24,190,227,56,81,191,236,149,76,191,144,50,89,190,210,1,253,190,234,72,163,190,213,20,194,62,216,219,21,191,254,37,60,62,97,83,245,62,8,54,214,62,143,16,60,62,74,59,173,62,66,187,205,191,251,117,188,190,253,223,13,63,3,115,203,62,2,35,217,190,41,239,153,189,154,169,206,62,203,217,11,190,201,170,116,191,118,240,10,191,63,64,69,190,91,165,156,62,213,36,109,190,71,14,52,62,21,241,25,191,134,232,21,191,70,173,93,189,16,85,161,190,55,30,172,61,89,96,158,62,200,229,207,62,63,77,228,60,138,29,194,190,45,159,47,59,80,78,23,63,208,247,25,63,249,85,213,61,222,20,129,62,140,212,29,62,64,145,41,189,232,58,23,191,220,48,21,190,240,221,195,62,132,55,74,63,121,96,0,191,254,19,149,190,71,123,44,63,108,107,236,62,230,109,189,62,9,145,128,62,132,254,4,63,208,27,21,63,234,202,59,62,211,167,7,191,253,1,198,190,69,196,137,187,234,161,25,62,228,24,154,58,103,85,37,191,192,251,30,191,202,29,21,62,185,161,205,62,203,7,132,191,152,110,244,190,133,26,161,62,168,167,75,190,41,203,125,191,130,96,169,61,220,108,94,191,111,225,11,63,241,236,114,62,202,145,143,62,209,58,13,191,44,116,121,190,32,187,250,62,229,31,47,61,221,67,35,62,192,158,75,191,77,95,4,63,207,66,192,190,166,84,161,189,149,194,23,190,130,88,6,62,155,248,154,62,37,161,166,188,12,177,199,62,135,237,241,190,144,98,181,188,176,133,160,190,33,240,24,189,59,194,83,62,115,122,224,188,45,27,15,63,193,22,154,190,174,131,58,191,101,4,79,189,38,82,56,189,219,129,119,62,76,114,60,191,18,115,133,62,223,214,130,191,190,20,227,190,113,143,221,190,208,233,193,62,178,44,92,62,61,157,196,62,5,55,62,62,181,28,63,191,188,19,215,62,191,144,126,190,38,58,126,190,216,82,181,62,101,247,93,191,176,51,167,62,213,27,144,62,205,244,178,190,233,50,72,62,35,129,37,62,159,94,110,62,185,236,152,190,120,204,167,190,164,149,58,190,115,33,223,62,253,150,172,62,53,165,209,60,143,10,187,62,209,57,20,190,13,35,37,63,174,129,224,189,13,12,74,63,94,206,190,61,126,186,69,189,125,129,30,62,116,147,172,188,203,203,56,62,32,29,138,190,218,69,176,62,186,79,179,60,26,212,34,61,12,79,32,191,112,8,185,190,8,69,28,190,151,73,137,62,51,90,1,63,238,226,209,190,137,132,70,63,105,91,248,62,68,151,141,62,167,244,25,191,237,166,56,191,104,164,8,190,112,75,37,190,97,161,185,190,24,4,164,61,171,147,4,63,39,135,248,190,172,171,148,190,27,219,16,190,247,56,63,191,52,23,141,61,28,118,180,189,212,145,166,188,73,105,176,62,125,106,236,188,83,239,23,62,180,249,83,191,117,192,138,62,19,9,194,190,238,141,17,63,238,159,14,63,28,25,164,61,213,127,68,61,236,60,162,191,134,62,61,190,123,212,27,63,224,153,184,189,127,178,40,61,241,171,43,191,246,233,87,191,125,154,161,62,43,219,143,62,179,98,113,190,74,182,215,62,98,145,167,62,154,156,246,190,177,157,2,63,7,132,98,63,208,250,90,191,122,194,84,190,33,165,62,189,7,247,15,63,222,19,201,62,206,90,57,63,100,130,68,189,165,133,6,63,204,114,234,62,78,76,149,60,221,42,72,62,49,35,72,62,33,83,245,190,133,56,16,190,253,3,195,62,226,88,8,191,100,32,140,190,228,17,205,62,34,38,162,62,185,145,60,63,59,23,9,191,209,186,26,191,106,59,68,188,254,94,147,191,198,68,36,191,186,131,178,62,41,149,104,191,219,84,184,190,140,122,167,62,198,18,175,62,108,235,172,190,235,76,94,191,216,60,55,62,248,245,144,191,22,247,25,62,218,253,168,61,168,116,64,191,51,122,248,190,164,176,219,62,204,225,163,190,226,18,229,62,234,92,148,62,77,109,236,190,156,35,84,191,66,143,194,188,139,206,17,63,250,139,46,191,6,77,174,190,46,100,204,59,220,112,168,62,26,210,146,62,49,144,147,62,102,162,19,63,90,20,56,191,197,210,83,191,38,166,58,189,154,49,149,189,122,48,190,61,50,5,5,63,175,44,220,62,12,203,233,62,181,150,220,62,73,84,154,191,58,76,57,63,118,144,115,191,189,65,152,191,1,110,95,62,19,209,21,190,225,253,104,60,58,220,32,189,233,162,174,189,144,156,132,62,40,153,156,191,168,64,168,62,191,5,81,62,38,170,99,191,182,66,6,62,86,129,37,190,41,58,162,190,198,149,59,191,76,142,220,189,147,59,4,63,231,246,55,191,166,58,139,191,51,80,144,62,130,196,192,190,73,91,192,190,0,229,202,62,213,81,228,189,50,124,160,190,231,57,77,191,212,198,206,189,138,84,20,63,150,100,4,63,73,149,251,62,25,155,31,62,206,180,83,62,38,0,51,62,79,108,87,62,186,108,70,190,110,16,116,62,216,90,10,190,181,184,219,190,228,202,30,61,17,50,131,61,81,20,250,60,107,234,11,190,76,201,124,190,76,60,30,62,223,36,11,63,50,72,211,62,111,237,214,62,230,169,30,190,112,126,236,190,31,83,97,62,153,59,251,189,137,54,34,63,76,120,148,62,102,109,153,62,124,168,109,190,53,32,138,190,17,93,95,190,136,240,4,189,249,217,140,61,107,200,60,190,250,64,162,189,202,126,138,191,10,227,131,61,122,120,29,63,29,125,240,190,150,19,10,63,226,220,0,63,245,139,221,61,150,150,139,189,160,15,29,62,234,147,218,189,71,176,57,190,64,203,190,190,28,120,142,191,132,234,132,60,65,122,204,62,80,3,130,62,82,164,87,62,61,185,40,190,228,103,52,63,59,114,141,61,13,50,9,63,161,41,84,189,252,52,54,62,121,182,232,62,116,253,16,63,219,44,183,62,149,228,36,63,47,228,183,61,48,163,194,190,164,247,13,191,67,240,173,190,124,225,123,62,99,171,188,62,119,191,14,62,80,94,13,190,52,244,171,190,163,14,239,62,14,24,243,190,124,12,88,191,194,124,211,61,124,124,140,190,93,246,204,62,68,8,52,190,16,113,8,63,194,236,228,62,104,126,155,190,232,185,245,61,111,174,235,60,240,164,30,191,93,176,146,61,69,236,134,62,49,57,146,190,107,225,175,62,76,36,160,190,208,81,239,190,110,114,45,63,71,45,195,62,87,70,11,63,224,17,38,63,1,1,48,61,219,204,92,61,166,176,16,63,175,153,87,60,4,110,196,189,159,33,151,62,219,0,10,190,150,143,197,62,55,143,244,190,2,96,192,62,208,158,108,61,232,87,174,62,117,180,62,63,98,157,26,191,5,189,98,61,11,219,159,190,50,70,142,191,22,59,163,190,75,163,127,191,162,255,169,62,158,130,214,62,203,182,75,63,125,243,193,62,77,80,33,63,63,96,29,61,153,4,64,191,125,39,215,190,84,54,22,191,139,222,26,190,213,51,86,62,33,135,5,63,107,85,175,62,65,145,132,190,95,120,30,61,120,22,95,62,148,140,138,190,88,59,162,62,209,91,88,191,41,88,98,191,204,162,148,191,195,138,105,62,72,70,101,189,183,188,83,63,212,136,97,188,229,207,83,190,79,223,6,190,79,171,15,63,170,64,201,62,18,60,186,191,162,117,255,62,158,179,149,190,59,12,232,190,143,137,39,191,42,225,229,62,32,52,205,190,24,6,33,63,9,101,255,62,66,229,175,61,234,62,204,190,217,219,132,190,57,167,137,190,167,195,32,191,151,38,94,62,167,44,229,186,226,203,34,190,26,172,8,189,62,185,72,63,206,152,40,190,193,63,176,62,41,236,144,190,60,133,175,190,52,153,133,62,182,104,161,62,240,16,79,63,86,95,48,190,51,114,96,62,220,49,39,60,161,131,111,62,71,194,135,191,66,35,205,190,131,94,77,63,203,204,185,191,117,131,181,62,76,1,59,63,173,24,131,62,24,160,137,190,40,70,19,62,101,180,64,191,96,143,120,191,21,242,9,191,121,122,228,62,201,210,157,62,157,88,244,62,147,50,176,62,233,253,91,63,202,147,78,191,147,87,220,62,124,124,150,191,99,58,237,61,235,139,133,191,225,28,72,191,167,125,3,63,220,65,154,62,72,67,76,191,194,94,0,191,47,160,240,190,216,233,97,61,250,54,163,190,231,200,40,190,123,100,237,189,233,128,249,190,133,72,237,189,208,193,185,189,83,118,225,62,178,60,164,61,183,117,41,63,163,205,219,60,252,132,191,62,22,233,148,190,248,117,125,62,218,173,23,63,36,175,209,190,96,122,171,191,24,190,142,191,55,181,140,61,41,154,0,63,76,137,40,63,171,17,75,191,230,109,249,190,30,60,161,190,109,44,107,190,140,106,4,189,69,214,188,62,40,217,117,191,240,155,29,191,206,6,119,63,181,208,69,62,65,50,129,60,52,153,5,191,228,218,152,61,70,215,39,191,74,133,232,62,161,54,121,62,14,169,195,62,219,68,72,190,0,242,200,62,118,82,152,190,186,192,180,190,6,57,95,62,138,197,89,62,173,1,26,63,4,251,28,63,40,130,20,191,238,143,212,62,99,17,175,62,225,67,31,62,162,232,222,191,193,13,242,190,105,105,73,62,153,15,106,61,194,223,237,60,9,45,219,62,145,5,59,62,0,227,18,191,79,93,244,190,29,232,238,62,15,32,48,190,234,129,148,190,1,56,110,62,200,214,153,61,14,7,38,190,228,174,170,61,243,213,237,62,223,229,102,62,52,155,164,191,119,59,233,62,168,211,152,189,157,144,248,62,166,167,0,62,144,216,75,191,139,56,63,191,147,225,53,62,162,2,3,61,127,64,140,191,222,65,249,190,62,41,138,190,215,104,26,190,107,115,206,62,155,244,145,190,238,170,185,62,185,26,186,190,249,186,244,190,43,55,144,190,11,1,41,190,85,219,147,191,8,125,165,62,140,129,182,62,224,166,136,62,163,249,194,190,63,185,134,62,18,249,67,62,115,201,157,190,57,80,97,191,97,127,125,62,138,225,130,191,71,25,112,191,244,39,175,190,100,60,96,188,75,92,236,62,243,170,95,63,239,80,13,63,104,138,241,62,18,86,109,189,119,101,160,62,0,195,185,61,118,58,89,62,149,196,35,62,84,223,129,62,213,122,55,61,127,224,18,62,202,53,55,63,114,192,251,190,110,153,255,189,185,163,222,190,141,47,134,190,77,88,205,62,160,160,224,189,7,7,230,190,135,161,45,62,202,202,11,63,138,65,112,62,252,20,3,190,236,189,133,62,200,55,21,63,34,172,239,62,73,195,37,190,64,22,57,61,105,210,12,62,10,110,29,62,192,56,163,62,85,127,227,61,60,148,233,189,239,153,184,62,51,150,9,191,214,119,239,190,189,75,161,191,180,104,98,191,179,39,223,189,22,134,124,62,232,254,185,190,83,3,141,62,229,231,169,61,155,154,205,62,251,106,143,190,81,243,27,190,252,96,142,190,5,61,191,188,194,151,243,60,184,223,102,62,109,11,154,191,42,137,180,189,119,87,23,62,106,160,205,190,101,230,53,190,136,194,253,62,74,87,55,62,141,14,186,61,97,107,6,191,61,232,134,191,87,67,10,62,240,123,185,189,106,114,168,190,32,228,25,63,9,213,242,59,23,238,224,62,86,189,196,190,40,220,70,190,126,206,90,191,40,145,1,63,129,148,35,189,90,141,96,62,52,88,139,190,251,25,10,190,131,69,16,191,170,235,75,61,64,43,129,191,206,187,165,190,62,133,28,62,239,236,191,190,255,173,82,63,30,85,55,191,153,50,6,62,122,237,62,191,81,55,32,191,82,153,235,190,105,66,53,63,80,217,111,184,183,128,113,190,29,48,206,189,14,230,136,191,183,125,30,191,174,246,227,190,36,136,45,61,250,98,235,60,76,147,57,62,71,12,11,191,172,205,33,190,234,215,126,62,71,4,78,62,82,35,11,191,167,216,37,63,254,175,48,61,142,167,49,191,176,197,0,191,28,211,19,191,54,143,69,191,216,116,253,188,50,245,45,63,246,27,76,191,38,228,15,190,153,19,214,189,40,35,27,191,147,126,153,60,68,154,24,191,112,89,176,62,181,115,68,191,219,184,161,190,87,233,147,62,155,139,152,188,172,183,203,61,65,53,243,190,33,33,184,190,135,245,231,62,247,160,150,188,151,119,39,191,107,241,144,62,69,165,114,190,211,104,193,190,105,255,206,62,18,148,8,190,142,118,208,61,72,250,3,190,172,116,48,191,150,241,146,62,208,135,92,190,100,55,49,62,235,162,153,191,141,116,137,190,15,217,6,191,158,253,135,62,151,198,147,191,0,236,202,62,251,46,92,62,166,90,251,191,215,110,78,61,66,192,188,62,99,36,228,188,250,151,14,191,110,69,100,60,227,104,130,191,60,194,252,190,162,50,216,62,126,99,103,62,196,81,252,61,98,89,53,63,236,120,210,190,35,110,11,191,41,213,115,62,204,154,163,190,252,49,212,62,96,100,3,63,205,42,45,191,68,180,203,61,63,224,232,189,118,168,147,189,76,10,31,61,42,2,52,191,191,83,168,62,226,26,170,62,13,250,127,190,120,106,34,62,141,151,7,63,118,3,61,190,29,174,52,62,235,169,50,191,57,205,128,62,136,152,15,190,86,68,135,189,47,217,105,190,142,92,154,63,115,122,35,62,72,20,65,189,148,136,175,61,29,172,97,62,160,14,67,63,63,184,24,63,124,245,173,61,240,123,49,62,109,22,76,62,48,253,199,62,42,63,196,190,137,51,108,191,213,46,134,62,91,228,173,190,40,23,10,62,124,139,76,61,145,16,28,190,64,106,36,191,14,242,210,190,32,171,170,62,115,77,23,191,108,21,134,61,63,129,90,191,252,133,249,61,78,171,12,63,201,160,78,62,85,250,71,190,148,37,75,186,203,169,24,62,120,92,208,62,216,233,207,190,115,202,11,189,103,169,110,62,106,109,29,190,139,125,101,190,50,246,147,190,53,156,73,191,105,22,12,63,195,18,182,62,38,255,73,62,54,36,191,191,142,39,79,61,203,238,158,190,44,206,139,60,115,217,255,190,198,169,8,63,58,186,105,62,21,130,26,190,7,133,250,62,14,47,8,63,41,126,62,190,158,70,13,191,221,139,182,59,45,137,146,191,133,219,130,191,46,126,63,191,21,188,214,190,235,150,25,63,104,197,34,62,151,147,30,191,28,254,184,62,67,124,116,191,86,26,136,62,8,179,28,63,39,226,2,63,130,68,35,190,198,210,50,191,129,123,32,191,138,54,81,63,69,67,95,191,169,87,53,63,217,102,40,61,47,194,70,189,98,73,133,61,6,222,239,190,39,122,247,60,254,108,125,61,11,73,237,190,184,129,231,62,241,44,196,62,74,197,102,61,158,246,56,191,124,138,185,190,221,60,107,60,11,165,72,191,35,101,184,190,24,68,233,62,97,135,183,61,153,120,183,190,126,50,139,189,98,252,50,61,193,114,155,190,114,63,8,190,208,112,214,62,110,236,106,60,138,113,166,190,169,217,208,62,40,99,186,62,68,229,153,61,244,165,209,191,142,170,213,62,188,252,23,190,134,215,189,61,220,243,12,62,174,68,117,62,155,39,41,191,52,222,11,191,103,127,84,62,57,173,177,62,63,192,203,61,198,19,25,191,90,12,78,62,8,41,141,61,130,92,53,191,128,238,147,190,78,196,18,191,26,150,44,62,118,221,213,189,122,201,77,191,236,210,29,62,245,65,17,63,5,252,13,63,92,114,8,63,84,126,218,189,65,94,234,190,127,55,184,62,251,238,182,190,81,119,164,61,181,175,158,190,71,201,113,190,165,208,38,191,16,21,64,191,169,21,34,191,251,251,65,190,247,219,185,190,198,107,252,62,59,169,247,62,111,11,150,62,61,84,1,191,23,226,143,190,40,175,99,61,63,220,167,62,157,133,160,190,134,99,193,190,132,199,164,190,248,3,26,191,1,93,96,189,150,129,57,62,54,194,225,189,5,26,95,63,68,226,97,190,180,167,220,190,216,126,132,191,177,95,211,190,193,151,177,62,201,202,240,62,84,154,182,60,71,202,192,189,156,29,49,190,120,125,215,62,84,149,57,62,213,144,77,191,213,18,76,190,196,251,9,61,85,20,123,62,68,173,135,190,57,51,177,62,189,84,203,62,6,81,153,191,125,245,102,62,86,46,201,61,64,158,27,63,72,136,57,189,137,93,186,62,72,255,179,189,247,247,119,190,215,43,63,191,126,193,247,61,136,189,139,190,184,112,65,62,203,211,155,62,71,44,7,63,50,115,23,62,138,224,154,189,60,25,250,61,94,213,138,62,14,209,83,190,183,138,53,190,28,159,126,190,236,134,49,61,116,85,136,189,176,14,123,62,134,140,7,191,117,121,69,62,47,29,78,62,138,153,216,62,211,121,29,191,229,98,68,62,67,131,79,63,172,106,192,62,37,255,197,189,238,210,188,188,130,242,80,190,108,173,49,189,133,111,34,191,99,129,255,190,166,69,232,62,240,203,109,61,21,105,168,191,220,250,183,62,40,0,34,191,145,99,10,191,182,162,78,190,207,255,100,62,163,114,67,190,119,101,229,190,108,226,80,190,203,134,18,63,219,24,167,188,233,189,61,189,204,241,224,190,210,11,122,190,176,116,148,189,46,161,10,61,254,159,194,61,46,92,52,61,98,86,16,190,74,215,210,189,73,169,136,190,156,246,154,61,57,210,90,62,142,240,221,189,241,36,139,62,82,252,211,190,119,174,157,188,220,64,235,62,170,89,61,191,212,35,240,190,140,145,55,191,120,188,6,63,14,134,27,190,229,236,106,62,96,145,70,62,107,207,7,191,147,131,3,63,32,9,215,190,25,72,224,190,131,17,240,189,142,248,190,190,68,35,3,63,174,248,233,62,6,33,142,62,90,140,149,190,69,123,236,189,19,19,33,62,164,60,173,189,47,255,254,190,234,78,161,190,69,76,213,62,29,56,8,190,242,175,31,191,236,110,56,191,71,254,45,190,66,113,139,61,0,201,175,62,168,180,97,191,58,210,178,62,61,242,181,189,218,204,190,62,27,135,98,191,207,74,25,190,212,32,51,62,22,7,28,191,7,135,135,189,11,197,15,191,56,202,28,190,167,215,23,188,199,235,178,191,1,234,150,61,128,51,217,190,29,27,10,63,5,173,164,188,46,26,24,191,221,10,11,61,64,106,88,190,158,9,80,191,4,45,162,60,19,241,145,62,30,150,15,63,155,253,43,62,63,243,103,191,86,225,42,63,215,33,171,190,49,109,7,191,78,102,182,62,177,124,193,62,197,219,225,190,243,182,56,191,222,166,211,62,191,70,244,62,11,137,12,63,192,16,166,61,160,87,8,191,212,85,28,63,228,214,142,62,3,48,56,191,85,58,191,62,179,0,214,190,96,116,225,190,238,81,69,191,200,81,165,61,100,82,121,190,55,190,53,61,40,198,150,62,67,175,159,190,61,230,111,62,132,134,32,191,82,146,18,189,7,146,123,191,81,176,184,62,173,128,214,62,74,235,142,190,140,125,148,190,157,211,157,190,134,52,151,189,156,135,198,190,74,50,142,190,15,228,207,186,103,210,179,190,187,198,237,62,169,168,104,190,115,237,79,191,233,124,127,62,8,122,54,62,14,84,169,191,248,172,205,189,4,25,198,189,232,207,135,61,234,157,203,190,59,17,169,62,139,113,174,187,145,84,184,190,6,199,18,191,159,214,68,62,109,127,166,190,28,14,229,189,186,14,193,62,29,90,230,62,202,191,0,191,60,191,173,190,216,30,29,62,89,252,157,62,125,126,137,190,125,170,116,62,18,241,162,190,135,214,53,191,35,209,207,62,227,32,132,190,218,64,162,62,253,49,35,189,160,47,6,190,171,61,210,190,6,163,208,189,138,54,14,62,79,209,86,61,158,105,149,62,52,81,151,189,161,72,219,62,82,0,145,62,148,205,10,62,223,122,132,191,12,95,135,191,171,85,51,191,52,20,183,190,64,237,37,190,210,93,114,191,60,103,20,62,27,190,162,190,47,96,207,189,120,135,217,189,222,159,87,190,82,19,79,62,137,52,92,190,89,34,216,62,103,249,2,191,143,108,163,190,64,45,24,62,170,90,106,190,166,87,7,63,196,52,173,190,172,114,219,189,50,225,136,188,91,49,127,190,0,63,221,61,210,239,205,190,26,121,8,63,134,125,113,187,53,215,241,190,123,125,17,63,253,231,47,191,55,143,159,190,10,9,166,62,55,64,248,61,229,224,124,190,251,195,29,62,220,224,133,62,252,140,157,62,59,246,198,190,191,124,91,62,51,128,24,191,84,224,39,63,8,123,38,190,244,22,249,62,20,73,144,190,135,104,17,190,198,110,0,191,234,17,69,62,53,64,123,189,62,58,134,62,15,112,129,62,87,207,72,191,97,83,15,190,220,63,20,190,64,250,49,191,57,75,237,190,48,20,15,63,206,219,94,189,158,144,159,62,186,189,36,191,242,80,33,189,120,78,147,191,200,25,17,189,205,87,12,63,233,217,36,191,218,99,211,61,156,132,216,62,232,52,228,62,215,64,137,62,72,82,227,189,70,231,41,189,135,251,171,189,62,233,175,62,153,36,18,63,231,164,154,62,98,109,32,191,244,54,201,190,157,79,41,189,121,32,144,190,39,186,99,190,228,163,36,61,91,185,52,190,253,128,53,191,249,3,32,189,80,16,134,62,226,219,8,190,92,0,87,189,221,43,128,189,148,39,158,190,176,49,185,190,63,214,128,61,159,208,14,63,206,177,131,190,212,106,174,189,149,17,187,62,204,210,166,62,102,78,170,190,83,194,43,191,130,103,18,61,251,101,183,62,200,9,79,63,169,186,97,62,150,129,58,62,120,116,12,187,138,170,2,62,168,9,202,190,17,237,179,62,185,224,104,62,149,251,129,62,3,241,246,190,223,143,229,61,145,94,63,62,218,184,188,190,226,103,98,190,246,206,129,191,252,126,33,188,83,3,164,190,123,144,139,190,135,243,195,190,65,15,193,62,126,140,143,62,172,83,251,190,123,70,40,61,132,50,72,62,188,197,198,190,109,197,213,189,246,135,130,190,14,245,251,189,187,254,193,62,114,175,113,190,171,22,38,191,211,197,207,188,210,171,33,62,28,30,194,190,77,32,168,62,246,206,8,191,20,19,91,62,3,162,156,60,32,32,200,190,225,89,226,62,194,216,43,191,48,149,246,62,32,71,15,62,86,87,66,62,197,152,106,62,175,18,37,62,178,187,175,62,242,189,171,190,145,172,172,189,63,160,185,190,255,253,63,190,126,41,69,62,122,144,128,191,249,165,200,60,214,207,18,191,76,8,19,191,186,64,199,189,124,225,202,62,35,120,73,62,155,102,217,190,146,168,154,190,159,194,163,190,245,38,242,62,46,57,20,191,228,91,63,190,193,109,10,62,51,242,76,60,153,12,188,190,154,231,126,190,219,68,133,62,165,35,41,62,223,104,179,60,74,29,205,190,145,32,13,190,215,157,24,62,215,204,217,190,196,117,209,61,97,116,192,62,17,170,8,63,13,165,80,190,65,157,91,61,14,87,169,190,71,150,77,62,223,41,71,62,43,68,194,190,64,216,41,191,77,35,177,190,204,232,37,190,220,243,70,62,59,170,142,190,118,117,113,190,184,151,145,190,143,196,30,191,8,177,8,189,235,95,157,61,180,76,96,189,166,238,47,63,32,187,190,190,5,184,14,63,96,80,148,61,169,36,112,191,48,219,135,62,122,186,145,62,144,140,68,63,110,155,163,188,39,148,154,62,218,96,141,62,205,148,126,191,90,178,122,186,176,251,199,62,27,61,58,190,244,90,0,190,202,169,62,191,81,162,26,62,235,18,154,62,63,216,247,190,229,12,186,191,154,194,222,190,37,142,196,191,23,80,39,191,254,47,38,63,249,226,125,191,29,170,51,190,32,191,90,191,57,198,165,59,150,100,88,189,181,25,1,63,143,139,85,191,60,235,57,190,188,136,225,62,126,2,0,191,39,248,26,63,249,96,152,190,118,20,24,63,10,237,68,62,243,130,161,189,78,100,1,191,42,139,186,60,9,183,2,191,165,215,102,63,187,183,0,191,155,193,113,62,212,17,157,189,52,18,190,190,143,1,238,62,85,49,28,63,24,226,164,62,213,236,173,189,76,40,54,191,208,250,213,190,218,62,71,190,217,64,133,62,135,146,100,62,56,251,248,62,187,255,43,63,230,119,133,190,24,147,190,61,72,96,39,190,112,204,24,63,58,166,133,191,194,226,19,61,191,203,220,188,76,130,232,62,23,156,133,189,72,226,190,190,90,121,6,63,225,2,55,62,63,20,31,61,136,76,39,191,145,106,84,190,181,57,41,61,163,180,87,63,214,247,141,62,201,98,6,63,144,93,196,62,195,134,29,190,209,42,39,63,202,244,28,190,46,169,42,191,94,55,77,61,101,184,167,189,2,139,86,186,46,181,99,190,3,128,64,61,120,45,254,188,185,46,186,190,31,98,0,62,136,102,249,188,238,135,134,190,181,246,161,189,106,252,17,62,191,53,154,61,251,56,243,190,114,107,197,62,111,116,88,190,51,154,215,189,42,54,54,190,90,105,136,62,85,12,76,61,181,122,108,191,107,65,0,63,70,253,201,62,43,143,235,62,99,95,187,62,221,26,73,191,178,72,9,191,77,80,235,190,108,214,13,191,218,142,128,190,28,121,65,191,133,93,46,190,164,39,153,62,74,12,39,191,100,109,172,190,251,214,38,191,17,52,235,189,175,240,246,59,141,158,9,191,201,144,38,62,149,106,244,190,49,215,140,190,224,26,206,190,91,154,247,62,56,213,24,63,38,60,96,191,180,142,254,190,98,148,22,62,58,150,13,61,43,169,196,62,222,9,95,62,66,190,22,62,76,131,112,191,197,105,160,61,224,92,224,62,80,143,145,62,191,164,187,62,181,36,140,190,132,208,65,191,126,89,85,190,215,38,228,190,83,84,59,62,49,237,126,190,103,183,0,63,82,109,151,62,175,11,38,191,167,138,148,62,91,206,231,190,195,60,15,62,157,25,118,189,70,183,252,61,36,186,164,62,88,193,73,190,154,75,34,62,194,234,25,190,104,135,215,188,127,153,89,62,247,186,180,190,194,237,208,190,194,124,64,191,48,98,129,190,111,43,9,191,0,23,141,62,77,217,113,61,188,198,90,62,162,135,164,190,49,34,28,62,63,26,68,191,63,57,7,190,116,168,29,190,9,110,2,191,146,209,136,62,137,101,137,62,177,196,165,61,222,13,4,191,176,157,130,189,87,131,56,62,92,138,136,190,66,162,239,190,144,94,172,62,110,83,64,190,201,50,26,63,108,208,141,190,29,1,148,62,182,216,9,191,104,14,79,62,55,71,110,190,190,104,7,63,20,223,89,190,189,34,247,190,62,213,0,191,195,242,50,191,143,180,117,61,228,142,4,63,166,3,84,62,250,43,224,58,164,241,132,62,177,245,221,61,179,229,165,61,231,184,64,190,114,210,246,190,170,85,114,190,39,168,203,190,62,135,197,62,27,52,255,61,153,93,201,190,128,77,45,191,225,84,250,189,158,94,247,189,118,125,132,191,181,174,12,63,200,129,162,189,98,13,43,191,1,4,39,191,188,132,118,62,116,156,98,62,21,68,144,62,149,236,62,191,203,146,159,190,64,100,154,191,101,92,201,187,178,236,216,62,163,169,70,190,132,83,154,190,104,128,245,62,94,55,119,61,224,67,173,61,116,178,204,189,140,230,160,62,15,242,143,190,81,81,231,190,240,129,40,62,16,220,55,62,62,103,115,62,23,95,219,62,240,203,89,191,234,48,164,190,107,148,92,61,218,153,229,62,220,169,163,190,124,210,245,189,250,59,181,62,136,52,86,62,61,243,91,62,32,43,70,191,209,102,24,190,185,4,11,62,126,47,173,62,7,157,223,189,22,52,15,62,209,49,201,189,164,73,11,60,172,232,228,62,19,52,93,191,70,142,137,61,205,199,50,191,188,110,131,62,14,134,31,191,110,66,177,61,186,216,2,61,133,145,92,190,144,237,42,191,11,152,100,187,238,189,149,189,36,60,6,191,174,220,1,191,48,179,19,191,123,120,37,63,167,126,102,62,212,178,143,189,53,246,91,190,45,218,10,191,173,231,153,190,248,114,222,62,26,182,31,189,150,203,21,191,217,206,123,62,184,72,95,62,226,21,33,63,42,102,145,190,44,45,88,63,26,136,222,190,136,6,129,61,145,80,125,190,143,75,12,191,224,214,153,61,26,103,48,190,152,33,41,189,132,78,39,191,72,168,210,190,148,189,1,63,231,24,14,63,141,169,11,63,114,143,177,61,123,157,132,61,158,56,163,62,141,110,21,191,28,34,93,62,155,175,100,190,145,226,63,191,168,201,55,62,148,217,187,62,67,43,128,62,139,45,141,190,16,82,134,62,203,2,236,190,219,30,100,63,254,3,245,190,81,56,118,62,7,0,184,62,245,13,75,190,154,108,184,61,167,72,14,61,140,201,24,191,116,111,168,62,174,37,189,190,5,184,14,191,226,229,113,190,26,190,83,190,41,247,184,190,139,36,176,190,227,134,138,189,177,154,209,190,196,34,90,62,235,156,58,190,183,234,160,191,110,192,24,191,127,243,156,190,221,135,253,62,142,204,85,62,102,20,231,190,151,216,219,62,246,211,51,191,164,27,218,189,76,113,62,191,218,119,224,62,160,105,142,61,108,193,17,61,30,84,177,189,36,104,234,62,135,139,206,61,246,161,99,190,141,240,40,190,48,156,186,189,172,164,172,62,245,97,185,61,22,46,217,190,27,6,219,62,142,181,69,191,224,216,174,190,6,63,217,189,134,185,23,62,249,33,59,191,122,81,15,63,229,63,247,189,69,43,32,190,173,221,100,191,136,58,217,62,161,240,153,190,247,57,13,190,203,208,90,63,151,202,222,191,100,198,96,62,247,202,25,62,56,109,96,190,249,30,237,61,149,178,166,61,36,110,155,61,192,242,53,191,199,144,29,60,50,71,234,189,218,30,33,62,143,10,15,63,136,21,235,61,54,211,11,191,19,54,238,189,47,156,59,190,224,162,124,62,219,71,59,191,135,66,160,62,129,125,28,191,202,144,52,190,107,161,22,191,192,63,91,62,178,54,58,62,252,209,136,62,167,89,155,190,115,177,158,62,187,74,151,62,12,73,82,189,8,180,176,189,131,95,181,62,1,132,159,62,37,215,3,191,82,51,34,191,185,12,33,191,198,249,112,62,138,44,193,62,164,69,2,191,29,148,234,190,204,240,35,61,204,147,239,62,17,189,131,190,93,254,48,62,225,43,178,62,54,63,80,191,27,56,46,189,201,75,118,190,38,23,95,191,2,234,199,61,130,3,124,62,238,103,246,61,141,70,231,62,99,125,81,61,198,169,130,62,18,48,112,191,159,4,150,187,205,245,80,61,64,64,88,190,112,36,173,62,50,97,49,190,248,123,187,62,136,34,190,189,88,74,43,63,215,190,89,61,190,25,228,190,126,113,82,191,91,114,129,61,204,213,47,191,16,109,54,191,76,6,37,191,48,94,47,190,133,252,149,62,190,3,76,190,201,60,56,61,74,162,235,60,78,16,93,191,67,49,148,190,32,13,58,63,9,146,235,62,249,130,175,190,158,185,201,62,39,54,95,189,187,92,98,189,68,171,229,190,97,226,220,62,129,70,46,190,74,120,193,61,191,164,46,62,70,143,210,190,242,38,40,63,14,7,202,190,5,60,33,190,179,103,8,190,89,10,44,63,208,26,161,62,79,254,7,191,134,218,3,62,98,213,41,63,102,119,13,189,211,19,246,61,108,79,239,61,108,200,118,190,154,68,172,190,43,50,183,62,64,4,81,63,194,193,165,62,183,223,94,190,204,148,32,190,17,26,131,62,123,106,165,61,12,61,152,190,31,53,139,191,180,179,146,189,47,63,80,63,221,91,241,190,122,190,216,62,60,86,92,62,148,91,244,189,228,85,39,191,149,28,34,191,254,56,18,61,177,45,19,60,227,20,208,190,233,102,235,190,114,20,67,190,117,150,192,61,185,25,158,62,152,109,9,62,219,3,121,61,132,198,15,63,36,156,163,186,115,132,57,62,216,66,13,191,224,34,131,189,33,130,161,62,154,188,55,190,176,39,231,190,8,128,203,190,133,79,28,191,117,139,162,190,53,170,158,190,83,98,2,190,212,128,60,190,59,170,166,190,32,113,195,190,178,127,33,59,159,32,38,191,146,11,80,62,76,24,152,191,135,97,138,62,135,222,14,191,189,88,46,63,254,52,135,62,141,18,129,189,199,74,172,62,143,83,84,62,184,35,140,62,193,36,117,62,153,193,110,61,74,198,69,191,35,108,23,62,151,248,242,62,35,139,177,190,174,15,223,61,185,218,151,190,108,214,83,62,125,54,83,190,13,186,238,62,53,49,115,189,123,9,10,190,23,102,175,62,155,34,156,188,174,22,213,62,9,206,0,191,22,220,51,191,76,190,4,191,236,249,197,61,86,183,155,61,189,193,74,62,245,17,198,62,