{"meta":{"epsilon":0.13506801426410675},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[208,249,184,62,53,19,73,62,68,123,2,62,108,189,125,190,22,43,191,190,71,235,106,62,34,22,187,61,11,186,38,62,73,9,170,62,73,74,194,62,36,119,124,62,133,175,27,62,29,224,146,62,137,29,0,190,29,50,176,62,192,164,213,62,227,189,42,190,92,144,246,60,77,230,200,61,92,156,153,188,49,119,133,189,128,52,247,188,150,53,1,63,100,81,229,62,197,248,148,190,206,37,45,190,75,204,0,62,104,213,161,189,231,173,129,60,160,236,159,62,203,83,140,61,107,38,217,62,37,133,154,62,98,79,68,190,59,22,206,190,138,190,208,62,59,84,177,62,227,96,233,62,113,102,112,62,82,215,201,61,235,168,231,62,88,136,251,62,221,64,52,62,29,195,148,189,144,57,255,188,35,177,68,62,72,17,141,190,30,184,13,62,149,13,156,190,215,240,239,62,205,79,112,61,22,26,201,186,193,252,60,190,51,78,152,62,204,187,230,189,40,64,183,189,142,253,199,189,211,95,122,62,143,155,42,62,71,71,254,60,76,143,198,190,219,105,186,62,133,180,26,190,150,126,16,191,250,100,101,191,136,138,185,190,84,43,176,60,179,13,8,62,23,71,188,188,112,30,253,189,75,89,133,62,210,89,5,190,225,124,15,62,129,5,253,189,16,140,125,62,222,26,234,187,195,216,93,62,93,184,99,62,42,16,0,189,70,224,144,189,134,77,157,190,250,121,128,62,14,70,57,61,161,19,91,190,69,189,192,62,34,29,166,190,54,152,131,61,241,170,102,62,214,137,255,187,252,195,203,188,225,61,80,190,50,27,100,62,163,132,8,191,8,212,9,191,206,143,251,61,54,146,159,61,224,214,245,62,20,225,61,190,115,112,212,190,37,125,73,190,171,55,162,62,113,27,157,62,218,224,148,61,225,179,1,62,74,11,47,188,1,225,148,62,154,201,249,62,22,228,100,189,129,163,71,62,206,135,72,62,151,184,10,63,206,104,157,190,44,153,82,190,45,114,96,60,69,199,0,190,145,192,255,190,127,108,250,186,150,165,141,62,150,88,149,189,141,54,27,190,3,174,219,61,43,142,251,62,171,161,212,62,58,223,150,189,78,29,164,61,36,218,69,62,197,252,232,189,18,40,15,190,104,149,240,190,108,229,116,62,192,2,16,61,195,108,227,61,95,12,90,62,47,126,219,190,69,175,86,62,232,133,31,62,153,103,50,63,38,166,8,60,154,249,205,62,91,126,253,190,149,144,128,62,135,111,193,189,64,244,242,60,70,84,36,189,244,215,142,189,113,98,243,61,131,147,107,190,117,130,75,62,93,4,47,189,212,115,44,62,202,144,214,190,69,220,13,63,206,57,181,61,217,106,156,62,196,161,75,61,198,0,192,189,152,42,22,63,213,179,9,61,40,223,174,190,72,174,169,61,69,138,209,189,91,69,51,189,118,142,44,191,134,198,176,189,102,150,173,62,86,246,203,62,161,188,162,60,111,164,81,62,212,129,62,62,32,24,246,61,249,21,126,190,70,15,6,63,204,42,243,61,252,67,141,189,39,255,175,190,27,44,161,62,66,200,141,190,41,66,102,190,105,2,91,62,34,196,150,62,45,41,247,190,106,102,92,189,233,8,134,62,2,121,79,61,102,203,253,188,86,223,140,190,8,48,55,62,38,108,211,189,9,80,131,62,125,131,39,63,176,126,138,190,217,246,162,190,162,10,26,63,75,162,19,62,185,20,65,62,141,242,130,62,4,6,199,62,225,87,140,190,163,146,0,190,107,213,196,189,44,185,37,62,89,147,8,189,121,137,8,190,173,119,226,61,81,87,63,61,162,76,231,189,135,22,138,189,27,168,130,62,21,140,60,190,230,128,29,62,60,170,253,190,198,171,71,189,4,123,60,61,140,15,72,190,165,46,143,62,48,73,225,61,103,91,22,189,149,175,141,62,22,113,37,62,222,184,162,188,112,231,27,190,96,43,156,190,222,184,177,61,9,195,84,62,196,38,159,61,2,4,177,62,213,49,21,190,232,101,91,189,227,214,58,62,103,66,31,191,8,237,63,190,50,107,206,62,77,74,48,61,234,137,104,62,160,40,78,189,192,163,182,59,117,36,11,63,177,209,137,62,28,208,193,61,141,126,211,62,122,80,44,63,8,183,63,61,226,32,45,62,122,10,173,60,90,135,220,190,231,76,254,61,161,204,208,190,132,202,196,189,165,192,107,62,217,223,18,63,1,206,98,62,197,239,102,190,159,122,145,62,161,80,219,189,22,9,12,63,205,122,140,62,5,39,145,60,100,17,7,62,198,194,67,191,26,231,205,62,29,134,199,189,238,112,144,61,148,216,60,190,101,137,57,61,170,129,37,61,3,39,62,190,126,31,4,63,204,250,101,62,28,170,191,60,196,8,211,61,67,44,14,62,3,107,245,188,18,129,183,62,100,161,88,62,161,216,49,189,237,100,137,190,37,44,152,189,252,113,139,62,58,182,121,61,34,170,11,190,239,249,31,190,136,165,214,189,0,125,63,61,113,120,187,190,28,169,30,190,215,119,4,62,40,159,197,189,33,187,62,189,118,25,90,61,208,146,188,189,34,173,107,190,133,223,105,61,195,87,7,63,9,179,191,61,18,7,57,190,195,53,34,62,177,246,14,190,214,73,145,188,172,126,236,62,135,93,13,191,184,238,157,62,88,217,102,62,52,211,202,190,145,77,140,62,118,42,139,61,208,172,173,62,47,181,1,61,111,226,169,61,77,147,149,61,19,204,78,62,128,143,188,186,201,52,25,63,67,114,112,190,3,63,27,62,121,7,52,62,163,250,12,63,188,110,31,190,20,235,35,189,221,63,147,189,79,118,237,61,39,247,163,62,245,241,68,62,175,235,8,63,107,231,195,190,178,119,223,188,175,226,37,190,130,74,65,189,216,2,177,62,97,221,182,62,228,121,26,190,95,146,144,62,46,197,201,60,204,181,44,190,181,201,182,62,224,127,168,61,129,15,158,62,207,161,226,190,239,138,32,62,162,80,86,60,137,3,196,190,68,131,173,61,111,182,152,190,195,221,242,62,127,54,150,62,226,48,76,189,93,130,37,188,0,107,78,190,44,19,221,190,93,115,234,190,155,127,251,189,207,12,9,62,253,196,55,62,80,176,172,62,66,21,30,62,204,170,183,61,67,45,180,190,80,233,94,62,251,151,85,62,131,252,252,189,178,94,244,62,116,14,234,62,123,22,137,190,147,37,252,61,170,89,203,189,59,2,228,189,52,61,121,189,177,196,113,62,30,211,67,190,223,252,203,62,130,249,76,62,80,155,206,189,5,241,11,63,127,110,168,62,185,180,243,62,194,239,156,190,21,81,70,62,64,80,58,190,244,50,225,190,144,80,235,61,231,116,97,190,53,34,170,189,244,11,137,62,71,67,160,189,126,37,113,62,168,180,129,61,26,73,32,190,121,147,165,60,24,27,38,62,23,52,141,62,76,56,220,62,59,216,1,62,40,95,60,188,172,110,112,61,111,58,184,62,70,131,164,190,12,40,164,61,50,183,85,190,7,30,2,63,224,203,170,190,191,226,136,62,77,229,50,62,45,79,198,188,235,22,173,189,157,202,172,62,187,113,6,190,184,177,17,61,19,203,123,190,238,243,18,190,119,204,180,61,37,101,20,61,147,141,145,59,166,246,125,61,23,144,105,61,111,157,118,190,238,98,138,188,135,75,209,62,227,223,158,189,30,161,16,190,121,210,184,62,58,59,143,191,91,170,87,61,101,24,219,190,209,22,218,190,37,226,191,189,21,34,155,62,86,160,120,61,149,39,125,190,234,87,30,62,45,182,220,62,27,113,77,190,65,113,142,61,103,10,244,61,11,251,206,62,103,108,39,61,48,155,50,62,210,135,36,62,219,133,174,61,1,139,171,60,164,150,14,190,169,250,26,63,177,77,147,62,16,58,199,62,11,72,100,190,80,242,214,62,189,149,115,190,205,156,89,62,84,144,108,190,227,119,58,189,232,189,15,62,14,179,212,189,157,65,211,62,22,40,213,189,99,133,26,61,104,135,15,62,31,59,68,190,140,207,243,62,8,30,236,62,122,18,8,190,232,43,104,190,203,110,185,188,174,27,185,190,159,213,8,190,40,191,182,61,117,230,6,191,133,164,58,61,20,14,43,63,122,154,149,61,195,244,76,190,38,199,243,61,126,0,183,62,31,211,154,189,251,173,29,191,20,46,72,61,91,255,143,62,7,247,151,62,184,241,213,187,75,67,29,191,228,192,247,188,136,125,17,61,162,97,67,62,214,216,213,190,100,95,5,62,131,247,165,190,71,120,143,190,34,58,234,61,118,43,245,62,132,82,209,190,158,149,147,62,248,235,18,191,27,225,241,62,30,244,155,190,83,208,155,62,58,121,147,190,187,255,78,62,36,151,112,190,169,192,6,61,126,196,214,62,49,229,1,190,179,52,189,61,172,233,253,190,253,219,75,60,2,211,175,190,46,9,196,62,171,5,243,62,189,177,222,189,253,144,227,61,55,179,248,62,117,54,194,190,117,178,162,62,192,84,18,61,102,170,88,190,150,97,51,62,244,39,187,61,64,67,49,61,254,231,136,61,16,206,186,62,151,44,168,61,20,226,168,62,33,49,248,189,51,199,136,190,95,77,135,188,168,173,96,62,105,71,131,61,72,207,196,190,155,199,238,60,213,211,217,61,180,101,235,190,194,86,219,61,249,102,221,189,96,174,56,190,95,39,223,189,102,189,27,63,155,33,252,61,158,247,231,189,14,184,233,60,16,164,178,62,53,160,100,61,18,58,6,191,186,40,91,61,110,162,65,60,244,31,4,191,215,233,135,60,53,137,169,189,222,23,89,190,224,221,48,189,133,162,1,62,47,29,71,61,86,213,45,62,208,243,47,190,71,167,144,62,159,212,217,190,138,218,1,62,108,93,203,60,168,236,45,62,139,183,153,188,146,65,28,62,203,159,83,191,33,36,234,189,236,24,159,190,76,10,137,62,189,203,139,190,194,187,88,62,3,185,162,189,147,173,160,61,162,238,37,190,29,43,38,191,118,22,55,189,242,202,6,190,162,44,219,189,144,133,220,190,83,43,6,191,193,123,37,191,21,113,18,61,207,112,206,62,187,128,123,189,226,192,112,62,160,226,219,62,72,32,251,62,12,67,50,63,174,159,83,62,252,235,238,188,180,50,8,61,98,30,37,63,111,130,64,61,149,76,207,60,223,206,171,61,245,24,193,62,171,19,231,62,254,152,221,189,93,35,173,62,138,9,158,62,124,109,176,190,153,171,0,63,95,204,126,61,195,41,0,63,66,182,134,189,90,247,91,62,213,78,149,190,110,57,23,190,212,102,128,62,252,170,198,189,58,85,70,62,76,118,196,190,25,107,228,60,201,116,131,62,41,91,135,189,214,215,238,189,147,223,4,62,149,20,141,189,228,219,51,61,189,123,7,62,81,105,50,62,24,63,231,62,146,128,29,62,101,95,211,62,253,63,52,62,140,174,97,190,17,98,150,190,92,160,10,191,128,39,105,188,191,147,149,190,196,177,14,63,77,211,152,61,241,27,28,63,168,34,238,190,187,27,99,62,79,66,207,189,146,31,158,62,166,72,223,62,53,179,49,191,153,13,216,61,17,210,82,189,247,126,54,63,100,30,168,190,145,211,9,190,72,255,198,62,133,81,219,62,123,141,71,190,148,135,226,61,56,18,156,62,21,140,246,61,179,144,45,191,79,185,184,61,165,3,27,189,254,187,0,191,194,233,155,62,98,6,216,62,248,142,156,61,240,236,136,61,125,73,99,62,12,215,25,190,235,80,7,188,115,67,17,63,82,245,118,61,132,89,152,62,73,82,222,62,158,16,153,62,238,239,30,190,102,76,28,61,81,57,110,190,13,216,27,63,128,252,36,190,29,69,147,190,91,80,88,190,33,217,243,188,46,68,172,189,48,23,241,61,163,176,242,190,23,128,16,190,185,217,7,191,219,175,67,189,112,35,61,190,223,211,7,190,119,93,14,190,131,76,237,62,47,232,150,190,62,222,147,190,219,26,100,59,113,173,146,62,74,88,11,62,183,218,166,190,204,219,117,190,193,223,28,191,8,38,133,190,205,109,145,190,83,73,21,191,56,160,25,62,73,196,12,63,28,50,246,62,48,122,67,62,124,108,113,190,184,136,195,190,24,157,64,190,124,65,191,188,4,193,180,190,134,106,82,189,61,198,23,190,11,35,204,61,111,153,102,62,24,92,219,61,71,156,82,61,157,94,227,61,232,139,190,61,171,15,165,190,65,11,68,62,66,202,85,62,124,61,217,62,208,82,203,190,4,97,132,62,253,107,15,62,158,120,231,61,54,160,186,190,114,55,131,189,48,169,54,190,8,220,185,189,10,87,67,62,126,71,8,63,169,152,113,189,46,61,39,62,253,7,198,62,196,151,132,61,213,62,135,190,220,96,249,61,2,7,203,188,171,198,131,62,188,11,63,62,147,105,14,63,1,248,3,190,125,197,68,191,89,49,26,62,242,188,78,190,103,36,207,61,149,177,34,61,33,112,159,62,181,26,84,62,101,172,144,62,195,49,202,190,197,212,143,62,33,135,167,62,218,122,151,190,111,62,171,189,195,38,216,62,236,40,13,62,47,195,217,61,10,40,24,61,107,170,233,190,87,220,66,190,3,253,85,62,225,253,29,189,134,224,178,187,5,1,254,62,59,219,73,189,166,56,242,62,40,23,246,62,235,195,177,185,17,246,225,61,78,39,204,190,32,213,212,62,251,1,189,62,50,244,142,62,205,25,152,62,60,51,43,62,156,61,8,190,61,162,234,190,107,123,113,190,203,191,38,62,81,81,27,188,6,86,234,62,108,169,45,62,56,74,52,189,38,159,25,62,106,72,1,62,43,100,61,61,13,252,86,61,158,201,103,61,98,243,76,190,75,161,54,59,76,179,133,61,76,30,153,61,106,128,29,190,18,74,39,190,177,181,17,189,220,54,4,62,174,62,4,190,108,15,74,190,80,91,67,190,95,166,141,61,140,34,154,189,55,221,109,60,245,211,174,61,193,19,124,62,164,18,160,61,126,123,165,190,69,102,58,61,166,115,83,189,149,21,88,60,149,88,183,190,56,219,61,61,141,204,195,60,45,133,82,189,201,134,101,62,16,203,20,62,73,192,6,189,210,87,22,62,208,85,135,189,145,45,54,62,129,146,109,189,108,92,93,61,13,93,147,189,227,189,36,62,19,100,190,60,254,53,253,61,209,251,159,60,78,126,125,62,191,208,159,60,150,254,224,61,12,176,131,190,130,240,15,62,164,75,226,189,56,174,6,189,135,255,160,61,77,101,33,62,64,69,2,61,162,70,194,189,189,224,158,61,5,145,161,59,142,39,120,186,124,250,178,189,152,90,99,187,193,139,43,62,87,139,12,189,255,193,224,61,125,32,138,61,33,202,177,60,219,29,75,190,61,224,34,189,21,218,64,60,114,253,245,189,233,97,255,61,184,13,165,62,22,25,25,189,42,161,105,62,119,120,30,189,31,224,24,190,108,144,53,190,193,136,180,60,232,251,63,62,192,1,240,189,216,56,227,189,71,111,27,62,64,187,245,189,24,27,21,190,45,216,107,62,163,85,81,189,38,2,49,62,126,26,48,189,31,230,179,62,59,186,34,61,68,202,27,58,197,11,130,61,159,235,160,61,210,88,233,61,115,116,157,61,151,134,25,189,37,113,36,189,167,175,203,187,102,59,37,59,196,132,110,190,238,136,43,61,26,159,152,60,110,168,226,189,93,1,242,189,149,89,94,189,103,161,87,62,181,250,232,60,153,57,183,189,34,37,37,61,244,137,217,189,221,168,76,62,131,53,69,190,245,188,201,189,110,43,74,61,161,126,10,61,53,195,156,62,105,116,92,61,210,252,218,60,39,3,203,188,194,150,16,62,191,66,173,188,34,255,177,189,76,140,198,187,91,15,150,189,38,186,255,61,78,41,152,189,34,116,49,61,156,117,245,189,170,227,179,188,47,198,204,188,189,132,187,189,173,50,144,190,27,69,203,61,172,43,22,62,173,205,86,188,47,165,249,60,9,26,67,62,236,225,53,190,255,21,176,60,232,178,100,189,75,85,9,62,221,34,119,60,174,105,143,59,73,201,43,60,66,13,205,189,4,239,130,189,147,216,200,60,236,46,161,189,158,128,229,61,166,165,113,189,55,23,246,61,76,145,8,62,124,20,155,189,174,211,150,62,64,1,91,190,206,97,188,61,213,223,201,61,214,44,215,59,141,10,102,189,24,111,197,61,170,92,79,62,14,56,52,189,161,222,136,190,218,20,19,60,119,60,157,189,112,197,105,62,161,7,121,61,172,143,181,189,38,151,59,60,127,242,25,61,160,156,17,190,17,144,20,62,39,136,189,189,51,189,166,61,58,254,83,62,255,243,75,189,136,135,14,61,139,208,77,189,223,36,192,60,31,155,210,61,131,34,46,189,180,106,30,189,132,151,216,188,49,238,241,61,89,120,122,62,124,163,245,190,228,242,13,62,86,151,233,188,221,130,44,61,116,42,141,62,107,249,231,189,9,142,19,188,15,170,45,62,63,87,174,61,12,59,202,61,229,18,252,61,252,17,188,189,129,7,165,190,107,75,19,62,27,39,233,61,93,64,42,189,150,20,66,61,21,216,31,190,89,241,62,61,255,136,18,189,8,183,237,61,106,103,53,190,134,182,142,61,103,54,93,189,72,89,150,60,68,134,187,189,137,3,233,189,144,6,113,62,254,189,89,62,51,25,64,61,56,22,251,61,150,93,232,189,134,140,64,190,222,139,157,189,171,194,103,189,35,69,103,59,176,38,75,61,60,45,68,62,140,133,236,189,49,139,148,189,254,175,84,189,164,148,252,189,178,100,42,62,109,176,19,190,133,124,139,62,15,54,55,190,220,205,223,189,33,44,244,61,169,156,198,189,87,220,91,62,23,113,107,62,192,21,12,62,146,210,161,190,95,40,72,62,230,33,240,61,108,187,207,60,226,255,46,62,117,42,28,62,204,103,98,190,114,148,205,189,123,168,3,62,150,226,48,190,99,75,70,189,184,191,244,189,61,51,16,62,166,220,168,189,248,42,205,61,238,196,39,61,120,255,212,61,122,68,194,61,71,89,33,190,111,27,37,191,253,144,186,60,164,103,137,61,158,238,14,190,107,244,168,61,225,77,81,61,140,54,131,61,242,171,28,61,182,189,74,189,52,95,175,61,190,72,98,62,86,83,253,60,155,57,135,189,50,106,77,62,225,226,97,62,2,63,47,62,79,248,111,190,15,136,220,189,1,199,252,60,164,136,165,189,116,140,208,189,11,196,2,190,134,35,212,61,1,36,145,61,103,125,79,62,114,255,234,189,136,154,91,189,103,18,145,60,141,43,138,188,194,0,66,190,210,150,186,187,111,204,148,189,211,24,87,61,41,217,185,61,143,233,250,189,83,41,83,61,104,251,57,189,7,244,44,188,171,172,152,189,200,213,246,60,218,187,108,190,26,139,130,190,9,194,35,62,201,166,79,62,133,101,118,187,184,76,248,61,238,226,10,190,114,135,36,188,5,201,220,61,111,17,184,61,214,39,10,188,56,170,24,62,123,169,45,190,248,37,30,62,142,14,188,61,69,174,40,62,77,9,115,61,8,77,16,190,180,246,61,188,203,240,187,61,10,116,17,62,111,216,134,188,40,201,40,189,62,89,51,62,108,3,97,188,61,82,42,62,12,75,28,190,108,219,141,190,107,146,15,62,131,40,57,61,90,82,123,61,64,235,182,60,87,109,51,190,24,93,20,190,136,6,143,61,55,207,163,190,93,56,74,60,238,163,149,61,149,39,13,190,5,89,132,62,51,250,223,188,8,116,144,61,2,65,197,188,249,231,210,189,129,252,69,188,226,242,207,187,58,97,164,61,97,31,166,190,213,164,118,61,132,3,99,190,152,70,129,188,215,71,134,190,217,254,136,61,206,72,45,189,79,220,169,189,241,8,207,189,53,158,152,60,162,129,186,61,83,7,218,61,9,85,181,61,71,205,72,61,46,214,7,189,109,104,212,189,196,114,87,62,79,217,217,61,190,232,145,189,24,192,142,61,122,255,179,189,26,92,122,189,41,163,91,188,209,125,164,190,2,234,186,188,214,48,129,61,245,184,218,60,15,99,202,187,160,29,39,62,27,208,92,190,64,156,213,61,68,165,7,190,12,130,189,61,241,120,40,189,59,106,122,61,87,24,21,61,27,111,193,188,143,112,71,190,52,37,65,61,99,53,13,62,9,125,168,61,106,142,148,189,230,70,58,62,106,46,3,190,206,183,4,190,105,98,38,62,226,140,191,187,86,4,63,189,172,51,153,61,85,192,30,62,13,187,21,62,44,221,51,190,192,17,111,62,139,226,25,189,106,49,36,61,10,177,129,190,65,61,192,189,6,57,73,190,216,132,238,189,168,200,27,190,220,252,125,190,58,217,116,62,191,66,40,190,145,203,166,187,247,110,31,62,95,39,118,60,52,184,127,190,153,77,73,190,90,89,137,61,204,231,58,190,106,210,128,189,137,38,184,189,11,212,114,61,42,96,124,190,132,227,242,189,8,70,8,62,154,0,28,190,169,78,124,190,50,31,184,189,187,150,237,61,202,51,231,189,161,195,2,61,164,124,9,62,5,84,108,61,168,206,251,61,248,225,180,61,221,144,225,58,29,27,160,62,193,166,7,189,33,69,249,61,216,248,36,188,131,145,181,189,102,15,140,189,205,213,223,187,146,167,130,62,154,186,128,62,62,146,174,61,180,176,102,61,204,23,85,61,154,20,63,188,81,165,230,189,1,65,8,62,252,166,35,61,135,217,157,189,246,15,28,60,231,142,63,62,118,236,51,189,102,209,147,62,30,106,62,188,112,148,165,61,62,82,176,62,93,170,158,61,41,58,170,189,238,139,234,189,51,210,35,190,247,55,9,190,191,98,19,189,32,151,253,61,104,173,171,60,213,62,47,62,94,184,32,190,183,143,62,188,106,120,150,188,22,7,230,61,30,216,138,62,181,241,4,60,234,32,82,61,150,90,126,190,1,219,186,190,153,3,205,61,100,236,32,61,245,98,192,189,218,160,154,189,101,32,251,189,143,248,224,188,116,79,66,190,128,141,0,62,54,180,229,189,83,223,80,189,131,35,101,61,2,32,206,61,18,58,140,61,255,120,131,59,234,76,76,62,79,60,105,62,112,56,85,62,253,150,128,61,74,84,2,62,216,206,192,189,189,111,196,61,117,205,233,60,201,72,121,189,87,170,125,189,214,46,48,190,79,30,2,62,18,152,5,62,243,44,214,188,52,4,112,189,239,27,47,60,23,44,236,188,95,91,14,190,222,19,231,190,55,197,30,62,209,15,231,189,134,26,25,62,137,167,37,189,117,175,153,60,139,40,106,189,255,238,19,62,214,153,5,62,48,215,230,61,161,37,186,59,195,31,64,62,166,34,61,61,2,73,189,189,44,43,31,190,7,124,205,188,169,232,41,189,3,160,129,190,149,221,115,61,238,113,24,190,31,117,2,62,213,136,116,61,40,138,150,61,68,62,70,189,239,90,54,61,176,158,165,189,114,88,50,189,45,126,69,61,217,38,27,190,228,119,105,62,52,133,35,190,213,96,60,62,61,50,154,61,123,237,45,189,208,143,230,189,25,147,59,189,119,244,165,61,127,23,115,190,112,191,134,60,95,164,89,61,80,199,85,62,19,225,145,189,234,68,64,190,16,249,8,61,72,232,161,61,233,252,184,189,27,90,119,189,17,62,192,188,221,240,77,61,197,128,223,190,220,243,162,186,121,144,173,189,163,41,51,190,83,15,73,190,165,183,7,190,222,234,142,190,183,236,136,189,99,21,225,61,58,251,206,189,45,180,7,189,242,122,146,185,120,68,4,62,249,24,166,189,249,31,34,62,137,223,7,188,233,186,13,62,221,172,38,61,197,47,221,188,95,101,245,61,232,46,76,62,140,235,24,59,150,168,133,189,118,201,237,61,190,116,113,189,101,253,27,190,98,31,147,60,197,150,72,62,34,2,28,190,36,186,168,61,154,67,231,187,222,166,198,189,242,164,24,61,226,192,244,190,70,108,36,62,51,90,96,61,155,0,49,190,251,171,85,61,98,20,182,189,114,159,222,61,115,35,176,61,207,233,20,61,31,25,82,187,43,34,39,190,165,168,25,62,25,14,151,61,223,221,239,61,148,143,205,188,99,213,141,190,147,39,23,189,233,147,176,188,229,213,141,61,56,174,173,61,81,25,233,189,148,76,183,189,237,68,157,62,148,84,214,189,133,113,2,189,179,179,121,189,152,239,12,62,218,196,170,189,184,197,156,190,94,94,21,61,1,255,51,189,136,238,55,62,184,86,236,61,82,237,100,189,231,92,173,60,72,186,118,62,79,48,244,61,134,84,158,61,80,141,170,189,98,34,15,189,8,174,170,60,189,33,44,60,39,242,35,190,239,33,228,189,168,150,220,61,176,179,243,61,54,101,27,62,195,21,30,62,86,13,85,60,120,185,143,61,229,34,182,61,135,148,13,188,215,160,157,62,127,44,253,61,97,33,203,61,68,120,24,190,9,203,203,61,238,109,139,58,225,12,102,190,234,146,147,188,213,115,29,61,129,231,105,189,63,77,136,61,252,208,62,62,222,32,184,60,120,106,11,188,159,129,183,60,228,251,4,189,168,82,166,60,11,144,112,190,90,227,148,61,174,160,152,61,232,199,130,60,38,116,124,190,118,111,21,62,19,201,29,190,15,109,150,190,199,107,33,61,23,205,189,62,29,91,133,189,106,171,89,62,225,118,157,190,253,149,39,190,210,238,149,190,65,212,4,189,247,15,65,190,176,20,90,189,51,92,244,189,31,18,49,62,159,119,34,61,173,88,98,61,123,252,130,188,165,143,39,61,78,204,225,60,49,68,171,188,46,215,164,187,60,109,210,61,152,187,85,61,105,243,234,188,147,103,45,61,81,102,0,62,6,199,202,61,154,57,34,190,118,79,246,61,165,185,141,61,114,97,141,190,207,193,149,61,216,127,116,190,26,126,122,61,178,77,183,189,98,189,216,188,72,154,89,60,81,64,244,61,158,226,204,189,239,62,43,189,193,238,12,189,12,168,250,61,121,153,135,186,157,23,26,61,219,244,39,190,30,153,216,61,253,44,194,188,61,126,254,61,85,253,33,62,181,83,197,188,47,187,16,190,0,100,135,190,238,70,171,61,54,58,18,189,208,110,56,62,92,79,79,61,8,22,60,190,47,183,103,190,126,18,39,62,117,177,112,61,203,32,172,61,30,12,88,62,115,139,194,189,63,57,105,189,146,139,175,61,72,97,153,61,181,109,61,189,41,6,127,190,187,26,254,61,221,82,88,190,64,159,177,60,163,80,52,190,12,173,128,61,28,130,145,62,56,72,206,189,188,144,152,190,42,241,156,61,23,221,237,61,17,98,67,61,245,49,214,189,209,53,144,189,170,135,45,62,14,77,90,189,189,161,186,61,220,0,4,62,246,154,16,62,132,112,24,62,83,75,7,190,204,208,140,190,129,226,57,61,55,8,20,62,201,136,248,190,26,144,54,61,220,33,102,190,50,53,61,61,182,92,41,190,33,31,215,61,132,31,58,62,184,107,39,188,115,143,90,190,3,2,58,62,162,221,96,60,207,70,144,189,222,176,28,190,220,37,223,61,232,97,10,61,160,148,34,189,30,73,2,191,74,27,21,190,222,83,100,61,74,84,34,62,83,3,138,189,250,23,9,62,184,225,253,189,67,148,53,188,13,208,46,62,224,38,202,189,123,228,253,188,184,154,165,61,163,205,173,61,210,197,78,62,28,193,92,189,8,166,62,189,21,172,128,61,173,187,189,61,24,255,52,62,201,41,176,189,40,4,162,189,168,4,152,61,172,22,157,190,160,81,219,189,252,203,155,189,242,199,127,61,125,61,132,188,95,17,214,189,158,15,146,189,170,18,62,62,72,65,60,189,181,84,31,188,156,99,48,189,235,161,193,60,148,157,169,188,44,90,245,189,45,234,55,190,175,119,105,189,226,109,187,189,29,64,116,190,98,172,80,62,67,102,222,190,38,173,92,61,68,209,46,62,32,222,157,188,74,23,146,190,7,143,36,189,44,26,231,60,30,59,78,61,120,108,109,60,85,5,31,190,159,165,74,58,36,61,31,62,16,191,220,189,50,6,195,189,193,207,155,189,251,117,19,190,105,189,80,62,54,109,38,190,200,138,209,189,40,18,187,61,84,58,174,189,172,110,111,189,200,185,80,62,128,123,13,190,99,167,114,61,65,171,133,61,55,249,57,189,193,11,131,189,228,230,9,60,129,253,126,62,209,2,97,188,153,53,85,189,144,203,20,190,185,40,170,188,212,155,30,60,149,46,37,190,87,137,57,190,83,94,0,190,141,182,33,190,126,49,192,189,121,94,164,190,75,17,81,61,193,43,169,189,100,86,223,190,16,1,84,61,133,212,235,58,86,189,157,190,137,146,216,59,249,79,240,188,162,105,105,61,73,107,102,190,45,160,29,190,105,247,16,190,109,172,109,190,91,87,59,62,137,51,159,60,61,177,31,190,217,232,62,190,245,87,67,189,46,57,181,189,38,54,195,189,52,230,172,189,102,228,163,189,20,112,174,61,28,163,169,188,81,125,97,189,12,107,225,189,37,205,33,190,173,166,16,189,35,118,228,189,227,252,126,60,207,66,124,190,49,137,172,61,129,32,43,190,108,56,152,190,161,177,101,189,205,29,140,61,236,216,54,62,55,90,113,61,212,154,209,189,94,102,104,60,142,7,10,60,37,133,182,61,242,65,252,189,205,131,145,61,125,231,141,189,155,204,146,61,207,64,198,61,84,219,244,61,109,177,199,61,113,240,65,62,195,217,228,189,33,166,54,62,162,57,189,61,73,2,169,188,63,212,238,190,21,179,249,189,243,62,213,188,5,0,104,62,219,85,58,62,244,196,85,61,175,108,105,61,172,219,234,189,68,67,91,62,80,169,87,189,246,30,108,189,100,26,227,189,43,2,141,189,208,52,200,189,121,111,10,61,15,32,11,62,121,122,2,190,79,126,137,190,141,239,209,189,50,125,47,62,165,113,121,190,84,81,135,61,31,0,254,189,113,233,19,190,226,93,38,190,81,239,144,189,71,165,151,189,147,125,30,62,26,188,132,190,173,177,17,61,177,97,20,190,0,98,129,62,6,27,110,61,40,241,189,189,123,110,35,190,96,135,49,190,191,15,188,61,228,232,135,190,163,121,81,190,133,30,216,60,20,194,84,188,18,39,135,190,61,169,221,61,2,167,144,189,205,138,182,189,100,92,100,189,186,224,221,61,158,156,7,190,96,241,89,62,107,229,179,189,70,46,200,190,46,45,87,61,219,124,25,62,220,8,143,190,127,211,15,62,202,100,223,60,95,27,175,189,61,3,30,190,147,33,252,186,236,237,20,190,224,189,253,188,136,62,169,189,140,123,45,188,238,163,15,189,209,130,196,189,141,108,106,61,179,195,37,186,184,212,145,189,97,78,10,62,38,46,68,60,251,150,219,61,15,57,28,188,104,200,84,186,40,185,7,61,192,186,188,186,248,44,7,62,79,144,230,61,130,191,5,190,91,255,5,62,37,4,111,62,197,58,77,61,22,120,36,190,60,153,8,59,228,84,15,62,232,120,234,189,168,57,157,189,139,13,9,189,221,206,252,189,51,51,57,190,142,197,6,186,110,185,201,60,182,188,233,189,232,16,104,61,161,212,96,189,178,204,99,62,76,154,110,60,40,156,248,189,31,18,238,60,121,3,85,61,59,56,97,190,27,140,168,189,106,50,4,62,212,49,4,189,248,249,64,62,241,229,137,189,71,238,139,60,227,48,44,190,160,69,76,190,126,160,24,62,201,58,28,61,75,199,235,59,150,209,28,62,233,20,156,61,174,193,41,190,4,13,43,190,145,13,164,189,122,79,204,188,178,48,165,189,174,77,185,189,129,106,38,189,174,116,232,61,18,244,137,189,197,158,132,62,174,25,106,190,229,139,145,189,253,250,192,189,178,202,243,60,189,122,141,188,73,243,218,59,46,1,13,189,93,189,11,190,29,118,0,61,72,142,155,61,75,49,154,189,216,158,98,189,162,105,68,189,32,131,41,190,118,159,247,189,210,160,233,61,36,144,232,189,129,244,117,62,20,206,93,61,65,158,128,186,116,18,58,189,238,108,118,190,58,232,23,189,170,52,41,62,242,239,99,187,38,222,189,60,105,18,222,189,72,131,25,190,85,185,133,60,225,86,1,190,251,165,245,61,144,36,149,60,255,211,210,189,182,199,158,60,37,36,206,59,140,97,119,62,89,196,204,61,59,140,191,60,152,90,53,189,150,78,126,61,231,189,238,190,101,205,166,189,15,141,16,189,40,207,32,61,144,87,189,190,244,33,20,61,4,199,174,61,236,127,167,62,200,211,104,62,106,40,204,61,34,136,128,189,112,50,171,61,13,238,96,190,94,163,200,61,214,119,43,190,189,176,253,189,37,230,186,60,199,187,149,189,225,37,197,189,34,152,100,61,248,1,31,190,116,156,208,187,246,51,85,62,192,93,78,189,128,231,143,189,31,208,37,189,1,91,212,187,234,142,227,61,179,191,168,61,226,245,253,190,16,240,39,190,226,189,71,190,57,60,10,62,117,243,255,60,11,94,73,61,203,6,167,188,177,67,247,188,78,195,162,188,180,150,104,62,206,211,14,61,147,73,204,61,94,92,76,187,22,135,101,61,188,232,51,60,85,80,211,189,244,51,50,62,246,77,81,190,50,144,36,62,50,118,221,189,186,206,122,190,182,65,159,189,161,88,174,61,63,32,243,189,115,164,163,189,212,83,37,189,221,131,121,190,83,255,101,61,217,249,171,61,210,198,5,190,24,11,163,61,102,92,181,189,230,148,155,190,198,64,171,186,24,210,21,188,250,120,18,60,61,122,153,189,39,144,43,61,207,225,57,189,45,234,31,189,55,241,74,190,68,157,65,190,74,12,31,190,74,229,20,61,191,66,0,62,93,249,109,189,153,35,19,188,195,147,14,189,43,44,64,189,24,120,226,189,197,11,206,61,117,152,11,61,213,50,176,189,44,220,119,189,134,10,134,187,65,236,88,190,122,166,80,189,64,178,175,59,147,251,155,61,70,78,61,62,31,156,68,190,13,43,74,189,72,36,96,60,230,198,51,61,31,128,155,189,97,210,177,189,251,140,15,62,60,6,156,189,192,212,215,189,137,129,141,190,88,29,83,62,123,62,146,190,64,36,3,187,141,235,55,190,117,177,0,190,239,31,144,61,6,223,16,62,184,84,169,185,179,132,1,62,220,239,50,60,100,251,73,62,139,171,28,189,74,125,220,59,91,77,132,189,179,139,23,190,70,75,15,190,11,242,20,190,104,205,207,190,127,83,76,189,39,68,227,189,242,178,208,189,3,237,136,61,135,220,57,189,80,21,0,62,78,105,145,61,87,185,235,189,185,246,6,190,8,88,193,60,210,167,224,61,186,148,191,188,69,117,209,190,81,30,254,61,239,4,183,189,11,67,13,190,178,39,77,61,177,124,108,61,17,55,254,59,246,96,7,190,97,157,176,189,158,42,20,62,251,169,21,188,103,72,7,189,245,205,234,190,251,238,139,61,167,231,116,61,176,74,128,60,252,119,188,61,80,95,63,190,205,216,233,60,62,247,58,60,248,68,35,190,135,129,170,188,36,111,247,189,180,84,22,61,198,232,190,189,215,150,100,62,144,104,213,61,58,51,52,190,219,180,196,189,1,91,195,61,96,137,137,60,189,152,19,62,127,61,231,61,224,204,173,189,217,250,255,61,245,174,7,189,162,49,8,61,123,54,91,190,182,32,70,189,207,60,135,189,33,178,61,190,66,17,237,188,184,45,142,188,191,141,186,189,225,255,94,61,116,102,5,62,201,158,251,188,155,102,207,188,153,146,6,61,184,90,171,61,232,204,52,188,151,188,49,190,233,6,79,60,39,7,63,189,61,233,23,189,9,165,63,61,47,40,73,61,56,255,199,189,108,85,245,61,169,10,143,190,159,200,48,61,151,6,157,190,225,200,9,62,75,74,1,62,61,219,60,190,70,104,142,189,237,106,160,60,20,51,240,189,241,62,35,61,109,128,31,61,185,168,48,61,135,23,135,61,231,246,86,190,119,190,2,62,61,103,147,61,27,215,133,189,27,190,53,189,52,170,68,61,250,127,172,189,64,128,42,61,163,165,145,189,9,33,73,189,38,116,0,189,23,247,45,62,179,149,141,61,56,127,236,58,37,91,58,189,19,44,202,188,47,228,39,190,28,17,131,60,133,184,33,189,122,1,66,62,65,191,168,189,158,146,33,62,249,184,104,189,6,137,251,189,208,129,128,61,207,109,116,189,175,174,202,189,85,0,138,61,105,46,141,61,121,23,147,60,234,236,0,189,27,175,121,189,218,187,239,61,40,174,132,61,33,171,240,189,92,95,143,188,241,192,135,61,124,132,161,189,134,225,39,61,107,117,207,60,44,71,162,61,234,202,40,189,214,88,152,59,129,134,65,189,124,70,184,61,252,9,31,62,67,77,103,188,220,6,195,61,21,64,45,188,172,11,129,190,206,118,6,62,158,111,63,62,17,135,148,188,165,136,101,61,32,228,250,189,155,217,101,62,33,26,29,189,232,105,175,61,137,170,88,62,114,48,6,61,99,245,162,60,245,73,96,61,10,110,58,61,42,87,56,190,164,114,206,60,204,178,149,61,229,193,15,190,221,81,236,189,5,114,205,61,27,231,229,189,203,60,150,60,189,89,128,61,69,144,212,188,227,8,237,61,47,184,148,189,98,10,237,61,187,95,113,188,81,117,154,58,84,45,35,190,66,222,41,61,16,217,54,190,50,46,99,61,75,212,90,190,100,130,7,190,49,126,106,190,231,109,59,190,139,93,91,189,134,101,77,189,65,242,245,189,64,181,137,189,199,76,219,189,146,50,197,188,98,183,205,189,1,150,235,60,222,111,17,190,168,53,18,190,204,35,62,62,251,195,176,61,235,194,234,59,18,180,106,190,224,21,29,190,72,45,199,61,56,152,238,61,141,105,160,186,17,193,69,190,48,229,21,62,20,60,47,60,249,216,190,190,158,190,39,61,93,242,158,188,140,115,201,61,95,97,184,189,241,42,143,60,146,76,179,188,63,106,31,190,149,239,138,60,184,84,11,190,139,171,157,188,252,240,145,60,24,78,36,190,29,239,20,190,3,171,146,190,83,122,4,190,48,61,130,190,170,39,181,61,60,97,15,62,135,158,166,189,38,88,134,60,209,148,68,190,205,52,202,61,29,162,157,188,228,204,109,61,94,202,73,190,25,206,174,189,245,153,213,188,13,65,224,60,143,238,171,190,183,200,200,189,209,237,198,60,130,152,31,190,39,165,238,61,66,149,199,189,14,62,19,62,165,210,51,190,172,170,12,190,40,208,4,190,214,72,155,190,240,69,7,61,121,136,70,188,82,118,249,188,82,226,51,61,68,70,6,188,149,145,7,190,22,204,207,61,1,243,49,190,170,27,54,189,116,79,139,60,213,29,231,189,211,224,228,189,5,133,148,61,51,106,27,190,120,112,207,188,200,92,223,61,108,230,12,190,103,240,211,188,151,224,123,61,121,106,128,189,28,7,68,62,72,248,175,60,132,231,129,188,135,204,229,189,49,134,247,61,54,193,117,187,140,249,106,189,41,248,179,188,158,28,216,61,197,237,98,190,164,24,41,190,104,8,20,190,206,44,104,62,158,111,78,189,242,87,153,189,127,122,229,61,141,115,22,188,156,254,38,190,78,134,0,61,252,45,232,61,232,83,110,189,149,78,60,190,95,105,72,189,170,90,18,62,218,19,198,61,241,23,147,61,139,192,177,189,144,237,125,62,122,23,64,61,138,129,132,189,11,182,115,190,220,251,132,190,116,89,31,60,178,20,30,190,252,202,9,190,224,11,136,189,251,154,177,188,216,249,1,190,27,59,61,62,231,127,167,189,215,66,193,61,181,97,44,62,43,74,201,60,232,211,2,189,64,18,113,61,72,121,27,190,91,76,15,61,193,113,157,189,131,62,30,190,74,163,114,189,205,84,112,60,127,247,57,189,44,99,44,189,19,146,14,61,35,66,24,62,37,149,41,61,41,146,207,61,222,19,126,61,42,21,16,59,61,229,35,186,88,31,55,61,15,226,244,188,180,147,154,61,170,243,85,188,171,225,203,61,206,39,77,189,17,182,6,190,71,220,53,190,241,23,71,189,5,231,99,62,248,157,34,190,235,141,111,190,16,33,52,190,148,77,239,189,45,147,7,190,213,239,119,190,38,65,81,61,27,239,219,189,57,93,131,60,39,10,148,61,136,69,22,190,113,240,225,60,3,109,61,62,158,61,194,189,201,236,246,61,103,68,78,189,214,238,213,190,35,138,189,189,225,60,133,60,200,107,116,61,213,178,134,190,95,243,129,60,35,135,77,190,95,23,15,189,155,170,221,61,184,145,33,190,76,113,4,61,9,174,57,62,16,148,8,188,53,226,8,61,153,89,38,62,221,105,228,62,96,163,205,189,45,204,172,62,213,113,16,191,98,89,245,61,189,22,147,189,215,62,250,190,137,198,89,62,244,252,62,190,90,66,174,190,96,21,170,62,229,88,7,191,28,217,243,61,111,41,138,62,114,144,86,62,207,247,126,190,98,100,242,60,138,81,122,190,185,233,234,61,225,77,127,62,173,171,13,191,11,199,13,62,2,202,230,62,249,164,194,62,245,221,134,60,115,218,152,61,103,166,236,62,232,229,209,190,154,111,235,188,41,82,161,62,40,231,24,189,35,152,80,191,190,75,207,190,168,40,73,189,255,193,87,61,67,220,5,63,10,67,56,191,174,48,35,190,128,253,77,62,252,121,190,61,165,157,62,189,2,36,33,191,35,52,79,191,93,57,28,190,142,137,3,188,82,105,232,62,226,183,26,62,22,4,62,61,176,47,122,189,110,193,17,191,198,127,28,59,135,158,89,190,190,216,143,62,210,254,97,191,34,0,211,61,151,255,146,61,82,191,55,60,139,112,97,62,216,59,88,190,210,130,93,191,37,230,15,63,197,46,42,62,149,244,232,189,232,213,216,190,85,3,86,191,230,204,133,190,144,247,169,62,174,213,80,61,31,196,135,62,165,232,158,61,242,67,87,191,145,178,214,188,165,195,169,61,226,32,188,190,215,216,150,61,16,221,158,62,21,14,58,62,180,195,21,60,240,111,145,62,146,232,19,190,158,21,102,62,186,237,84,190,211,148,86,191,29,15,20,191,125,235,26,191,35,53,219,189,57,97,131,190,216,113,161,190,65,243,91,188,189,105,152,62,11,87,202,188,104,208,192,189,199,29,166,62,82,241,108,62,189,244,218,189,41,155,77,62,119,193,132,62,45,75,46,62,55,76,130,61,245,34,137,62,238,175,34,191,11,29,178,62,151,114,237,62,4,31,138,61,14,170,31,191,95,119,10,61,80,193,67,190,224,252,147,61,36,83,175,61,133,201,66,191,223,40,252,61,118,220,248,62,118,24,97,62,165,243,46,189,211,1,166,61,24,7,182,190,17,5,233,61,249,36,43,63,146,154,15,191,17,183,51,190,105,246,199,190,94,42,187,62,2,4,214,190,217,101,70,191,36,241,220,190,247,196,79,190,234,27,80,62,127,192,146,189,80,137,45,62,248,185,225,189,135,146,24,62,230,32,23,190,29,217,197,190,27,86,208,62,13,174,182,62,26,88,183,189,73,163,73,191,41,194,158,62,77,244,7,62,210,70,63,62,16,117,209,62,98,126,16,191,27,82,30,191,189,209,124,61,183,237,7,191,237,147,228,61,188,229,21,62,130,29,73,61,150,53,165,62,147,51,199,190,29,109,168,189,196,65,111,191,183,233,124,190,43,30,165,190,222,73,91,187,203,133,128,62,42,135,74,62,139,84,127,62,11,23,61,61,16,252,4,63,72,123,71,62,1,56,202,61,179,238,42,191,192,103,144,60,10,106,55,190,103,15,16,191,38,63,185,190,77,149,140,190,4,249,211,190,153,182,28,190,61,179,35,62,87,53,189,190,226,28,189,62,6,204,56,62,167,79,174,61,239,84,48,62,127,89,148,191,85,28,239,190,58,149,90,61,181,40,123,190,219,36,36,62,216,199,132,61,159,80,124,62,39,85,88,61,20,116,162,62,186,210,45,190,57,194,93,190,181,39,36,190,61,47,87,190,172,100,223,62,239,44,174,187,95,201,21,190,49,24,151,189,249,212,238,61,187,248,57,190,28,70,99,62,108,186,97,60,58,200,201,189,30,81,191,190,25,108,177,62,176,101,62,191,90,18,108,62,6,245,76,189,181,118,30,190,207,196,86,191,80,113,129,189,239,174,29,60,160,204,217,189,166,253,64,190,220,95,34,191,23,2,25,191,239,21,35,62,144,52,214,189,25,20,14,189,94,127,123,190,226,156,130,62,197,254,123,62,32,203,188,60,217,191,26,191,227,245,136,61,155,53,23,191,78,47,205,61,128,139,44,62,204,94,247,190,136,3,171,190,107,212,248,190,234,71,207,189,106,142,159,189,202,5,149,190,47,46,195,62,85,207,220,61,155,184,248,62,48,205,177,61,0,214,13,191,210,127,134,62,173,127,33,62,151,252,248,61,46,245,5,190,24,153,59,191,175,225,112,191,202,166,208,62,36,144,115,62,137,110,188,190,146,219,15,62,65,203,131,62,197,101,33,62,54,200,204,62,112,127,105,190,123,84,139,190,206,181,208,188,195,183,17,191,151,31,207,189,42,248,126,62,60,244,102,61,52,251,85,190,112,242,5,190,243,96,203,190,3,121,6,191,19,210,136,62,98,110,83,62,216,60,58,61,162,138,106,62,48,106,96,62,85,204,80,190,56,121,38,191,103,153,91,62,6,246,181,190,180,146,6,62,165,94,138,190,77,15,121,190,131,176,191,190,27,102,133,62,104,79,133,62,7,83,102,62,200,97,192,61,211,216,46,62,191,60,52,189,3,54,34,61,188,84,59,191,118,171,212,190,165,251,225,61,199,57,98,190,251,142,66,190,253,144,137,62,153,206,197,62,43,131,147,60,18,148,6,61,89,18,32,61,156,189,95,62,22,140,60,190,192,110,96,62,155,178,118,190,154,40,196,62,24,69,84,62,148,120,193,190,252,157,21,191,124,78,242,189,11,167,122,62,173,44,4,191,255,159,114,190,161,239,119,191,152,137,127,61,37,240,88,188,148,177,63,62,134,243,146,61,207,31,160,61,159,11,241,60,151,6,241,190,183,164,34,62,102,86,151,190,232,45,48,189,237,113,85,191,155,70,202,61,227,165,1,61,45,116,169,62,197,213,144,60,64,216,103,190,174,103,56,190,150,59,137,61,84,211,192,62,31,117,70,62,95,255,184,62,116,188,143,190,215,41,171,190,120,147,196,190,223,250,24,61,92,233,104,62,117,103,89,60,246,250,223,190,88,31,47,188,248,79,149,189,139,78,1,188,220,67,34,62,196,96,55,62,205,236,186,188,60,162,149,190,194,137,127,191,107,72,35,189,210,237,180,190,117,98,91,61,137,25,20,62,19,31,158,62,54,174,171,61,142,46,102,62,88,147,89,62,128,100,23,190,103,78,166,61,42,53,6,188,156,188,185,61,238,209,192,188,15,57,251,59,61,84,59,190,62,101,199,61,125,115,188,59,240,216,27,190,216,33,251,189,158,254,131,189,58,56,28,187,215,227,24,61,19,220,84,191,135,70,38,63,156,53,28,190,99,253,42,189,162,223,199,189,40,54,4,191,186,60,91,189,149,116,159,61,220,187,193,190,170,131,136,62,106,152,174,189,168,202,92,61,199,168,129,62,91,37,54,191,70,154,250,190,81,237,117,62,116,135,219,61,144,225,133,62,188,155,61,191,150,25,179,62,2,104,155,62,9,231,169,62,98,149,20,62,195,194,113,61,113,67,173,190,132,80,73,190,100,202,181,62,240,190,245,61,216,215,50,61,69,81,149,62,53,49,157,190,148,61,105,62,76,156,75,62,19,120,224,62,170,126,82,190,56,159,61,191,19,185,198,190,75,128,72,191,235,149,201,190,57,178,91,191,88,133,179,189,119,187,131,60,16,32,1,189,3,213,71,58,69,3,214,188,118,94,44,62,204,138,206,61,99,230,193,60,38,96,140,62,47,239,174,61,181,241,126,190,52,69,140,187,209,239,129,62,239,84,99,191,81,147,133,190,47,182,155,188,252,118,207,61,67,5,189,190,110,33,182,61,0,181,11,62,249,38,160,189,28,208,147,62,28,226,175,62,6,12,149,62,125,150,96,61,227,185,66,191,78,162,83,190,190,117,17,62,168,105,166,62,108,5,33,63,245,78,66,62,161,238,206,190,164,68,108,191,8,67,157,62,135,152,0,62,4,186,96,188,232,219,45,191,98,71,125,61,156,97,53,62,99,101,145,190,34,207,250,61,135,97,57,190,146,58,125,62,130,191,11,62,155,112,147,62,104,34,218,189,135,19,61,191,154,186,13,191,144,18,9,62,213,141,232,61,129,132,115,190,188,88,146,61,132,184,51,190,26,140,11,190,76,222,187,190,100,37,123,62,182,171,41,62,193,168,211,61,85,105,16,189,121,225,107,189,187,248,33,190,79,162,70,62,105,42,7,190,177,167,150,189,250,219,51,189,207,171,48,62,165,195,122,191,153,226,207,62,75,114,79,190,227,44,96,189,104,135,22,190,30,106,184,190,212,36,178,61,242,102,16,191,69,23,16,189,125,250,186,62,123,180,96,190,118,220,1,191,126,203,191,190,130,227,132,190,111,154,39,61,56,87,81,62,243,187,188,60,133,138,35,191,152,175,24,61,170,79,214,190,206,129,42,191,44,24,124,190,20,157,27,189,15,25,189,61,242,89,178,62,12,201,111,189,170,150,21,190,99,226,130,188,194,153,252,61,208,235,146,190,52,139,158,190,245,102,15,62,25,111,244,62,174,107,208,62,84,7,169,190,186,59,66,61,225,141,72,191,109,165,242,190,191,224,123,62,0,72,46,62,131,19,100,62,194,72,159,61,35,119,122,62,12,240,239,190,234,134,7,62,32,189,40,62,244,124,228,190,195,209,44,62,248,179,228,61,191,54,125,191,41,225,21,191,159,124,68,61,252,217,239,189,35,22,239,61,117,69,147,62,101,12,48,63,114,111,193,187,216,193,26,191,15,31,78,62,127,97,142,61,190,230,20,191,80,34,136,190,248,73,25,189,232,7,248,190,150,143,146,62,95,63,166,188,129,223,87,191,89,211,153,189,95,175,200,190,132,143,8,63,195,209,53,190,38,172,66,190,185,246,2,61,140,134,60,190,13,242,223,189,82,69,157,189,168,20,52,60,30,233,35,189,162,69,71,62,68,57,158,61,193,228,120,62,217,97,229,190,138,24,179,62,86,249,203,60,4,206,230,188,138,56,169,62,77,130,23,61,90,208,84,62,91,104,5,191,44,197,219,61,30,244,99,62,99,135,238,190,117,105,231,190,169,234,230,61,39,117,20,62,94,25,245,190,151,102,98,190,88,226,150,190,8,113,106,61,208,185,8,62,69,145,44,62,86,137,15,190,152,210,64,62,112,173,248,190,239,252,250,61,172,20,250,189,184,12,19,63,44,186,160,60,20,226,205,190,178,148,156,60,222,17,189,190,31,239,128,191,69,66,100,191,17,214,23,61,250,16,134,190,1,115,207,189,10,185,17,190,209,248,110,62,34,239,175,60,160,27,196,190,199,0,160,187,134,60,13,190,99,168,255,190,178,249,255,189,253,173,198,190,213,28,142,61,22,214,20,62,180,21,73,190,208,62,201,61,64,155,124,62,119,139,97,188,46,63,216,190,46,74,174,188,219,158,160,62,219,82,137,61,201,11,224,61,214,18,176,190,124,181,17,62,113,233,129,190,57,166,160,190,60,104,225,61,246,4,160,62,48,240,232,189,149,111,200,190,59,116,192,188,213,145,146,62,247,122,208,61,214,118,227,190,52,10,165,190,105,105,158,190,79,80,248,61,207,83,221,190,96,43,32,62,3,170,138,62,185,106,130,61,139,86,65,189,91,56,155,61,244,37,228,189,9,65,6,191,238,3,130,190,174,83,94,62,50,24,151,189,93,169,30,191,7,52,65,62,208,59,91,191,158,158,113,62,144,186,39,62,112,119,233,61,38,202,47,62,233,8,227,190,9,210,145,62,147,76,164,62,4,255,176,187,157,232,154,61,227,75,70,62,110,95,145,62,165,216,21,191,101,206,72,190,46,154,206,61,200,208,83,62,143,42,142,62,216,170,24,191,37,218,107,62,114,213,120,191,235,238,145,62,159,5,93,62,166,7,168,189,144,153,89,191,17,223,128,191,45,28,103,62,170,224,77,62,125,93,136,189,208,80,33,60,177,234,250,189,214,124,9,190,211,74,16,191,98,211,226,59,177,129,129,190,80,5,95,191,223,218,22,62,119,211,166,190,28,250,190,61,90,10,185,190,52,198,215,62,99,108,228,189,244,15,145,60,246,207,16,191,72,126,3,62,128,108,240,60,96,109,65,191,94,98,155,190,130,162,58,190,161,182,196,190,116,168,103,62,90,186,77,62,113,174,2,189,73,150,81,190,96,212,172,189,108,8,78,190,70,38,25,191,140,126,208,189,62,107,152,62,139,209,201,61,7,55,20,190,14,164,99,61,17,128,62,62,38,80,220,62,203,239,183,190,230,184,40,191,166,240,61,188,190,153,158,190,46,138,12,191,13,249,10,190,178,65,206,188,86,28,96,188,33,113,144,62,150,36,12,63,218,18,147,61,187,91,129,189,66,48,102,190,21,182,149,190,214,62,129,61,166,54,3,62,44,236,64,62,104,0,73,62,141,81,169,190,198,211,118,191,160,244,96,62,149,167,233,60,151,64,46,62,48,83,115,190,121,125,90,61,193,225,180,62,197,126,180,61,170,253,196,62,112,137,150,188,129,222,69,62,24,110,6,191,222,62,195,189,107,239,1,190,16,48,159,62,112,123,22,191,24,81,197,190,184,225,179,60,221,59,104,190,119,71,148,188,254,250,137,62,225,165,90,62,158,212,55,62,18,146,221,190,168,102,58,190,202,103,172,190,205,34,42,190,232,8,82,190,46,88,112,59,195,243,25,191,216,156,172,62,164,224,17,60,149,216,163,190,249,70,133,190,0,173,132,62,1,41,236,187,166,65,86,62,10,42,236,61,207,56,66,189,72,117,139,62,241,88,254,190,205,131,138,61,91,166,33,191,142,150,25,191,185,152,56,190,203,74,1,191,75,126,121,62,189,175,57,62,71,123,28,191,71,202,76,62,80,168,27,191,86,141,127,62,70,171,59,190,110,157,105,189,184,190,167,60,86,158,110,61,221,37,46,62,185,62,171,60,57,28,135,62,174,225,78,62,109,103,136,62,170,103,31,62,182,131,49,61,107,190,10,61,72,193,203,190,153,147,166,190,154,70,81,189,118,227,71,62,145,246,107,190,175,33,74,61,246,40,46,60,77,98,110,61,162,209,204,189,42,101,68,62,189,6,162,190,1,161,8,189,236,67,130,191,210,39,36,62,154,124,81,62,160,234,59,191,167,139,15,191,113,222,40,189,86,28,78,60,250,36,202,189,65,146,165,62,81,4,123,189,13,28,61,190,98,72,171,189,158,255,44,62,71,42,209,188,132,193,84,62,191,102,84,60,64,177,234,190,159,125,156,62,198,198,24,190,187,67,191,189,235,116,103,62,12,60,226,188,243,140,18,62,125,28,85,62,214,110,4,62,38,2,242,62,166,0,17,191,1,4,219,189,143,227,0,62,227,249,119,62,30,157,170,62,162,8,19,190,84,104,93,62,2,23,175,190,207,162,179,62,28,110,160,189,105,203,140,62,39,48,103,60,188,59,19,191,248,217,63,190,145,187,222,190,14,135,10,190,253,52,179,61,162,24,206,60,100,74,178,62,138,8,219,62,157,204,156,62,104,241,174,190,74,28,178,62,112,167,31,62,176,36,192,189,149,247,58,191,182,117,42,61,107,136,14,63,88,112,117,62,135,131,121,61,161,215,152,190,61,66,3,190,97,93,151,62,74,254,254,189,250,195,220,61,177,190,24,62,183,88,55,61,250,213,40,190,25,173,151,189,163,122,211,62,0,29,122,62,143,234,118,191,144,98,111,61,171,6,94,190,53,21,129,189,245,176,145,61,167,78,164,62,69,27,142,190,60,139,183,189,105,186,135,190,62,137,159,189,209,138,250,61,67,242,178,190,188,249,245,190,207,214,22,62,176,23,247,61,149,134,212,190,130,1,71,188,96,235,73,62,142,93,13,191,240,238,155,190,89,52,14,191,8,133,66,61,56,129,142,62,154,157,210,62,218,254,110,190,183,201,191,190,248,168,237,190,136,192,58,190,144,216,59,188,34,101,179,62,167,34,52,190,22,102,0,191,55,12,158,190,88,50,156,190,236,3,116,191,250,160,102,191,43,190,180,61,164,20,102,190,255,135,226,190,206,63,22,62,248,1,98,191,123,236,4,191,121,225,214,190,111,33,213,61,206,229,156,60,143,99,187,61,180,58,34,191,217,195,37,191,107,158,112,187,117,18,184,190,177,31,250,62,126,81,28,191,20,217,140,59,90,48,199,59,203,165,169,62,0,99,103,62,174,26,39,61,23,99,119,187,199,50,169,62,236,17,181,59,4,192,134,61,245,192,238,61,112,242,49,191,147,169,67,62,240,126,6,60,97,191,20,62,74,242,15,190,94,148,134,62,145,232,138,189,21,201,11,191,208,69,62,190,252,59,31,189,48,141,5,188,151,204,217,190,242,99,95,62,158,116,113,189,255,127,177,62,222,23,139,62,114,143,216,61,218,194,141,61,226,150,74,190,27,140,254,60,31,17,163,62,107,196,143,62,174,215,82,189,11,203,147,61,214,77,31,191,5,21,106,190,99,2,220,190,198,84,90,62,218,104,180,62,158,79,26,62,250,121,93,61,155,1,37,190,135,143,18,61,70,48,246,60,197,155,4,190,203,157,114,189,151,107,52,61,246,81,100,190,149,111,34,61,159,248,196,61,133,18,49,190,142,9,50,191,45,15,127,188,87,209,62,57,240,201,92,62,170,177,136,62,118,240,13,62,243,90,13,191,216,124,19,190,72,187,24,189,62,86,151,62,234,123,1,191,151,102,246,60,48,224,205,189,189,124,199,60,7,6,137,62,132,134,110,191,164,253,252,188,157,215,224,61,237,43,113,190,4,179,53,190,63,56,179,62,152,77,200,62,61,185,192,61,67,192,169,61,43,124,156,190,100,221,18,63,57,152,184,189,150,35,54,189,170,164,212,58,14,188,120,61,139,6,179,188,185,172,149,189,216,57,177,60,231,170,167,61,204,203,25,62,244,137,151,62,116,114,133,62,180,215,192,62,156,125,92,62,114,218,239,62,93,178,9,191,199,8,114,62,61,242,78,190,113,67,83,62,13,208,19,191,51,201,44,189,73,199,57,190,54,59,126,190,73,53,161,190,234,131,203,61,164,176,205,62,172,27,66,190,201,152,52,191,51,130,10,188,193,142,108,62,129,255,99,61,159,79,19,62,123,112,69,191,184,209,109,62,88,124,130,190,182,225,197,189,235,218,47,190,100,62,159,62,6,221,166,61,207,89,246,59,197,226,113,62,242,234,73,62,34,129,193,190,93,159,18,191,141,126,224,61,53,68,232,189,147,236,181,61,109,35,15,190,76,131,152,190,230,112,3,191,228,69,101,62,141,192,240,189,171,4,50,190,12,152,147,188,92,75,60,190,196,50,160,62,166,115,200,60,160,49,150,62,222,232,163,190,95,216,86,190,103,27,15,191,193,183,154,190,45,92,167,62,77,41,26,191,236,118,78,190,84,150,147,190,100,8,175,62,40,106,35,62,42,54,170,190,174,148,139,62,238,42,108,62,45,247,163,190,211,237,51,189,110,84,0,191,231,98,113,190,204,43,38,188,243,193,199,189,14,130,60,188,97,209,61,190,19,185,149,189,189,221,188,61,90,227,142,190,99,132,183,188,229,91,236,187,144,183,54,190,254,167,38,62,119,241,155,190,211,81,217,190,109,175,33,62,105,234,8,190,39,196,62,62,53,70,225,61,174,36,2,191,214,103,216,190,58,187,78,189,137,14,106,62,93,139,11,190,40,64,21,62,94,205,227,190,126,54,121,190,201,236,109,62,149,85,63,190,225,252,37,62,57,222,137,62,146,158,11,190,201,53,150,189,162,145,67,62,182,151,28,190,198,98,186,62,26,131,86,61,59,169,164,62,233,0,224,188,110,78,17,188,170,97,78,62,160,60,26,61,212,7,240,61,253,137,202,60,175,82,148,62,65,64,211,190,241,174,203,190,81,243,84,187,68,231,180,62,87,144,164,62,227,13,39,189,83,154,201,190,12,133,120,61,150,136,125,61,201,182,33,61,10,49,161,62,159,135,145,190,18,239,223,190,49,24,58,191,25,63,226,61,55,127,115,62,191,52,153,189,143,161,136,62,98,146,147,60,205,164,134,189,17,228,214,61,74,2,172,190,191,41,9,62,32,23,198,60,106,183,154,61,22,245,229,190,147,121,72,190,169,111,201,61,160,110,165,61,250,111,220,187,227,86,62,188,252,199,53,188,184,10,26,191,250,99,12,61,223,23,132,190,15,156,18,189,173,199,42,62,134,68,192,61,249,52,143,188,153,8,233,189,73,89,211,61,132,162,34,190,47,34,8,61,197,194,70,190,176,67,175,61,240,77,66,190,195,182,73,62,164,130,143,189,79,151,74,62,94,17,157,61,75,65,18,191,70,123,220,190,96,253,243,61,162,26,57,62,26,91,17,191,25,235,246,61,248,3,17,190,163,189,236,60,212,240,252,188,80,62,140,62,136,223,144,61,87,55,13,190,113,188,186,190,168,255,122,62,162,93,156,190,191,165,80,190,102,29,36,62,69,17,135,61,142,34,110,188,56,20,218,190,43,177,41,190,0,156,250,190,86,10,32,61,68,194,77,62,133,97,156,62,160,70,13,61,213,184,23,190,96,118,86,188,24,52,158,62,71,59,12,190,118,228,219,189,30,75,21,62,161,156,52,62,58,170,129,60,192,144,4,62,91,254,42,190,77,150,161,190,163,133,152,62,29,208,124,62,59,188,243,189,