{"meta":{"epsilon":0.018243392929434776},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[203,56,167,62,120,192,138,59,224,148,173,61,127,173,141,190,87,81,172,190,240,30,249,62,113,84,61,61,240,126,162,61,197,29,243,62,237,186,136,62,148,95,47,187,138,192,168,188,37,19,150,62,15,122,153,190,128,86,43,61,246,69,21,62,244,49,87,190,75,182,25,61,46,31,233,189,196,161,247,61,198,79,250,61,161,5,188,189,58,183,4,63,215,164,24,63,250,87,37,191,106,78,135,60,175,50,106,62,227,205,118,187,233,230,9,191,128,177,250,62,121,153,56,61,191,127,224,62,32,185,218,62,196,136,62,190,179,24,152,190,208,70,20,63,58,166,140,62,118,23,174,61,74,74,26,62,234,114,147,58,130,91,12,63,150,239,182,62,154,111,174,61,20,197,1,191,122,235,86,61,192,120,130,62,219,221,196,189,176,7,79,190,27,34,173,190,220,169,152,62,97,203,9,62,129,110,100,190,90,54,252,59,20,59,248,61,102,78,139,62,215,235,154,62,222,65,226,61,62,119,4,188,59,12,251,189,213,1,234,60,122,24,221,190,70,111,149,60,253,183,106,190,128,128,17,190,226,176,39,190,29,69,187,190,251,161,197,62,123,159,69,62,5,224,181,188,112,30,253,189,240,180,252,62,126,53,221,190,85,251,238,61,225,34,115,60,12,57,143,62,226,165,135,62,101,208,131,62,201,69,89,62,115,19,167,62,63,131,210,190,244,129,108,190,185,93,2,62,75,47,126,190,52,141,53,191,182,122,12,62,54,68,168,190,118,92,12,61,204,179,197,62,251,84,173,60,180,207,70,191,47,49,169,190,0,111,6,63,210,214,41,191,114,135,33,191,117,192,134,62,180,29,126,62,199,177,30,63,68,136,113,190,249,108,126,190,190,117,51,190,107,102,238,61,0,76,161,62,12,211,10,62,15,62,195,62,110,187,132,60,198,24,16,63,199,99,61,63,22,228,100,189,14,212,167,58,146,155,17,62,142,133,204,62,177,141,95,190,13,218,103,190,212,160,80,189,69,199,0,190,62,100,238,190,41,71,96,62,127,142,173,62,132,216,84,190,86,204,225,189,181,148,68,62,167,137,24,63,219,26,242,62,215,191,106,60,200,248,161,61,220,75,3,62,105,179,116,189,38,147,197,190,217,7,6,191,238,225,4,63,155,81,39,62,36,164,2,62,31,11,43,62,204,10,9,190,51,173,151,61,129,71,29,189,87,250,48,63,65,166,141,60,234,101,142,62,202,241,233,189,210,93,72,62,141,226,143,60,35,71,220,189,159,174,6,190,39,125,197,62,160,115,176,62,234,156,101,190,94,211,113,62,21,94,57,62,65,60,170,190,161,8,189,190,173,254,17,63,140,25,73,62,123,206,123,62,151,1,245,61,106,149,37,189,233,243,40,63,220,156,231,189,243,138,228,189,228,221,118,189,156,15,159,189,91,69,51,189,188,197,43,190,3,13,97,190,241,108,161,62,214,84,29,63,105,229,83,62,200,144,54,61,114,24,24,60,47,37,168,60,3,49,68,190,209,171,157,62,214,107,204,61,82,164,239,189,250,232,142,190,31,141,6,63,169,252,106,190,118,53,110,190,45,106,74,62,234,201,105,62,252,147,66,191,137,224,21,188,37,81,161,62,167,102,134,60,188,143,63,190,10,53,199,190,98,125,212,62,71,203,9,189,178,35,169,62,115,124,46,63,184,99,35,191,181,181,196,190,18,164,244,62,163,40,4,62,41,215,173,190,42,251,111,190,4,108,28,63,210,86,116,62,168,104,77,190,73,237,250,189,129,46,73,190,149,17,239,189,56,216,43,190,91,22,74,190,183,140,123,189,180,138,43,188,236,87,139,59,38,104,134,61,241,198,53,61,20,45,156,61,164,12,20,191,131,84,149,188,20,167,13,62,82,184,44,191,204,217,26,190,152,74,90,188,84,79,24,190,45,131,19,62,45,65,146,62,144,88,250,189,247,34,71,190,12,237,213,188,86,200,177,62,226,248,153,62,188,45,75,62,17,70,209,62,244,150,17,189,213,17,151,62,214,38,51,62,83,113,64,191,113,236,48,190,90,247,21,63,102,238,157,62,9,99,98,61,239,168,133,62,176,82,132,60,102,142,46,63,12,136,23,190,243,178,189,61,181,187,236,62,29,169,94,63,125,227,70,188,165,205,120,62,44,101,222,188,16,24,83,191,22,41,137,62,208,39,81,60,68,17,105,60,63,46,22,62,18,254,239,62,241,138,183,189,97,153,130,190,29,160,76,62,229,233,0,189,19,18,56,62,165,156,159,62,179,158,128,189,214,42,20,190,252,227,81,191,201,94,175,62,232,26,173,189,46,166,26,190,187,119,36,190,65,184,80,61,97,11,111,62,234,88,159,190,205,194,93,62,152,29,253,61,222,35,40,62,46,182,17,190,236,245,22,191,142,23,24,188,92,129,215,62,35,154,96,62,136,48,128,189,51,175,51,191,26,152,57,62,9,181,198,62,239,179,72,62,246,141,0,191,244,213,152,190,101,63,168,190,161,185,68,62,153,243,239,190,179,202,201,190,97,19,53,190,51,166,245,189,51,155,208,190,98,213,2,189,125,133,109,189,144,212,134,190,209,234,1,61,164,192,250,62,124,144,110,62,96,13,211,188,142,175,176,62,120,122,129,190,145,238,221,61,127,195,147,62,103,149,92,190,245,11,126,62,34,215,155,188,151,80,163,190,170,82,178,62,52,201,104,61,81,188,142,61,94,142,186,61,98,19,237,186,116,109,30,62,245,8,7,62,174,60,250,190,4,86,240,62,0,217,173,190,24,104,159,62,89,117,128,190,195,43,239,62,64,193,36,190,233,92,238,190,229,61,78,189,198,160,249,189,4,228,197,62,80,56,66,62,9,178,167,62,87,167,145,189,19,58,1,62,175,226,37,190,1,186,204,61,138,125,218,62,69,132,165,61,182,230,16,62,103,141,101,62,91,68,106,190,179,228,160,190,69,15,173,62,104,215,110,62,20,21,185,61,85,217,253,190,235,149,60,62,127,16,4,190,146,9,37,191,45,30,154,62,167,252,102,190,88,63,202,62,163,59,143,62,123,254,185,190,246,187,37,190,167,218,239,189,202,85,57,190,224,248,89,191,234,196,112,189,181,30,92,189,181,2,123,61,178,109,38,190,243,239,98,60,85,214,163,61,14,63,205,190,55,77,252,61,125,143,75,189,204,140,170,61,116,117,163,62,14,85,233,62,160,141,146,190,154,99,156,62,170,89,203,189,122,94,49,62,195,175,33,62,100,41,127,62,5,190,165,190,152,139,176,62,40,144,179,62,80,155,206,189,98,121,1,63,38,55,50,63,202,31,200,62,33,159,26,191,179,92,131,61,93,46,21,190,233,184,198,190,237,144,187,189,180,162,186,190,254,135,188,190,229,159,248,62,174,100,62,62,76,88,159,62,59,188,234,60,164,6,8,191,166,138,140,62,12,97,136,61,184,81,228,60,211,28,157,62,78,22,18,62,51,171,182,188,219,151,184,61,47,247,56,62,227,67,153,190,26,1,84,62,211,29,198,189,124,95,37,63,247,118,17,191,74,40,204,62,122,200,156,62,127,82,67,60,142,118,128,62,199,92,200,62,148,44,191,189,248,44,148,189,132,49,161,189,97,133,40,190,198,63,241,186,204,69,151,61,144,100,28,190,202,49,194,189,112,221,197,62,59,208,43,190,60,204,162,189,185,133,109,62,58,83,253,186,30,161,16,190,112,193,166,62,193,153,124,191,188,198,229,62,90,184,91,191,20,225,27,191,250,105,9,190,22,17,182,62,168,226,55,189,36,27,110,190,126,248,215,189,150,33,181,62,201,177,155,190,14,3,63,190,81,114,38,61,227,35,239,62,183,194,185,189,128,164,132,61,183,10,7,190,130,16,79,62,23,34,49,62,58,47,111,190,173,218,66,63,17,230,214,61,191,92,121,62,47,129,229,190,169,127,254,62,130,17,223,190,108,203,234,62,163,152,41,190,89,154,53,59,61,61,234,61,86,122,33,191,91,104,125,62,241,200,111,190,169,89,214,190,38,43,24,62,168,13,175,190,114,91,235,62,137,36,164,62,16,109,63,190,163,224,35,190,178,71,132,189,236,46,13,190,196,69,177,189,61,25,27,62,81,166,179,190,217,57,31,60,184,184,22,63,100,86,2,190,176,20,151,190,230,135,161,188,110,66,92,61,188,145,243,190,12,182,107,191,100,240,251,61,2,94,21,63,96,169,209,62,139,117,84,190,176,56,153,191,142,191,206,188,24,222,132,61,189,208,191,61,36,167,4,190,205,100,207,62,77,252,223,190,82,61,198,191,195,142,43,60,169,189,201,62,3,150,220,190,197,237,95,187,5,123,129,191,150,246,209,62,9,73,33,190,148,9,103,62,101,223,252,190,79,179,94,61,214,141,83,62,86,71,32,62,158,177,15,63,42,155,253,61,107,37,182,189,131,162,21,191,255,41,102,61,6,3,243,190,58,220,132,62,25,188,13,63,82,184,55,190,6,111,134,61,133,109,174,62,33,174,153,190,144,213,209,62,4,1,111,61,244,30,9,190,159,106,48,62,207,243,233,60,12,150,113,190,173,56,220,61,134,158,37,62,123,45,155,60,196,170,198,62,162,139,135,190,246,3,36,60,245,124,44,190,107,244,228,61,10,29,22,62,38,56,37,191,81,204,70,190,151,38,160,189,219,84,78,191,112,169,228,189,122,17,100,188,208,23,4,61,238,22,216,189,67,93,24,63,65,194,65,62,17,66,109,62,153,140,237,61,187,97,150,62,81,236,129,62,67,251,37,191,161,72,164,189,226,217,235,61,111,143,38,191,213,143,5,190,53,137,169,189,221,218,216,190,91,16,172,190,196,69,10,62,124,195,28,60,54,108,145,60,113,185,168,190,84,173,26,62,88,164,184,190,164,116,241,62,80,9,144,61,37,58,129,62,63,201,194,61,127,32,246,61,121,70,58,191,78,163,11,57,212,4,237,190,96,24,168,62,92,34,169,190,42,251,113,190,21,29,99,190,74,125,139,62,137,199,244,189,198,36,51,191,193,207,144,189,68,50,37,190,68,150,35,62,219,175,23,191,241,193,251,189,191,236,27,191,27,138,214,61,222,168,10,62,83,226,2,191,223,244,170,62,41,206,254,62,178,214,7,63,182,72,24,63,192,4,116,61,179,235,45,190,180,50,8,61,206,84,212,62,250,25,179,189,235,1,67,61,241,189,19,189,224,81,26,63,28,140,235,62,41,188,87,190,198,229,29,62,57,183,107,62,7,172,202,189,2,102,231,62,225,137,135,61,58,242,111,62,9,208,199,188,194,211,210,62,178,137,126,190,168,209,193,61,68,7,172,61,186,108,7,61,246,162,249,60,24,202,193,190,247,21,205,59,189,248,140,62,74,37,34,189,113,61,53,61,246,76,8,190,111,231,170,190,181,217,3,190,51,147,199,61,127,94,78,62,114,254,16,63,114,100,231,190,5,152,76,61,215,126,41,62,72,13,104,61,174,130,168,190,68,252,135,190,128,39,105,188,95,120,210,190,140,77,110,62,163,125,193,189,241,105,37,63,254,189,18,190,121,27,96,62,79,66,207,189,33,195,77,62,32,168,166,62,71,125,22,191,23,233,210,61,104,15,21,62,119,228,40,63,239,100,217,190,3,156,177,190,148,26,177,62,211,200,126,62,5,68,167,188,48,207,8,62,151,199,218,62,65,68,125,61,29,59,48,191,11,207,71,62,190,41,224,61,145,10,73,191,220,49,184,62,247,227,126,62,216,167,74,62,6,213,156,59,33,89,18,62,213,5,60,189,64,212,60,189,220,203,4,63,167,162,47,62,17,159,187,62,96,111,73,62,239,48,147,62,79,193,197,61,242,177,244,189,236,100,27,191,141,153,4,63,74,199,0,190,30,214,3,191,249,138,76,190,50,32,34,190,234,153,181,62,1,7,17,189,182,171,191,190,70,109,27,62,219,124,7,191,174,218,212,60,72,206,165,58,237,187,24,190,119,93,14,190,125,133,213,62,63,192,64,188,212,16,159,190,171,36,192,61,67,123,204,62,251,178,241,60,18,40,206,190,173,97,193,190,51,182,29,191,20,142,76,190,228,80,151,60,186,2,253,190,126,107,50,62,82,233,198,62,25,69,170,62,178,142,159,62,251,143,149,190,55,173,254,190,64,134,122,190,163,200,47,61,107,198,54,61,48,172,188,189,252,224,177,189,154,93,18,190,236,111,215,189,116,64,242,60,136,214,65,61,171,30,32,62,67,6,65,189,159,137,171,190,227,8,192,189,143,155,3,61,66,169,215,62,96,135,165,190,41,101,219,189,46,54,134,62,118,151,249,61,184,73,149,190,10,186,43,62,193,164,84,190,55,148,48,190,232,95,63,60,52,142,242,62,153,219,237,189,127,136,17,190,213,68,124,187,89,40,22,62,224,93,60,188,91,191,36,60,75,177,213,189,29,251,66,62,240,25,129,188,53,237,250,62,185,182,61,190,196,213,201,190,153,73,12,61,105,58,19,191,193,247,125,61,208,5,139,62,108,72,187,62,124,48,226,62,185,103,36,62,152,56,224,189,144,242,130,62,78,57,232,62,229,210,235,190,1,49,36,190,140,72,242,62,84,243,179,61,247,19,41,62,255,55,31,191,211,201,144,190,108,249,250,188,14,77,107,189,68,201,145,190,46,45,146,62,229,58,170,62,241,52,173,189,170,124,209,62,83,38,238,62,41,6,25,62,154,22,10,62,34,184,180,190,200,102,156,62,197,252,158,62,24,21,10,62,73,235,189,188,86,242,202,61,45,6,197,62,176,114,198,190,153,192,251,60,161,211,207,61,147,71,48,190,150,207,120,62,117,3,133,189,247,135,229,189,235,178,128,187,42,107,181,62,153,95,213,61,166,106,122,61,56,44,63,190,140,216,120,190,167,42,122,190,50,197,230,190,29,43,144,190,132,119,101,189,247,197,133,190,15,73,73,190,242,241,145,190,184,66,144,190,56,199,237,189,100,242,143,190,86,33,196,61,232,64,23,61,121,101,144,61,231,227,170,61,109,180,102,62,241,178,67,62,123,111,53,190,169,81,193,62,37,13,229,60,164,51,70,189,122,97,55,189,145,217,32,62,11,19,236,57,109,18,129,189,118,86,104,62,45,101,21,62,200,243,102,62,89,251,9,62,60,230,32,62,102,57,5,62,122,227,161,62,36,205,149,190,206,123,161,61,152,84,5,62,199,53,158,61,87,89,241,61,165,243,152,62,252,46,168,61,161,94,182,189,196,202,153,62,132,236,189,190,122,196,124,62,14,253,222,189,124,171,37,62,122,51,199,61,106,88,75,62,148,206,141,62,49,203,220,61,173,61,182,61,145,42,193,189,15,143,107,62,158,158,224,61,226,225,169,189,5,206,215,62,36,41,90,190,179,225,227,60,137,53,120,62,185,71,139,62,162,112,224,189,38,131,248,190,102,242,97,189,114,253,245,189,121,114,12,60,32,185,149,189,159,0,61,62,87,30,4,190,237,30,39,189,30,68,82,59,42,94,240,188,19,83,1,61,203,171,63,61,248,114,154,62,143,154,152,60,114,0,71,190,248,8,192,189,130,70,203,190,216,20,166,188,192,191,97,189,190,33,226,62,212,217,255,190,66,242,69,63,172,34,132,190,53,191,13,61,249,74,131,61,36,109,9,190,130,151,135,61,63,59,12,60,63,119,51,62,131,191,30,62,197,240,88,190,165,204,159,189,128,206,232,190,230,78,133,61,222,30,128,189,114,183,7,60,42,98,174,187,232,39,87,62,155,244,115,62,195,68,56,190,153,57,183,189,3,75,151,62,65,88,14,62,140,95,148,62,152,64,5,189,203,68,29,190,110,70,79,62,161,126,10,61,137,72,165,62,5,13,253,190,40,214,148,189,16,50,216,61,92,172,96,62,28,69,12,189,53,209,141,59,167,241,27,191,169,94,212,61,176,237,225,188,196,200,12,190,196,120,165,60,36,139,157,189,137,227,33,189,222,205,224,61,58,249,255,189,15,226,32,189,154,27,152,62,208,10,136,61,18,66,117,190,180,51,126,62,225,122,161,62,20,246,172,190,25,136,176,189,15,6,2,189,37,238,139,189,125,173,131,188,166,125,129,62,74,61,241,62,147,87,159,190,209,233,211,61,197,95,187,61,86,165,118,61,189,3,179,61,146,184,49,190,91,247,112,61,125,197,76,61,157,105,159,190,196,63,174,62,160,201,198,190,20,125,21,189,140,154,156,61,70,253,134,62,59,252,55,62,161,232,197,61,43,107,50,62,14,56,52,189,109,215,233,190,66,248,29,62,240,100,189,190,153,135,150,62,193,2,13,190,213,169,129,189,39,17,40,190,56,248,32,62,110,237,12,190,223,253,134,62,40,57,72,190,46,253,162,61,205,123,231,62,82,146,171,190,100,15,156,189,152,204,117,62,17,116,128,190,192,195,108,62,53,185,134,190,46,148,247,190,169,40,8,189,145,132,242,61,208,113,7,63,227,165,157,190,16,144,206,189,150,27,39,61,179,122,91,61,229,185,20,61,207,243,191,189,3,190,15,189,193,152,52,62,57,205,62,62,160,209,248,62,63,241,80,62,60,163,54,188,13,35,166,190,11,116,211,61,154,82,217,61,56,244,147,59,64,80,192,61,241,198,38,190,154,87,114,61,44,56,168,189,246,149,115,62,77,140,17,62,230,78,124,62,134,112,224,61,206,22,206,61,66,28,242,190,186,24,211,189,119,26,40,63,194,103,246,61,61,3,153,61,251,106,67,62,149,249,60,62,125,123,64,190,221,167,198,60,121,106,11,190,104,56,181,61,223,28,61,62,191,192,121,190,211,154,176,190,138,179,121,61,12,129,30,62,134,215,113,190,49,122,244,61,15,66,42,191,213,104,198,62,22,246,251,190,224,170,63,190,203,231,132,62,6,114,62,190,0,31,188,62,189,26,108,189,203,132,237,60,245,45,25,191,31,3,100,62,76,46,108,62,170,232,233,61,62,17,246,188,54,230,199,189,15,135,61,191,219,61,188,190,217,190,144,61,83,138,119,190,232,239,241,62,193,251,231,60,152,132,20,189,173,47,131,62,154,183,247,61,37,18,190,190,188,185,94,61,10,26,70,62,99,57,209,190,233,1,202,190,231,164,79,62,44,220,19,60,204,169,217,190,160,236,58,62,123,12,47,62,14,170,28,189,212,229,44,189,40,222,40,189,172,238,47,62,34,176,219,188,176,206,224,61,7,42,169,190,37,9,62,62,34,176,214,62,31,163,169,62,15,144,184,190,212,215,179,60,41,61,197,190,90,156,63,190,95,57,72,190,156,77,191,190,131,125,85,61,165,103,198,61,100,168,7,62,104,55,128,190,23,156,107,190,218,59,196,61,253,124,94,62,204,28,246,60,210,150,186,187,200,11,40,189,95,145,60,62,9,211,32,62,82,197,21,190,133,252,128,62,229,220,248,188,26,134,157,61,6,50,166,60,79,113,246,190,244,230,209,190,152,110,120,190,230,139,223,58,79,136,244,62,164,24,252,189,47,119,66,61,157,138,44,190,183,207,18,191,168,60,27,189,194,29,73,190,60,157,48,61,245,108,155,189,55,16,4,189,253,168,62,189,8,78,25,63,181,78,222,60,75,123,185,61,109,16,126,190,247,179,158,61,82,159,159,189,60,0,48,62,123,224,244,60,191,5,128,188,84,119,105,189,103,147,19,61,34,59,140,62,211,78,20,190,72,203,73,62,101,246,43,62,131,40,57,61,148,174,126,189,65,85,230,189,211,57,108,190,38,104,60,189,101,104,7,61,218,208,99,190,90,118,214,189,94,68,5,63,23,15,9,61,134,234,74,62,28,50,68,190,97,194,144,61,86,209,79,190,186,98,79,190,8,166,94,189,27,7,200,60,250,155,36,61,129,117,185,190,26,133,241,61,180,149,137,189,164,97,166,188,232,178,233,190,29,137,48,62,221,128,110,60,73,54,124,189,3,59,195,189,65,253,218,189,161,69,14,189,190,93,42,189,72,86,234,61,111,37,215,60,255,138,8,62,48,111,83,191,220,158,41,62,219,240,96,61,57,149,102,61,48,44,179,61,122,255,179,189,104,148,166,190,141,142,125,62,170,195,113,189,178,2,91,190,114,241,248,61,107,213,202,189,15,99,202,187,210,190,95,61,233,14,110,190,87,238,215,61,185,222,147,190,37,156,237,61,79,228,152,188,64,184,205,189,98,36,113,62,215,62,228,61,89,70,107,190,181,187,155,61,51,213,191,61,49,19,28,62,15,205,45,190,124,80,111,62,36,59,250,61,133,202,166,189,71,97,2,61,53,42,4,189,80,177,213,188,99,24,212,189,204,209,203,189,230,180,211,60,140,145,25,190,209,178,45,62,231,91,132,61,70,42,255,188,249,230,196,190,156,106,11,190,236,255,21,190,186,16,34,62,241,227,66,191,158,231,73,190,220,131,154,62,242,160,74,190,203,99,165,189,52,140,250,61,94,211,187,189,21,117,210,61,59,46,209,189,101,147,186,61,128,167,22,189,2,144,228,61,98,247,0,189,98,101,66,190,200,224,203,189,132,227,242,189,255,234,210,61,206,6,31,189,151,159,6,191,166,64,150,190,179,146,32,62,240,202,182,190,237,155,128,61,51,175,27,188,0,199,138,60,136,123,255,61,250,242,214,189,242,144,143,190,102,87,143,62,172,121,249,61,50,116,211,62,195,102,51,62,253,229,32,190,73,156,18,61,196,20,175,61,245,134,220,62,208,186,220,62,89,171,191,189,105,105,205,61,123,244,248,61,12,11,190,62,121,125,116,61,7,167,253,60,66,163,88,189,230,140,21,189,138,242,172,60,242,105,89,62,167,230,174,189,103,64,133,188,203,220,18,62,176,69,125,62,146,27,182,61,4,247,59,62,163,74,19,190,143,253,67,189,97,182,109,190,79,55,12,190,226,2,82,190,218,247,147,62,48,115,148,60,126,28,117,61,83,161,69,190,138,176,130,61,83,156,15,62,78,167,108,62,238,72,60,62,168,214,226,189,102,169,22,62,226,119,207,190,169,72,228,190,16,82,249,190,174,147,58,190,84,217,22,190,41,245,27,190,254,148,88,62,39,26,227,189,49,206,5,190,208,72,175,189,96,113,231,189,15,137,46,62,123,209,60,62,135,205,189,62,133,176,43,62,129,98,18,190,182,168,36,61,109,129,88,62,16,114,7,62,210,120,29,190,236,38,159,62,125,92,204,59,66,149,22,62,44,27,138,190,26,176,16,61,137,78,152,189,176,124,23,190,67,94,160,189,38,6,131,61,106,50,151,190,211,187,52,61,242,9,46,189,121,252,75,61,174,126,151,190,124,107,160,190,166,23,2,62,181,82,126,190,66,221,58,62,164,46,184,189,60,56,191,61,25,28,91,189,11,7,186,62,209,231,5,190,192,18,53,190,144,58,148,61,17,55,71,62,122,121,77,60,177,190,1,189,145,6,200,190,17,178,120,188,207,70,103,61,229,34,6,191,171,74,127,62,19,178,86,190,149,31,104,60,126,221,255,182,220,202,130,61,235,220,1,190,250,142,247,61,82,64,181,189,138,236,197,61,243,137,245,58,130,65,80,62,92,189,248,61,33,162,242,189,105,13,68,62,35,205,112,62,127,176,183,189,21,67,31,61,226,241,143,60,8,10,239,62,218,108,134,190,112,191,134,60,181,52,40,61,164,194,179,62,15,65,124,189,245,234,109,190,184,7,73,189,46,167,75,190,208,106,0,191,191,71,6,191,159,111,137,190,198,173,169,62,175,69,113,189,18,247,191,189,175,188,193,190,30,42,16,190,254,44,26,61,9,195,223,189,161,113,18,190,183,162,135,189,170,123,157,187,26,235,228,189,170,88,159,61,143,219,159,188,105,145,244,61,140,115,214,61,242,238,59,62,10,215,72,62,182,62,166,62,139,19,165,190,123,81,88,62,143,16,7,62,253,99,174,62,57,24,196,189,254,177,165,189,5,207,159,61,39,203,142,190,51,239,157,189,211,34,5,189,72,106,167,62,34,2,28,190,172,10,18,61,197,9,201,188,33,239,141,61,18,176,120,189,247,199,27,191,120,235,192,188,17,19,92,61,24,78,168,186,147,221,109,62,115,136,131,190,171,236,178,61,80,204,31,188,62,179,45,61,249,117,184,188,48,126,68,190,156,10,41,62,198,31,219,61,115,176,28,62,207,122,17,190,96,136,207,190,219,117,182,188,64,103,88,190,157,175,252,61,222,100,212,61,18,3,139,189,50,8,22,189,240,167,11,63,249,211,109,189,117,231,98,190,174,72,141,189,225,177,138,189,118,115,234,189,227,60,8,191,173,100,181,61,150,122,112,61,122,172,171,62,104,249,228,190,82,237,100,189,215,210,164,62,196,212,150,62,104,98,176,60,180,84,187,61,206,238,74,62,66,74,20,189,8,174,170,60,229,237,14,62,175,175,103,190,209,130,181,190,99,241,228,188,7,79,64,62,152,67,91,62,68,51,98,58,152,52,200,62,53,147,173,61,187,40,61,189,46,85,183,61,219,201,134,189,235,62,230,61,247,13,27,62,59,8,69,190,125,215,63,190,200,96,28,188,175,252,37,191,160,65,224,189,129,237,116,60,4,79,65,190,118,120,26,61,64,230,183,62,18,255,46,188,140,87,9,60,56,6,44,61,184,119,140,62,28,200,40,188,64,27,189,190,6,89,194,61,82,207,188,187,158,52,49,190,88,123,237,190,199,243,81,60,122,146,236,61,55,128,8,191,172,7,129,60,111,30,112,58,142,217,41,62,58,192,205,60,186,160,146,190,247,30,14,190,194,115,26,191,183,140,73,61,119,147,41,62,160,169,251,189,51,92,244,189,176,124,78,62,78,237,168,61,251,194,101,62,147,16,115,190,213,9,90,190,145,87,40,62,169,209,82,62,112,119,17,190,24,189,187,61,211,157,30,61,202,218,15,190,102,237,114,62,219,212,148,61,62,135,109,62,138,211,43,190,37,108,216,62,235,36,118,61,62,138,2,190,206,44,75,61,122,44,38,190,234,14,72,190,51,70,114,189,33,227,15,61,243,6,230,189,104,55,162,189,188,111,131,189,225,228,115,62,89,139,143,189,239,174,168,62,77,25,217,59,252,121,94,62,208,233,164,190,153,234,89,190,189,142,253,189,242,44,151,61,206,28,174,190,20,19,12,62,1,110,41,190,181,114,159,61,12,9,154,61,75,101,125,190,122,129,66,190,236,16,200,189,164,70,236,189,150,0,142,190,51,118,128,61,99,17,21,61,205,109,121,189,34,231,83,60,226,243,217,61,95,47,151,61,208,73,75,61,23,124,201,188,238,80,230,187,24,220,145,190,221,201,5,62,8,251,50,190,52,222,165,61,60,136,61,61,89,155,174,189,73,222,212,61,201,129,49,189,80,171,175,190,235,7,90,62,251,131,28,62,16,207,79,62,52,13,175,61,95,237,157,190,63,223,108,61,211,92,120,189,231,227,23,62,194,110,152,62,59,248,215,61,130,242,88,189,201,175,6,191,202,149,103,190,106,107,133,189,219,180,39,190,180,69,69,61,95,212,167,61,253,167,13,61,26,126,133,189,149,238,25,62,236,199,195,188,46,245,172,62,232,28,53,61,175,68,9,190,235,72,20,62,190,207,104,62,169,16,129,189,198,15,140,190,13,160,219,61,245,44,60,190,145,148,9,190,84,178,188,191,150,252,43,62,99,2,4,62,164,177,240,62,237,133,246,188,8,125,108,189,161,246,210,61,201,208,22,62,83,80,47,62,201,232,115,190,141,221,17,191,55,162,85,62,224,85,7,63,239,199,54,63,18,218,17,191,85,151,42,62,77,104,112,62,70,165,148,189,57,99,148,62,60,42,32,190,5,215,208,189,129,157,91,189,133,73,141,191,226,200,203,190,128,120,33,62,55,71,85,61,189,40,213,189,12,10,54,190,228,121,4,186,37,156,68,62,216,31,142,189,126,60,172,62,107,240,169,191,193,10,36,62,239,251,202,58,211,148,125,190,60,82,149,189,146,78,193,190,167,175,3,191,195,43,103,191,97,14,119,60,145,128,209,191,241,177,238,189,254,187,102,62,248,131,95,190,85,230,141,191,46,195,205,61,69,14,96,190,218,84,42,62,73,76,148,190,108,112,235,188,114,80,139,190,49,171,238,188,84,51,181,56,8,214,211,190,138,220,125,189,167,60,20,190,68,213,140,62,210,228,235,190,96,212,134,60,113,206,85,62,98,81,2,191,94,149,191,61,48,169,177,62,190,183,186,189,243,187,205,62,162,63,189,61,44,118,26,61,159,38,15,62,228,230,9,60,45,170,151,62,159,204,150,61,193,53,85,190,182,112,205,190,224,108,131,188,143,30,179,60,70,147,13,190,91,129,20,190,35,181,237,189,27,110,204,190,6,33,68,189,4,134,70,191,246,194,10,63,4,98,16,190,169,123,129,191,82,201,121,62,171,242,173,189,56,122,175,189,30,77,184,190,3,68,130,188,217,110,100,62,186,49,134,190,186,36,131,188,56,154,148,60,127,40,20,190,84,231,157,190,160,31,103,61,244,72,120,62,110,20,160,189,56,153,89,61,234,148,237,189,103,118,116,190,221,54,123,62,124,245,14,58,17,234,214,189,203,96,0,191,63,217,51,61,12,248,4,190,152,72,59,191,89,30,231,190,255,233,3,191,169,163,131,62,208,106,213,189,127,104,12,62,129,32,43,190,57,39,179,189,197,55,161,62,138,0,143,189,19,159,160,60,0,64,12,190,102,27,246,189,94,213,237,190,121,46,184,60,100,137,243,61,149,208,166,61,125,65,246,189,180,244,195,59,45,7,56,62,207,251,74,62,155,103,254,62,75,120,116,61,53,223,44,62,150,138,119,61,53,76,155,62,101,220,67,61,43,141,97,188,141,197,70,191,7,24,186,62,8,216,130,61,184,65,149,62,12,199,96,190,177,1,149,62,96,67,236,60,57,24,23,190,69,200,8,62,254,137,106,190,245,229,118,191,6,158,9,191,231,243,239,61,51,155,226,190,243,220,150,61,226,83,126,190,180,57,187,190,185,50,233,60,20,241,178,190,42,93,199,61,215,252,86,191,188,66,105,62,159,208,159,190,97,32,76,190,183,83,41,190,81,239,144,189,219,57,129,62,42,170,36,62,186,89,225,190,166,185,245,190,123,148,182,59,207,97,132,62,230,53,199,189,218,213,115,191,45,142,197,188,92,74,3,191,175,153,24,62,177,86,158,189,200,81,129,190,149,56,72,62,59,26,58,62,154,255,198,190,33,30,43,62,104,48,202,190,25,140,57,190,222,97,168,189,190,67,219,189,8,184,137,62,245,194,35,61,105,92,176,62,33,221,147,191,96,68,253,60,59,73,230,62,221,206,175,191,206,144,186,61,172,206,71,62,74,120,192,61,212,121,188,190,147,121,59,190,205,56,142,61,68,251,72,189,20,184,41,62,64,227,132,61,235,244,203,189,57,29,210,189,170,68,212,61,153,248,160,62,83,147,178,189,173,154,60,190,6,144,11,190,88,248,149,61,143,77,117,190,110,115,102,60,13,4,155,190,234,118,127,62,154,14,22,62,230,210,12,190,194,194,5,190,153,195,103,61,169,218,102,62,167,129,92,61,124,3,201,190,29,212,163,189,149,243,252,61,40,98,156,189,229,148,155,190,33,199,89,189,224,159,181,60,224,206,132,189,85,97,79,190,87,56,31,62,118,61,160,191,93,58,60,63,255,183,2,187,39,125,45,62,245,253,211,189,63,241,43,191,182,10,23,62,182,251,37,60,28,64,110,190,246,254,156,188,59,207,215,61,186,20,203,190,127,252,140,190,162,174,92,190,244,50,33,188,79,52,79,191,70,5,34,190,159,26,12,63,103,198,88,189,158,181,69,62,206,38,66,62,163,23,192,189,218,97,56,191,71,57,97,190,247,23,105,61,108,33,119,190,120,224,81,188,209,73,196,190,131,134,108,190,97,255,250,186,166,175,179,189,189,218,165,62,3,207,74,190,85,149,100,189,95,12,25,188,0,41,155,189,77,13,211,189,105,240,45,190,195,51,153,190,103,104,144,190,125,100,166,188,34,187,72,190,73,176,170,62,6,131,76,191,84,91,123,190,140,252,248,190,148,117,220,189,172,76,147,62,206,58,230,61,130,224,217,62,214,224,101,62,87,206,1,190,211,54,43,62,111,19,185,190,208,41,12,189,73,144,171,61,6,47,241,189,94,138,90,61,156,242,221,189,223,130,49,190,220,225,88,62,23,236,3,61,49,163,36,62,199,33,235,61,38,47,93,190,50,192,239,189,241,220,182,190,203,236,214,62,194,237,54,62,224,177,239,61,126,246,153,189,115,6,148,190,95,248,159,191,12,69,255,190,212,170,255,190,240,190,133,60,172,28,83,190,236,97,130,189,177,50,88,61,112,191,36,63,42,26,7,62,81,234,242,188,233,77,107,190,158,194,94,189,143,251,178,190,183,77,172,61,163,247,78,189,182,130,153,190,190,98,156,189,235,0,8,189,242,59,180,189,130,102,130,62,80,189,120,189,19,250,165,189,114,230,86,62,163,218,49,190,112,171,144,62,211,130,20,190,1,91,212,187,98,227,107,62,189,47,61,188,106,48,52,191,35,101,239,189,84,144,146,188,30,186,56,62,56,174,199,62,232,65,14,190,145,0,129,190,133,1,227,190,57,5,244,62,159,102,18,60,148,221,121,62,125,99,22,62,25,130,144,189,102,12,35,62,116,221,143,190,136,42,230,190,208,131,169,190,117,77,151,191,233,195,111,62,51,91,82,190,146,232,196,190,127,64,75,187,39,248,135,189,139,148,208,189,34,151,20,190,124,249,165,189,116,61,107,190,126,117,146,61,98,15,73,62,206,138,63,191,92,149,40,62,91,13,37,191,126,56,175,191,77,150,228,189,142,155,64,62,129,175,49,188,226,228,3,191,33,235,19,62,58,65,100,190,196,196,67,62,94,37,6,191,146,173,25,191,74,12,31,190,159,111,220,61,246,80,158,61,156,147,95,190,230,178,178,189,247,144,175,61,52,229,127,61,43,26,178,61,242,9,9,62,53,235,20,62,170,223,14,187,70,252,37,190,150,20,170,189,107,16,191,190,233,220,247,60,100,143,145,62,23,118,43,61,247,208,89,62,166,188,182,190,135,242,24,61,82,20,111,61,241,63,67,62,174,4,174,190,100,36,175,190,143,90,184,62,59,202,48,190,20,136,140,62,114,180,27,191,244,252,24,63,70,195,226,190,73,77,167,189,220,40,129,190,214,21,108,190,212,166,128,190,49,101,83,62,200,84,241,189,193,200,56,60,130,207,205,61,5,233,118,62,238,254,31,190,129,218,77,190,101,65,145,190,155,134,66,190,108,18,78,190,76,156,172,190,80,37,134,191,185,112,150,189,39,68,227,189,26,3,27,190,77,20,1,62,89,49,165,190,19,45,0,63,49,212,4,62,81,116,226,61,185,81,188,190,211,13,48,190,163,132,65,62,52,252,137,189,74,253,227,60,73,119,130,62,131,16,85,188,69,2,120,189,2,88,196,61,228,140,81,61,146,55,213,61,237,141,115,191,89,202,126,190,159,75,140,188,158,159,22,190,2,10,154,61,217,237,102,191,170,207,223,189,25,240,67,189,97,190,45,189,146,252,198,61,127,37,19,190,202,65,82,62,111,23,158,61,248,245,172,190,6,188,76,190,102,67,85,190,170,135,70,61,38,228,200,190,79,243,130,62,49,232,61,62,229,255,197,190,78,121,116,191,54,152,65,61,108,18,148,188,195,38,189,62,33,42,76,62,32,58,175,190,95,7,91,62,75,91,114,62,10,208,1,190,78,192,88,191,247,43,244,188,49,79,4,61,118,83,219,190,195,28,6,190,227,248,106,62,199,79,86,189,94,23,111,62,112,197,121,189,81,96,8,62,187,26,140,60,89,185,245,61,105,89,32,62,220,167,116,61,11,31,169,187,40,114,209,61,234,59,51,191,178,241,185,188,22,92,9,62,235,151,59,61,171,23,95,190,118,238,37,62,218,44,69,191,177,171,71,62,155,234,132,191,144,51,154,60,70,29,132,190,151,137,32,190,98,102,173,190,69,5,180,62,78,35,193,189,140,138,8,62,117,82,193,186,178,227,42,190,191,65,155,62,175,253,237,190,242,137,55,62,34,9,174,188,191,16,225,187,35,16,99,62,137,163,212,189,245,186,171,190,7,25,6,62,204,97,2,191,70,94,121,189,248,173,66,189,208,85,146,190,169,163,174,190,233,248,130,62,6,45,62,190,254,83,130,190,102,151,32,190,39,218,214,59,164,131,199,188,121,16,100,62,128,58,4,190,85,48,57,62,194,16,245,188,72,146,103,189,253,6,39,62,31,233,139,190,50,185,0,61,111,78,120,62,69,62,149,62,83,210,128,60,122,147,30,62,143,30,188,190,123,246,149,62,21,251,70,190,155,94,158,190,2,234,1,62,57,43,52,189,245,215,92,190,133,108,143,61,214,22,224,189,108,15,134,190,120,228,33,189,248,2,154,188,69,78,131,61,213,194,201,189,89,152,114,62,31,89,143,190,34,24,46,62,86,99,119,189,72,112,14,191,99,188,142,62,228,196,129,62,28,91,84,189,92,103,83,190,84,254,121,62,212,38,248,62,64,73,162,62,164,138,200,189,175,59,142,62,136,52,131,190,182,15,16,62,234,15,69,62,206,187,34,191,4,133,253,190,172,243,253,187,131,89,33,62,115,198,59,190,115,16,244,59,252,81,250,61,81,7,108,189,98,107,27,62,162,36,72,62,42,31,39,61,41,187,159,189,159,59,0,188,170,17,102,61,88,240,212,189,85,200,69,189,73,99,229,189,71,223,57,191,14,137,33,191,50,46,99,61,216,73,199,190,61,87,73,61,197,44,190,62,97,208,223,190,191,61,61,189,206,238,143,188,252,241,155,61,239,45,229,190,49,61,212,190,157,16,101,62,183,68,120,191,194,51,2,191,232,252,83,190,192,133,87,190,132,68,9,190,47,159,75,62,248,229,127,62,196,96,169,190,93,246,54,191,182,124,10,61,72,187,50,62,72,75,245,62,112,227,20,191,19,228,70,62,119,85,208,60,136,20,206,190,233,47,6,61,161,210,139,61,231,79,67,62,231,241,222,188,111,161,171,62,77,88,183,61,101,187,13,191,101,214,67,62,80,20,66,62,177,49,245,189,70,84,138,62,79,145,56,190,46,220,215,190,158,176,117,191,113,3,173,190,90,236,251,190,184,119,214,61,12,202,152,62,135,158,166,189,229,41,191,60,27,214,252,190,132,1,206,62,94,144,95,190,12,172,145,190,208,75,245,190,245,136,34,62,227,43,105,62,164,211,161,190,28,51,65,191,8,251,98,190,178,130,210,188,232,49,136,190,22,69,1,62,199,77,227,61,215,134,10,63,191,147,245,188,76,88,139,61,6,30,102,190,160,76,149,191,238,192,21,61,43,17,36,190,191,159,207,187,222,237,184,62,56,99,208,61,53,42,181,190,222,188,173,61,156,54,249,190,114,243,22,188,236,156,211,190,203,145,192,190,122,116,201,190,214,56,23,63,63,136,96,189,174,41,90,190,59,206,64,62,179,144,66,61,27,41,103,191,189,126,49,190,126,68,18,189,40,91,45,63,112,59,90,61,117,247,71,62,164,201,75,190,183,52,173,62,190,228,120,189,140,249,106,189,168,122,106,190,27,62,104,62,176,63,232,190,169,44,28,191,8,156,135,191,128,187,172,61,209,192,63,62,171,119,209,189,207,88,46,62,200,171,90,190,104,246,71,62,200,198,23,190,28,146,15,62,129,195,230,190,12,172,49,190,191,32,180,61,147,173,230,61,85,88,187,62,130,176,197,61,109,117,38,190,223,128,152,62,254,230,151,62,73,106,47,191,236,153,151,188,97,172,197,190,76,179,191,61,37,202,92,191,153,21,171,190,10,25,241,189,115,90,105,61,74,61,157,190,166,241,182,62,62,103,1,61,114,244,194,62,6,129,49,62,132,72,5,62,236,150,238,190,87,96,188,62,208,180,197,189,174,212,175,188,190,58,115,189,51,221,58,190,152,248,212,189,47,194,150,61,21,114,103,189,218,62,46,62,198,136,2,62,224,13,215,62,184,197,176,61,24,159,247,61,122,154,179,61,114,107,233,58,56,100,254,190,149,231,65,61,245,124,99,62,120,162,141,190,97,176,240,62,57,54,163,59,149,215,83,190,103,164,16,190,196,168,173,190,207,118,171,62,179,168,202,62,19,4,7,191,86,78,3,191,180,1,42,191,155,140,6,190,61,234,41,190,238,87,172,190,215,115,242,189,136,82,118,190,245,10,95,62,95,75,151,61,163,103,98,191,67,61,38,62,69,75,244,62,253,131,11,190,91,39,132,62,104,132,150,60,162,72,152,191,116,27,239,187,8,22,197,61,135,67,208,190,228,79,201,190,101,79,105,60,117,18,114,189,170,248,70,190,118,183,37,188,255,89,195,188,231,39,251,61,121,24,220,62,140,14,19,189,115,141,168,190,208,206,69,189,85,12,143,62,114,107,67,190,72,190,177,62,0,201,154,191,107,157,126,62,7,214,93,60,65,115,43,191,233,163,143,62,215,252,141,190,111,203,74,190,187,95,177,62,176,193,64,191,75,227,250,189,184,225,134,62,85,166,116,62,110,77,196,190,203,170,50,62,207,89,81,191,113,48,115,189,245,221,153,62,98,113,184,190,148,152,164,61,75,17,247,62,81,34,254,62,255,128,77,62,182,51,169,62,100,84,28,63,148,252,93,190,164,42,151,60,47,46,206,62,40,231,24,189,68,218,171,191,124,76,47,191,58,239,214,61,88,140,142,61,29,239,49,63,123,176,53,191,16,38,174,190,206,110,170,189,185,46,46,62,252,166,188,190,174,251,158,191,121,58,144,191,53,127,246,190,208,127,139,62,48,217,13,63,31,7,197,62,1,175,242,190,246,186,222,189,7,0,116,191,76,123,191,188,196,239,124,191,42,243,231,62,56,171,194,191,85,235,161,61,249,186,129,62,11,94,252,188,113,222,215,62,247,76,18,191,24,23,92,191,215,166,61,63,161,126,194,62,10,70,15,61,16,212,64,191,38,163,199,191,208,102,139,190,199,26,188,62,85,152,130,62,41,236,108,188,165,232,158,61,55,211,145,191,50,21,188,62,6,1,222,62,96,2,84,190,113,212,141,60,22,125,236,62,132,125,246,188,59,103,115,189,97,241,107,62,132,98,197,188,158,184,197,62,83,42,189,190,32,196,121,191,60,11,128,191,252,36,152,191,163,27,47,61,71,31,110,191,94,115,40,61,40,26,30,62,161,33,5,63,152,231,227,61,176,75,149,189,219,32,112,62,64,129,206,62,158,96,223,61,253,138,32,62,19,243,179,62,251,121,215,61,54,204,166,62,215,180,224,62,157,63,69,191,231,33,240,62,133,141,58,63,254,168,55,60,77,207,58,191,255,40,11,190,197,208,146,190,17,236,86,61,241,27,75,62,190,93,167,191,52,215,146,61,176,87,26,63,98,116,176,62,190,250,21,190,211,1,166,61,38,238,136,190,170,197,43,190,165,239,108,63,114,177,171,190,117,144,188,189,227,40,24,191,61,81,203,62,117,50,144,191,90,16,150,191,70,89,119,191,87,35,45,189,68,72,161,62,23,169,199,189,106,106,185,62,76,225,91,189,73,16,2,62,128,248,254,61,176,19,183,191,155,26,24,63,44,58,13,63,123,52,217,190,4,21,144,191,251,68,191,62,147,103,49,190,111,38,201,62,212,48,56,63,251,149,65,191,35,89,177,191,119,57,141,61,221,70,155,191,147,241,40,189,153,78,6,62,68,143,179,61,90,217,251,62,49,216,72,190,245,239,20,62,58,22,203,191,199,105,192,190,35,88,105,191,170,186,227,190,7,234,19,63,160,249,215,62,203,93,255,62,182,68,126,62,191,143,69,63,174,42,230,62,1,56,202,61,38,175,200,191,142,32,171,61,183,145,19,191,228,152,8,191,246,31,51,191,12,22,40,191,7,55,196,191,247,150,57,191,72,184,167,62,117,213,155,190,188,127,60,63,187,96,166,62,142,112,25,62,104,146,100,62,230,5,202,191,175,15,52,190,80,122,27,61,144,121,173,190,69,86,150,62,211,242,156,62,143,25,13,63,102,178,28,190,229,180,209,62,14,248,18,191,4,196,249,190,27,51,126,190,75,199,167,190,41,96,94,63,166,118,88,62,90,241,252,186,239,170,60,62,249,34,150,62,188,204,8,190,232,233,19,62,255,144,99,190,55,238,220,60,107,79,174,189,192,78,15,63,25,61,107,191,242,7,219,62,98,208,174,189,51,73,241,190,184,220,163,191,168,40,27,190,248,189,125,60,0,9,87,191,174,208,14,190,159,209,131,191,161,138,131,191,145,178,141,62,201,116,175,61,49,198,14,61,146,202,189,190,98,63,188,62,174,191,176,62,57,152,129,188,52,141,91,191,190,105,149,62,50,82,151,191,73,115,18,190,232,41,27,63,150,186,181,191,4,117,12,191,73,121,136,189,235,93,128,190,67,83,181,189,64,240,202,190,52,177,35,63,84,254,181,62,180,41,124,62,77,137,233,61,6,112,133,191,241,49,182,62,145,148,148,61,242,186,90,61,199,56,112,189,121,125,123,191,131,137,179,191,241,166,228,62,153,131,178,62,161,28,37,190,21,139,164,62,140,149,138,62,249,29,130,62,95,127,19,63,179,146,237,190,17,123,91,191,5,126,149,190,70,203,56,191,219,154,28,61,247,65,244,62,230,79,89,62,154,200,66,61,133,198,99,62,42,55,149,191,91,248,91,191,168,167,186,62,131,148,193,62,1,3,33,62,150,184,86,62,126,249,197,62,129,133,168,190,169,161,68,191,254,48,101,189,245,3,19,191,89,150,91,62,163,191,68,190,220,139,145,189,175,17,168,191,78,195,136,62,118,65,138,62,66,56,10,63,133,160,225,62,125,58,217,62,228,168,79,190,235,112,193,61,128,209,178,191,193,202,139,190,243,13,65,62,255,47,160,190,142,35,111,190,204,68,201,62,132,102,25,63,56,54,61,61,195,23,26,60,73,251,168,61,18,182,219,62,4,143,20,189,56,90,5,63,233,197,97,191,205,41,7,63,181,233,28,62,65,76,190,190,45,87,211,190,109,30,218,190,105,113,54,63,222,96,136,191,143,116,39,191,29,115,124,191,161,60,238,189,210,53,1,62,253,66,240,62,27,214,78,62,123,122,8,61,63,34,37,62,56,205,253,190,36,179,172,62,114,129,163,190,40,191,204,61,182,165,216,191,231,53,62,62,179,208,238,189,185,168,239,62,50,112,13,189,159,2,195,189,164,207,131,191,163,49,8,191,238,100,13,63,59,170,137,62,152,46,214,62,52,248,39,191,219,196,163,190,223,240,21,191,223,250,24,61,101,55,237,62,11,126,150,190,213,227,157,191,176,79,45,190,63,105,27,190,168,211,29,190,55,164,110,62,9,62,42,62,23,27,249,61,219,100,31,191,201,129,172,191,175,192,111,190,141,230,19,190,5,207,8,62,177,129,198,62,77,67,246,62,148,113,17,63,22,51,127,62,149,15,58,62,45,229,126,190,229,113,110,62,42,9,121,62,235,48,253,60,97,199,240,61,211,63,100,190,14,108,65,189,124,239,76,61,12,254,0,62,49,133,155,190,122,33,232,188,210,53,61,62,158,39,137,189,90,234,166,189,16,128,147,191,225,176,114,63,46,116,21,191,106,46,157,60,162,223,199,189,97,96,28,191,161,170,154,190,166,170,228,60,98,80,29,191,235,149,178,62,116,161,141,189,168,202,92,61,39,130,203,62,15,57,62,191,52,227,102,191,12,141,35,62,29,15,113,62,222,90,155,62,199,214,157,191,37,228,242,62,222,133,228,62,127,127,221,62,151,163,182,60,106,36,149,62,17,223,143,191,3,108,17,190,36,78,161,62,162,155,217,61,88,204,174,61,101,69,131,62,222,23,227,190,82,233,186,62,220,122,122,62,199,3,38,63,219,63,184,190,209,214,47,191,34,221,0,191,205,242,163,191,170,209,45,191,247,152,168,191,45,82,70,60,186,28,8,62,131,221,155,61,150,105,67,62,229,21,27,190,28,152,35,63,132,75,147,187,80,159,55,190,232,82,238,62,63,32,92,62,56,41,81,190,54,222,207,62,95,6,244,61,211,7,198,191,202,136,60,190,206,153,150,190,102,215,138,62,87,57,223,190,110,33,182,61,210,64,36,62,180,255,36,62,82,209,86,62,27,253,208,62,92,102,23,62,143,60,174,62,244,8,201,191,88,236,26,191,73,108,132,62,46,235,69,62,118,232,78,63,176,197,125,62,114,115,8,191,235,244,179,191,205,253,251,62,219,131,226,59,160,159,224,189,194,34,153,191,127,129,54,62,54,39,51,62,228,254,221,190,6,240,249,62,11,59,76,190,240,20,197,62,166,253,233,61,149,73,238,62,208,221,76,61,171,190,131,191,25,79,57,191,51,25,146,62,171,97,86,190,178,222,54,191,64,196,105,60,45,15,115,189,191,224,158,190,179,95,118,191,56,82,10,63,195,241,107,62,61,130,107,62,23,176,45,190,22,92,55,189,163,180,21,191,237,77,254,61,81,22,53,191,214,134,58,189,119,225,143,189,28,218,200,62,251,166,149,191,91,247,242,62,93,244,176,190,31,201,185,190,22,187,44,190,251,149,2,191,197,162,151,62,188,47,32,191,157,82,2,190,35,150,20,63,152,144,223,188,160,242,36,191,181,68,144,190,96,188,52,191,159,175,179,62,168,232,189,62,244,107,148,60,149,192,173,191,115,151,80,62,152,117,66,191,126,77,91,191,117,104,92,191,250,224,120,61,213,6,231,60,245,114,26,63,41,204,14,61,84,172,148,190,125,85,37,62,253,174,208,60,223,157,57,191,127,130,174,190,17,141,139,62,137,61,61,63,160,5,25,63,232,129,166,190,50,66,165,189,27,237,106,191,125,153,130,191,203,240,170,62,6,80,10,63,37,247,108,62,36,0,158,60,73,238,213,62,194,208,88,191,231,186,130,62,223,85,184,188,151,119,240,190,169,246,208,62,250,4,141,62,97,41,157,191,87,6,106,191,124,239,83,62,141,40,18,190,200,143,86,62,114,152,252,62,54,137,82,63,95,192,102,61,86,210,64,191,39,81,128,62,41,47,86,61,53,43,171,191,222,23,53,191,3,213,172,189,229,141,82,191,128,100,167,62,195,130,52,62,127,175,207,191,247,35,82,190,49,45,187,190,47,67,60,63,172,182,151,190,53,43,199,191,2,190,135,187,129,39,24,189,84,218,34,189,29,217,184,189,17,6,139,62,30,233,35,189,219,49,148,62,80,210,214,188,39,238,201,62,47,10,47,191,189,25,203,62,108,105,216,58,3,176,72,61,179,192,20,63,94,55,157,189,135,67,90,62,200,56,76,191,170,200,217,62,160,148,208,62,212,165,126,191,23,160,186,189,210,160,25,62,229,108,17,62,111,193,52,191,225,183,119,189,245,199,76,191,223,102,83,62,11,118,131,62,242,43,130,62,113,113,15,191,145,227,149,62,243,148,237,190,187,96,185,62,112,196,169,189,124,19,63,63,206,226,0,62,65,37,54,191,142,111,132,60,29,187,104,191,78,55,221,191,168,218,210,191,73,5,181,62,52,115,25,191,134,11,158,61,10,185,17,190,77,162,78,62,61,245,12,191,82,81,105,191,223,37,201,61,249,124,204,61,51,52,244,190,33,183,144,62,251,247,81,191,53,22,100,62,129,99,184,62,253,255,41,190,87,107,31,62,12,141,151,62,251,33,38,62,229,3,89,191,28,34,17,62,157,193,79,62,3,139,94,62,175,247,102,62,24,226,68,191,3,158,155,62,63,61,40,191,31,115,81,191,166,169,142,62,104,172,5,63,63,238,197,190,91,106,211,190,6,180,216,61,97,95,146,62,176,165,131,62,131,21,99,191,202,47,146,190,178,183,235,190,190,119,51,189,3,119,151,191,235,135,8,63,162,98,178,62,185,106,130,61,134,214,119,61,33,202,28,62,127,22,166,189,23,50,184,191,85,227,148,189,58,192,22,61,50,24,151,189,253,84,200,191,114,84,2,63,234,224,179,191,23,193,7,63,118,154,133,62,245,93,126,62,58,136,128,62,39,198,127,191,45,153,227,62,183,157,49,63,109,244,102,188,52,203,58,190,106,253,192,62,140,16,226,62,189,30,149,191,70,34,102,191,25,127,219,60,178,249,204,62,179,4,124,62,37,198,156,191,7,56,8,190,144,82,150,191,90,62,9,63,231,158,171,62,40,239,34,190,156,63,195,191,183,159,108,191,235,171,137,62,230,32,165,62,138,117,100,190,129,126,116,62,21,181,7,190,92,181,1,191,134,254,125,191,149,4,141,190,121,101,163,188,119,245,149,191,108,72,161,62,242,164,57,191,247,95,149,62,189,104,39,191,49,35,15,63,216,73,235,190,201,74,25,61,24,116,116,191,130,124,26,62,128,108,240,60,156,222,189,191,9,12,54,191,130,124,225,190,43,161,162,190,213,210,240,62,109,35,150,61,86,167,153,60,138,30,203,62,67,100,168,61,91,102,81,191,195,44,147,191,75,108,34,190,226,47,166,62,36,139,179,62,97,195,39,191,172,19,135,62,247,16,173,62,46,15,96,62,22,20,186,190,172,161,118,191,161,15,33,190,8,50,93,190,78,108,85,191,142,211,145,189,215,58,90,62,36,4,156,62,119,20,95,62,30,32,235,62,121,118,40,61,190,2,156,61,227,136,241,189,127,120,253,190,228,215,119,62,177,212,53,62,113,75,200,62,10,24,233,62,173,84,12,191,242,86,188,191,220,38,207,62,180,150,45,62,82,167,215,62,224,92,147,191,46,4,11,62,175,158,8,63,131,217,180,189,248,248,10,63,188,70,7,189,185,233,192,62,32,252,32,191,189,62,232,61,58,100,159,61,75,164,16,190,137,243,137,191,63,69,68,191,47,196,214,189,184,139,70,190,196,171,114,188,73,128,19,190,139,138,217,62,71,11,192,62,110,245,43,191,133,229,164,190,27,177,240,190,48,246,14,191,188,28,244,190,137,100,199,61,60,109,16,191,62,96,216,62,0,80,75,62,194,148,210,190,80,247,236,190,166,235,229,62,155,2,14,62,172,167,217,62,67,157,24,62,110,95,138,189,70,160,236,62,147,165,149,191,204,31,156,61,210,166,83,191,34,28,104,191,61,179,219,190,190,250,74,191,170,157,139,62,33,158,198,62,14,89,191,191,124,1,136,62,231,93,254,190,143,51,157,62,210,23,64,188,2,114,217,190,3,34,9,62,251,20,34,190,174,130,129,61,233,199,28,62,206,214,169,62,35,217,225,62,231,117,206,62,31,96,147,62,170,140,13,62,75,81,41,60,241,147,213,190,64,244,88,190,67,136,237,59,217,232,133,62,176,97,159,59,138,211,151,187,1,17,98,61,23,239,165,62,15,237,148,189,107,233,15,62,13,100,235,190,57,185,177,190,3,53,181,191,158,61,180,62,21,215,202,62,42,217,185,191,10,145,184,191,40,34,55,61,66,240,17,61,235,107,15,191,121,235,168,62,67,225,171,190,7,177,131,190,98,72,171,189,190,238,129,62,137,175,144,190,102,87,191,62,167,185,20,190,55,218,168,190,167,86,169,62,58,104,199,189,79,223,50,190,60,64,30,62,215,27,198,62,201,134,190,62,253,15,133,62,73,216,158,62,132,29,17,63,114,43,129,191,241,80,0,61,42,191,62,62,18,196,241,62,203,84,19,63,58,108,203,190,132,96,18,62,209,101,6,191,27,149,9,63,181,16,0,191,239,68,226,62,106,110,21,190,121,142,188,191,109,73,239,190,17,195,107,191,173,248,56,60,120,53,159,62,73,184,116,62,213,55,0,63,9,232,40,63,68,104,200,62,174,131,43,191,7,73,235,62,151,41,13,61,176,36,192,189,241,250,156,191,81,214,137,62,144,108,6,63,40,238,194,62,80,247,214,57,104,100,38,191,112,229,215,190,135,172,237,62,232,57,128,189,216,29,33,189,0,112,76,62,233,40,69,62,200,151,16,190,100,99,57,189,179,247,43,63,148,179,218,62,143,231,168,191,32,93,72,189,81,189,67,191,192,154,141,190,10,222,108,62,224,31,144,62,47,56,55,190,86,251,85,61,139,100,36,190,45,107,10,190,129,191,63,190,5,94,180,190,48,202,66,191,22,252,152,62,124,220,40,62,230,161,11,191,196,27,176,190,124,187,210,62,42,18,136,191,202,227,139,191,126,69,9,191,8,133,66,61,69,227,174,62,18,134,50,63,80,171,152,190,194,69,12,191,28,231,185,191,163,126,115,187,144,216,59,188,96,179,219,62,42,110,182,190,124,102,250,190,189,79,217,190,90,243,3,191,91,225,175,191,75,48,223,191,139,255,137,62,48,114,191,190,161,255,128,191,216,18,214,62,173,244,142,191,74,164,175,191,104,248,196,190,120,4,68,62,43,88,17,62,19,246,142,62,142,157,151,191,42,148,142,191,77,56,142,189,78,180,220,189,121,17,55,63,204,34,136,191,88,164,94,62,60,109,154,188,156,91,193,62,7,143,210,62,81,164,167,62,11,211,9,190,239,92,232,62,67,247,164,61,177,135,114,60,250,193,177,62,244,252,150,191,85,248,78,62,100,222,180,61,58,57,5,62,113,71,26,191,175,229,60,63,39,59,92,190,80,21,22,191,62,175,186,190,123,243,255,60,3,122,63,62,123,212,108,191,81,123,167,62,158,116,113,189,198,6,19,63,236,186,167,62,250,168,172,62,144,91,23,190,211,236,164,190,158,179,34,61,15,131,236,62,163,3,20,61,127,231,209,61,210,106,173,62,118,1,170,191,218,215,160,189,15,67,199,190,190,160,180,62,195,183,242,62,137,60,181,61,145,196,38,62,197,87,225,61,51,43,238,61,122,238,69,191,206,61,168,190,71,248,58,191,6,114,253,188,203,191,146,191,203,94,0,61,136,8,252,61,110,137,146,190,180,252,88,191,0,78,112,59,237,42,40,62,176,172,160,62,84,143,235,62,83,15,83,60,198,223,144,191,194,37,38,190,108,161,154,190,167,247,138,188,158,144,35,191,201,117,173,190,148,82,1,61,99,175,30,189,248,46,34,63,5,65,68,191,140,46,94,62,73,111,171,62,169,228,187,190,30,174,13,191,253,193,243,62,127,79,11,63,233,248,101,62,97,227,96,190,169,19,67,189,120,36,78,63,168,123,173,189,150,247,142,61,168,176,161,61,183,47,174,189,17,27,195,189,35,109,135,61,153,141,169,62,31,245,121,62,189,231,2,188,70,96,167,62,16,27,120,62,152,204,30,63,96,153,151,62,224,175,42,63,55,222,88,191,44,137,163,62,109,37,10,187,237,235,135,62,108,107,85,191,21,175,16,187,71,165,226,190,221,114,80,191,235,217,16,191,227,47,142,62,220,43,49,63,74,53,168,189,202,127,126,191,46,98,79,189,253,44,66,62,217,76,182,62,195,27,145,62,197,127,202,191,199,65,234,62,230,208,75,191,218,62,161,61,141,245,207,190,127,170,245,62,174,167,84,62,22,88,10,62,169,181,70,62,252,129,12,190,38,49,183,190,236,64,131,191,10,106,184,61,159,80,146,190,54,25,174,61,7,218,173,190,23,73,9,190,132,66,12,191,192,247,234,61,193,255,108,62,238,192,193,61,185,200,141,190,183,188,242,61,148,154,216,62,85,219,133,62,36,249,156,62,156,163,10,191,227,131,237,189,125,121,226,190,31,134,197,190,186,54,252,62,101,253,92,191,188,167,66,60,217,8,43,190,124,132,238,62,237,93,182,61,237,207,202,190,64,32,238,62,38,157,150,62,88,31,244,190,211,237,51,189,69,42,129,191,76,13,28,191,61,16,230,60,173,247,34,190,214,111,57,62,245,119,28,190,165,29,37,190,2,44,123,190,72,219,72,190,99,90,28,190,119,171,66,189,125,144,236,189,217,65,223,61,176,117,231,190,223,255,209,190,60,228,228,61,216,69,56,190,200,104,157,62,59,62,227,62,112,34,136,60,74,175,56,191,166,97,127,61,221,59,151,62,49,189,151,190,211,123,114,62,2,54,84,191,127,32,194,190,51,165,129,62,123,165,174,190,3,98,10,62,119,161,186,62,172,150,87,189,244,48,21,190,159,6,22,62,16,190,160,190,149,201,191,62,5,152,120,61,236,80,137,62,233,0,224,188,66,76,24,61,225,78,99,62,66,92,65,61,178,250,160,62,176,27,183,62,32,98,140,62,54,178,131,191,113,39,52,191,112,243,36,62,54,66,118,62,92,156,177,62,229,145,135,62,116,63,163,191,51,142,49,62,193,107,133,61,67,142,150,61,112,103,139,62,9,222,82,191,219,147,179,190,51,142,1,191,53,44,241,61,68,239,4,62,160,138,104,59,72,80,154,62,64,217,146,189,97,200,161,60,195,40,115,62,207,248,9,191,251,0,167,62,191,230,83,59,212,220,203,62,116,254,176,190,33,117,164,190,184,65,133,62,224,201,240,189,105,151,93,62,223,88,154,190,89,255,252,188,199,29,89,191,238,42,167,62,200,236,9,189,173,186,117,188,244,160,237,62,169,74,219,61,249,52,143,188,188,18,34,190,145,204,170,61,42,22,107,190,115,104,201,60,230,253,239,189,29,185,217,61,197,121,155,190,176,117,230,61,238,180,28,190,39,124,141,62,87,115,99,62,2,29,139,191,93,152,219,190,92,190,62,62,111,204,208,61,183,131,139,191,156,96,205,60,77,157,213,188,104,239,255,61,21,216,29,61,20,148,43,62,237,88,71,187,91,251,245,190,200,198,43,191,14,37,156,62,4,18,9,190,130,45,196,189,73,174,156,62,142,222,170,62,88,255,29,190,159,29,121,190,101,153,172,61,201,242,85,191,187,241,245,61,13,36,61,62,92,140,170,62,102,121,167,61,169,150,90,188,87,176,231,189,99,221,20,63,203,57,92,190,