{"meta":{"epsilon":0.009986238554120064},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[79,8,129,189,236,11,247,186,37,131,28,62,125,226,249,188,78,198,137,190,0,72,203,62,96,147,122,62,145,124,88,62,25,35,177,62,146,227,150,61,228,38,176,190,27,110,21,190,209,143,40,62,93,33,251,190,198,195,232,189,118,53,23,190,209,125,26,62,180,215,29,61,89,182,29,190,106,58,244,61,110,155,137,59,8,109,199,189,203,195,122,62,102,146,228,62,116,8,141,191,40,47,129,62,46,185,125,61,32,99,235,61,53,130,138,190,9,115,188,62,121,153,56,61,76,160,171,62,137,71,239,62,138,110,227,189,100,235,225,190,172,24,26,63,3,99,161,62,224,84,244,189,137,39,55,62,221,9,202,190,206,14,161,62,224,52,71,62,73,95,88,62,255,76,40,191,135,186,105,61,27,174,117,62,166,206,161,189,223,204,44,191,175,207,249,190,94,153,200,62,90,84,37,61,246,115,43,191,128,157,251,189,227,200,223,61,166,72,165,62,11,121,135,62,114,239,134,190,64,153,133,189,230,236,41,190,223,217,133,189,38,24,166,190,172,16,176,60,88,225,87,191,13,75,58,190,156,46,24,188,170,90,41,191,246,251,60,62,160,212,236,59,205,189,72,190,112,30,253,189,135,90,72,63,125,23,250,190,233,191,116,62,74,178,212,61,245,47,23,60,113,73,126,62,44,249,152,58,164,157,195,190,169,151,150,62,70,167,92,190,62,2,166,190,161,8,8,62,222,211,154,190,25,226,136,191,162,181,7,189,111,12,120,190,157,204,161,189,111,58,31,62,5,200,227,59,253,47,15,191,211,73,156,190,238,167,192,62,153,176,37,191,116,128,6,191,51,130,139,62,71,221,83,62,107,151,22,62,229,89,197,190,178,7,45,62,255,183,250,189,155,28,249,61,232,164,41,62,232,146,23,188,230,245,152,62,180,74,74,62,19,148,11,63,246,204,85,63,22,228,100,189,246,25,87,62,21,199,143,188,125,213,225,62,38,243,25,62,166,251,10,190,77,208,177,190,69,199,0,190,71,147,2,190,65,184,221,189,188,58,94,62,190,161,210,190,192,143,234,189,143,208,158,62,189,243,240,62,232,80,207,62,155,121,37,62,156,104,229,61,230,224,250,60,230,109,121,60,135,51,30,190,26,129,18,191,232,40,32,63,6,136,102,62,217,75,32,62,158,247,136,62,165,205,120,190,52,248,68,189,214,28,26,189,56,139,23,63,183,246,43,61,39,36,72,61,168,98,225,61,26,150,202,188,178,176,57,62,39,108,145,190,86,141,45,191,8,140,56,63,238,222,81,62,157,24,176,190,108,62,1,62,136,88,174,188,69,155,233,190,94,127,14,191,166,146,4,63,214,132,156,62,71,218,28,188,211,198,1,189,209,188,156,190,49,126,174,62,123,181,132,189,112,104,118,190,253,246,253,61,209,63,68,190,61,121,124,189,89,61,17,189,206,43,50,189,91,252,253,62,55,24,246,62,24,14,232,188,62,249,143,62,148,1,178,61,17,114,87,190,228,179,95,190,175,15,191,61,207,36,57,61,247,114,212,61,96,220,26,191,178,179,187,62,18,94,107,190,88,94,113,190,5,174,164,60,206,220,171,62,12,200,100,191,135,89,148,61,24,43,137,62,150,9,104,188,111,106,211,189,81,165,112,191,141,226,243,62,139,124,108,60,211,235,135,62,116,116,17,63,27,215,34,191,70,151,154,190,233,212,74,62,46,239,26,61,171,211,72,191,92,6,243,189,97,213,77,62,81,121,204,62,111,73,71,189,89,161,21,61,168,188,246,190,88,237,0,189,157,163,207,190,27,18,107,189,160,72,191,189,122,29,116,190,222,215,27,189,22,176,4,190,31,199,177,61,229,173,89,61,91,7,144,191,27,171,65,189,79,108,194,62,187,42,237,190,171,29,138,59,202,29,115,62,187,88,141,189,253,175,173,190,225,238,158,62,13,47,73,190,156,40,155,190,30,6,167,61,113,31,141,62,104,33,242,62,92,81,60,62,132,251,226,62,87,240,82,61,63,164,218,61,157,37,88,191,129,21,18,191,63,243,229,61,243,170,67,63,7,23,214,62,244,160,126,61,183,33,158,62,202,41,168,190,253,156,84,63,243,164,94,190,64,116,184,188,28,152,241,62,200,252,73,63,211,70,52,190,133,108,216,62,131,54,147,61,132,92,162,191,36,94,155,62,245,221,200,61,237,45,193,189,220,208,136,190,65,163,130,62,174,173,151,189,125,206,60,190,221,206,110,189,195,127,6,60,74,193,252,189,178,81,227,62,5,127,3,189,146,169,118,189,212,8,123,191,81,134,146,62,33,208,128,188,79,237,65,61,131,181,16,190,89,80,72,190,6,140,125,62,124,95,121,190,135,194,178,60,223,114,11,190,43,147,226,187,157,177,83,190,3,113,12,191,128,76,164,189,211,233,215,62,34,238,184,61,99,115,207,60,244,186,242,190,43,89,47,62,180,36,238,60,74,36,189,60,67,209,66,191,134,48,135,190,128,155,149,190,141,234,135,62,15,40,191,190,21,114,85,190,74,210,153,189,51,166,245,189,12,63,1,191,116,15,185,188,214,179,37,60,239,15,233,189,201,19,236,61,241,73,168,62,39,95,64,189,11,252,75,190,195,62,156,62,50,72,22,191,200,116,75,61,50,211,18,60,221,138,164,190,134,17,42,60,170,156,161,190,12,155,201,190,175,198,24,63,232,65,153,189,24,70,228,190,161,160,128,62,97,201,22,190,163,230,128,62,206,219,220,189,108,75,128,190,33,195,149,62,107,156,95,190,31,33,189,62,163,202,129,190,2,31,162,62,50,143,166,189,38,24,66,191,69,11,60,190,124,4,249,189,205,155,192,62,118,53,173,187,245,195,103,62,126,130,220,189,154,55,179,61,175,226,37,190,36,22,83,62,145,139,237,62,153,27,219,189,140,3,159,189,96,29,57,61,220,37,226,189,236,32,156,190,57,156,220,62,48,196,53,62,51,10,63,62,142,152,129,190,86,27,51,62,55,213,202,189,209,56,215,190,149,193,20,63,182,162,10,190,168,44,175,62,236,77,159,62,39,225,175,190,122,213,78,190,52,165,32,190,125,201,58,190,140,233,74,191,246,70,227,60,124,240,172,61,78,187,50,61,167,254,200,190,38,91,242,189,93,57,249,188,50,225,156,190,214,32,66,62,177,108,185,61,137,28,113,189,11,41,21,189,233,250,244,62,214,177,193,190,188,91,98,61,170,89,203,189,225,112,157,62,50,242,151,62,63,37,222,61,85,152,202,190,206,61,158,62,114,231,119,62,80,155,206,189,84,96,227,62,172,99,36,63,58,60,55,62,59,141,20,191,116,233,80,189,199,137,121,189,212,220,196,190,152,117,193,60,249,36,142,190,206,9,55,189,84,159,3,63,48,92,103,62,216,67,205,62,99,184,197,61,139,217,216,190,107,5,164,62,165,127,47,62,157,129,166,61,15,74,135,62,252,91,64,62,85,113,8,62,88,179,64,62,71,75,40,59,228,83,30,190,134,13,104,62,138,121,78,60,220,93,14,63,182,235,9,191,113,89,135,61,46,95,176,62,211,44,26,61,128,52,47,62,242,176,212,62,101,23,66,189,170,61,34,190,227,107,58,61,231,140,191,188,196,144,113,62,45,171,41,61,82,27,202,189,94,26,171,189,203,108,60,62,82,90,91,190,37,64,120,190,4,97,204,61,140,184,196,189,30,161,16,190,186,250,183,62,242,197,139,191,202,11,178,62,41,129,82,191,60,177,115,191,230,132,92,190,221,81,140,62,56,54,215,188,198,201,56,190,167,164,75,58,100,52,204,61,173,97,204,190,186,236,119,190,168,2,53,189,71,148,211,62,64,152,38,190,132,233,223,188,6,224,125,190,253,158,160,62,118,137,182,189,241,55,171,189,173,108,46,63,225,8,193,190,141,190,250,61,174,17,97,191,83,192,6,63,16,79,215,189,101,114,205,62,250,181,214,188,54,241,170,61,214,235,69,61,41,135,35,191,222,200,141,190,13,203,12,190,33,117,74,191,108,13,126,62,159,139,247,189,5,227,141,62,160,24,4,62,139,90,60,190,68,218,161,189,2,138,18,62,192,185,125,189,7,57,13,190,108,241,205,61,100,169,12,190,182,224,242,60,82,224,208,62,177,241,59,190,190,206,84,190,87,52,56,188,47,153,67,62,55,162,185,190,180,0,45,191,39,255,52,62,84,9,160,62,55,85,221,62,243,45,124,190,5,189,158,191,56,85,18,62,23,156,140,61,117,139,202,188,84,51,176,190,76,182,13,63,81,42,39,191,254,164,165,191,38,110,118,188,10,166,155,62,148,5,176,190,246,108,141,61,157,112,87,191,108,154,108,62,43,189,10,189,118,96,15,62,45,60,41,191,140,113,19,61,96,102,85,62,134,81,244,60,124,212,180,62,198,28,117,62,203,104,83,61,29,64,226,190,18,59,94,189,104,195,31,191,60,250,97,62,235,20,245,62,131,140,121,188,78,180,32,188,183,156,19,63,192,58,97,190,31,114,88,62,245,143,195,61,220,193,45,62,228,201,134,62,86,28,95,62,15,223,134,189,57,58,154,188,204,176,145,61,165,13,131,61,196,148,207,62,73,89,195,189,193,209,72,61,31,187,146,61,244,84,25,61,172,63,69,189,45,214,69,191,36,204,190,189,97,55,255,58,191,115,124,191,163,83,186,190,190,192,158,62,201,213,91,59,10,65,101,189,166,254,9,63,9,210,191,60,161,20,82,189,145,148,161,62,133,137,96,62,215,97,241,61,60,193,247,190,187,80,242,61,12,216,170,61,108,71,78,191,60,36,218,189,53,137,169,189,79,20,147,190,111,216,206,190,70,168,78,62,1,161,72,190,103,10,194,61,218,10,24,191,67,227,27,190,203,219,170,190,92,29,36,63,108,205,70,190,57,36,104,62,64,159,3,61,217,81,14,62,222,184,115,191,91,101,179,61,105,113,5,191,177,168,158,62,119,48,158,189,55,27,60,191,11,68,179,190,153,134,46,62,47,59,215,189,113,94,113,191,113,195,119,60,213,4,58,190,168,30,60,61,230,188,27,191,49,72,85,61,253,231,18,191,89,42,48,62,250,221,57,189,119,11,7,191,195,244,128,62,11,41,225,62,216,6,144,61,37,77,102,62,9,99,108,189,26,64,80,188,180,50,8,61,197,136,86,62,235,44,7,60,68,127,37,62,18,214,155,188,224,61,131,62,61,54,197,62,163,104,250,188,18,81,110,62,160,46,12,62,76,249,179,62,105,22,117,62,107,246,154,189,64,65,6,62,46,215,49,189,188,70,35,63,100,105,33,190,178,138,101,62,132,181,104,60,85,110,113,61,176,173,218,189,219,117,166,190,166,213,5,190,71,16,140,62,210,136,152,61,222,25,29,62,18,119,89,190,169,199,154,190,215,93,211,189,176,209,3,61,43,143,91,62,209,54,32,63,241,85,206,190,174,71,166,189,39,79,246,61,188,198,137,62,88,138,135,190,199,162,131,190,128,39,105,188,207,204,23,190,115,9,137,61,63,17,152,188,250,129,253,62,179,204,11,62,140,65,15,62,79,66,207,189,106,152,146,61,44,68,54,62,211,93,5,191,115,101,146,189,248,110,197,61,17,123,234,62,212,247,130,190,80,228,213,190,84,110,174,62,197,200,0,190,36,50,184,188,97,132,181,61,101,167,17,63,85,240,102,62,13,3,49,190,219,178,239,61,153,85,90,62,169,254,153,191,212,102,92,62,123,19,166,189,43,133,48,60,11,83,29,62,192,98,44,61,162,145,134,60,114,163,146,188,7,184,81,62,216,64,144,62,85,167,138,62,47,34,73,62,164,201,156,62,68,148,11,190,41,51,1,190,148,102,149,191,185,133,150,62,70,184,252,189,28,80,245,190,9,178,94,189,141,218,58,190,253,91,109,62,12,21,198,189,240,28,85,190,88,102,109,61,85,158,219,190,118,253,242,61,177,132,188,61,166,221,14,190,119,93,14,190,159,78,211,62,238,113,215,61,88,66,140,190,89,46,114,62,189,173,215,62,3,229,38,190,211,247,167,190,121,193,212,189,31,211,7,191,136,251,108,61,116,43,31,62,250,170,40,191,65,201,133,62,213,147,232,61,49,116,152,62,93,50,196,61,91,240,158,190,122,86,180,190,3,220,208,189,54,90,137,190,221,222,161,62,143,117,81,190,157,35,114,189,94,135,23,190,89,147,6,189,228,113,155,61,75,126,118,61,22,43,70,62,119,60,186,189,21,211,116,190,241,187,142,189,215,10,165,189,217,194,44,189,246,201,216,190,49,233,142,190,112,110,114,62,109,119,149,61,131,42,191,190,148,206,236,61,146,146,128,190,195,71,173,61,32,70,40,190,38,25,191,62,14,208,103,190,12,57,29,190,27,108,249,189,135,54,22,62,15,2,177,61,182,76,61,61,78,179,182,189,163,159,1,62,95,238,118,61,15,253,240,62,164,248,207,61,10,191,21,191,67,86,65,190,222,54,235,190,234,231,173,189,0,59,30,62,147,81,127,62,104,212,171,62,165,230,137,190,58,196,70,189,154,100,142,61,168,51,215,62,91,190,130,190,168,199,209,189,148,62,205,62,141,154,209,188,2,130,203,62,243,112,115,190,243,145,32,190,170,92,34,61,96,9,138,190,211,136,60,62,159,144,97,61,123,111,1,62,211,68,33,61,77,69,233,62,135,129,172,61,73,122,134,61,231,207,23,62,169,136,186,190,126,252,148,61,192,39,148,62,156,5,182,61,26,207,129,190,137,226,64,61,122,198,153,62,109,138,147,190,92,11,153,61,158,198,3,62,187,184,42,190,2,88,47,62,205,52,73,189,22,170,176,189,189,207,217,189,104,36,245,62,234,28,144,60,120,34,214,61,117,97,233,61,215,145,163,189,70,170,198,188,79,230,98,185,5,125,56,190,209,78,4,190,204,120,15,190,105,195,174,190,20,185,211,189,204,235,4,190,142,141,2,191,54,134,205,190,222,36,87,62,153,132,46,186,94,57,153,189,46,73,31,189,137,211,120,61,193,183,231,189,143,157,124,190,60,207,1,63,74,79,233,188,153,82,148,60,83,157,56,62,123,121,77,62,11,19,236,57,179,96,40,190,86,192,160,188,32,111,3,62,97,223,81,62,230,90,90,62,33,172,153,62,82,5,245,189,185,47,221,62,91,63,64,190,220,89,214,62,16,253,93,59,65,110,192,189,63,252,246,61,227,249,23,62,216,74,22,62,33,110,13,190,7,80,33,62,102,253,128,190,129,143,211,62,124,138,183,190,218,87,33,187,248,253,186,189,34,185,95,60,77,60,98,62,198,135,209,61,236,198,104,61,5,240,180,190,66,5,144,62,232,214,90,187,234,74,172,189,242,255,138,62,165,180,4,191,78,222,142,60,187,3,119,62,109,8,202,189,134,167,148,61,61,3,149,190,165,63,91,61,114,253,245,189,25,142,113,187,69,109,137,189,216,161,99,61,160,84,49,189,219,243,47,190,60,227,37,62,182,18,198,188,62,136,183,190,7,71,32,62,231,172,106,62,183,110,162,189,222,164,255,60,35,115,3,190,107,185,12,191,119,204,9,189,237,84,181,189,150,182,176,62,6,149,165,190,174,148,26,63,212,250,136,190,111,192,85,189,116,110,161,61,30,54,136,190,162,7,235,60,214,19,239,187,189,145,45,62,170,219,134,61,38,3,29,190,148,33,245,61,5,94,247,190,188,232,4,60,121,9,177,62,61,189,139,62,163,243,246,58,41,15,180,187,234,94,146,62,186,176,242,189,153,57,183,189,164,117,140,62,243,179,27,188,32,16,137,62,191,191,166,61,198,176,89,190,113,66,28,61,161,126,10,61,236,156,244,61,21,196,243,190,155,51,71,190,153,53,149,61,163,210,200,185,63,0,116,61,7,152,218,61,131,111,66,191,137,234,108,62,18,109,173,189,236,124,132,60,51,16,208,189,255,176,229,189,135,141,204,189,235,60,8,190,233,131,130,190,26,95,210,186,73,83,174,62,37,178,124,61,173,119,116,190,79,163,108,60,205,107,137,62,70,46,143,190,7,169,88,190,141,140,238,61,171,184,158,189,135,29,95,190,46,131,58,62,63,192,254,62,159,177,18,61,195,180,72,189,90,115,90,61,21,164,183,62,255,105,227,188,89,212,54,189,111,79,178,189,57,167,9,62,3,223,43,190,90,229,204,62,198,45,15,190,192,93,31,62,131,248,154,61,82,2,23,188,143,136,155,188,58,172,177,61,179,42,129,61,14,56,52,189,170,236,173,190,80,24,207,60,209,17,22,191,93,169,159,62,96,241,57,190,205,125,230,61,232,30,133,188,215,203,105,190,33,97,106,190,34,18,6,62,205,208,166,189,254,29,8,186,101,196,205,62,34,74,188,189,20,138,182,189,74,69,179,62,192,154,82,190,62,203,138,61,34,127,141,189,11,126,67,191,148,110,153,61,155,28,84,62,76,159,73,62,46,59,165,190,202,33,157,190,98,54,174,61,8,51,185,62,73,5,8,61,34,207,29,187,65,64,168,189,136,130,85,62,30,68,72,62,169,33,34,190,156,1,194,62,72,219,239,189,0,121,241,188,100,68,52,190,168,224,242,189,66,198,160,189,153,114,89,62,91,142,206,189,219,22,116,62,171,17,33,190,182,36,124,62,229,186,194,60,138,150,15,189,215,77,203,60,25,134,151,189,209,155,208,190,158,157,36,190,61,194,84,63,55,233,49,189,104,243,32,62,238,51,118,62,102,20,116,62,235,3,235,189,171,150,57,62,252,227,3,190,104,155,7,190,68,108,166,61,248,253,90,61,246,96,35,190,70,82,73,62,39,45,72,190,218,8,80,190,97,134,96,190,131,211,114,191,86,202,174,62,118,144,197,190,41,243,68,190,165,90,81,62,252,159,47,190,254,228,205,62,246,99,84,188,37,110,182,60,152,102,112,191,91,148,110,61,148,198,153,59,184,32,170,60,46,221,163,189,226,183,232,189,30,81,82,191,248,87,62,191,93,93,130,61,65,58,254,189,176,112,218,62,43,223,236,189,180,127,153,189,210,33,245,62,199,110,140,61,125,59,32,191,79,150,79,60,95,126,22,62,157,81,198,190,150,215,77,190,18,121,203,188,42,185,93,61,42,198,180,190,133,213,15,62,43,97,94,62,110,60,203,189,148,98,10,190,133,250,196,188,30,178,212,61,159,72,254,60,217,194,113,190,212,146,51,190,94,12,224,61,234,50,162,62,189,162,93,62,173,52,184,190,176,97,198,59,71,58,156,190,203,103,127,190,111,167,178,61,226,38,175,189,39,38,202,188,171,167,12,190,56,3,165,189,205,147,97,58,0,254,160,190,39,110,163,60,93,90,135,60,2,59,167,61,210,150,186,187,20,27,46,62,193,155,81,189,126,144,13,62,222,73,119,190,142,39,205,61,42,232,233,188,144,148,138,189,35,191,230,188,68,210,40,190,135,143,0,191,253,167,89,190,144,161,85,190,228,81,211,62,78,13,205,59,77,180,219,189,168,213,9,190,173,156,192,190,75,25,202,189,66,184,170,190,181,160,88,62,32,0,60,190,159,22,50,60,68,252,37,190,25,18,37,62,212,161,164,61,251,247,71,62,30,63,149,190,245,88,117,62,90,140,11,190,115,84,55,62,241,42,140,189,221,132,134,190,217,98,255,59,51,187,250,61,6,60,172,61,134,114,167,190,91,195,41,189,46,52,22,62,131,40,57,61,177,238,142,189,207,174,201,189,247,184,0,190,32,84,116,189,251,85,221,61,55,111,148,190,170,120,101,61,124,140,221,62,86,145,233,189,36,90,101,62,166,177,206,189,41,142,178,61,152,230,81,189,30,159,232,190,138,135,97,190,197,118,58,61,231,153,158,189,161,116,224,189,208,108,33,61,88,172,170,60,141,51,145,189,236,140,25,191,226,245,183,61,202,227,173,188,173,175,188,187,195,170,130,61,138,40,47,190,105,163,212,61,228,160,139,61,203,76,251,61,127,177,21,62,233,25,141,61,30,31,21,191,141,58,145,61,147,208,89,61,40,239,30,61,140,186,23,62,122,255,179,189,20,155,82,190,208,255,186,61,37,80,14,60,153,43,109,190,218,255,189,61,255,140,22,189,15,99,202,187,94,19,140,62,230,63,239,190,160,48,43,189,189,218,252,190,146,110,47,60,87,0,146,190,81,135,140,59,90,115,98,62,244,48,193,61,99,179,174,60,83,178,218,61,225,153,1,62,57,218,229,61,129,142,207,189,165,29,116,62,155,215,203,189,124,46,89,61,203,81,143,61,33,177,61,58,15,22,164,61,191,193,219,189,37,112,34,61,186,68,181,61,159,151,36,60,114,206,40,62,32,168,5,188,119,203,163,189,243,87,215,190,13,81,91,190,168,174,115,189,95,215,67,62,105,157,161,190,138,169,185,190,68,21,167,62,74,241,181,188,77,212,235,187,52,70,151,60,107,12,188,61,82,47,62,59,106,82,232,189,109,41,7,188,61,76,36,190,239,43,169,61,122,43,190,188,202,84,218,60,152,171,156,189,132,227,242,189,70,40,83,62,204,22,55,189,228,166,7,191,115,76,82,191,241,191,175,61,174,24,189,60,175,89,35,62,109,20,157,189,182,163,121,60,113,201,48,62,50,33,31,61,220,244,164,190,82,3,191,62,129,226,147,61,171,241,178,62,12,166,153,62,95,242,224,189,19,98,51,187,65,151,99,61,71,68,155,62,230,135,209,62,203,140,144,190,150,143,136,61,200,66,90,62,154,7,118,187,140,81,18,60,242,182,138,62,242,119,74,189,69,183,242,61,175,1,11,60,28,14,166,62,70,52,58,190,33,58,40,60,141,236,94,62,73,120,138,61,182,229,200,61,85,127,80,62,192,246,145,190,36,184,250,189,126,23,89,190,229,83,45,60,60,44,25,190,36,78,234,61,45,125,209,61,148,92,100,189,94,183,45,190,30,241,129,61,180,182,33,62,143,237,148,62,187,144,48,62,143,169,190,60,170,39,177,60,142,74,175,190,47,95,14,191,4,232,143,190,87,61,216,189,5,112,27,61,55,234,190,188,37,77,234,189,57,94,112,189,157,102,40,60,134,74,21,60,203,90,37,190,8,147,154,61,120,186,77,62,128,239,138,62,144,82,40,62,34,158,164,189,112,103,115,62,145,66,133,62,231,189,35,62,99,66,177,189,14,246,108,62,106,96,3,60,88,128,128,62,246,126,197,190,224,225,202,61,221,152,6,190,28,46,53,190,250,79,12,189,177,114,70,190,192,91,193,189,63,57,80,61,114,19,163,189,226,71,68,61,74,115,169,190,156,184,206,189,20,252,20,62,193,30,194,188,195,38,40,62,33,39,20,190,153,53,36,61,123,253,250,188,197,31,147,62,204,239,182,189,90,130,135,190,103,4,148,61,159,119,56,62,205,123,66,58,248,203,172,190,214,237,94,190,253,181,132,61,228,149,60,188,94,206,153,190,189,248,184,61,239,156,133,190,95,204,65,62,230,22,96,61,219,112,48,190,148,40,232,59,230,67,186,190,130,222,19,189,2,10,159,189,202,146,150,188,222,4,93,62,129,38,30,62,209,23,167,189,60,18,103,62,209,8,156,60,231,42,236,188,44,93,114,189,144,195,132,189,174,253,11,63,184,198,149,188,112,191,134,60,148,213,24,189,81,50,211,61,48,145,135,189,178,144,155,189,70,9,231,61,252,203,195,189,221,62,131,191,79,122,107,190,222,15,235,59,211,149,235,62,90,163,1,61,59,208,146,188,169,18,13,189,38,19,244,190,2,13,242,60,132,24,37,190,49,81,194,190,113,182,164,61,163,10,37,190,79,21,39,190,184,108,162,188,232,64,50,61,88,175,223,61,171,47,0,62,4,52,36,62,254,157,148,61,230,20,66,62,114,16,215,189,230,31,107,62,151,21,36,62,182,216,42,62,62,193,132,61,1,33,7,190,235,70,61,60,173,64,223,190,54,179,167,60,209,206,97,61,128,153,83,62,34,2,28,190,53,183,100,190,122,199,80,60,72,176,236,61,188,160,217,189,7,116,78,191,108,13,147,189,1,232,107,61,6,7,86,62,209,203,91,62,138,216,27,191,29,48,236,61,36,16,88,190,79,105,243,61,141,179,0,190,107,21,55,190,115,95,36,62,106,135,37,62,90,28,17,62,94,211,77,190,225,160,105,62,104,226,183,189,219,2,166,190,142,153,6,62,118,49,221,61,116,222,51,61,172,199,3,190,136,41,0,63,238,182,10,190,99,59,135,190,187,200,221,189,238,157,178,189,244,204,108,61,115,153,192,190,227,94,191,60,156,176,122,189,71,155,136,61,143,119,206,190,82,237,100,189,210,200,253,60,51,25,76,62,191,41,181,61,247,246,75,61,198,41,49,62,13,54,179,188,8,174,170,60,83,78,184,60,228,106,42,190,203,57,148,190,83,250,128,61,88,194,105,61,227,66,23,62,119,166,24,58,31,81,178,62,207,177,49,61,43,34,164,189,98,120,30,190,0,209,179,61,13,102,173,188,83,183,212,61,52,124,38,62,228,164,72,61,59,103,9,190,46,97,190,190,3,32,192,189,214,168,24,61,142,82,241,189,165,244,193,188,112,244,121,62,67,105,222,61,67,127,118,61,91,31,81,61,176,199,110,62,50,94,98,187,60,79,147,190,45,226,60,62,49,214,119,61,187,118,108,190,249,138,17,191,73,240,90,188,213,38,233,60,190,0,136,190,136,145,113,61,238,106,177,189,78,119,177,188,253,197,252,60,4,82,119,190,175,65,29,190,57,233,32,191,248,112,131,61,57,106,70,61,136,133,69,57,51,92,244,189,11,231,46,62,212,85,91,61,196,74,14,62,97,123,48,188,37,66,82,188,181,96,61,189,134,229,221,61,30,253,39,190,58,243,145,61,170,220,24,190,91,136,25,189,221,45,30,62,11,3,231,62,16,123,135,61,246,148,27,190,52,163,1,63,200,229,194,61,100,208,136,61,212,241,54,61,141,28,136,190,167,174,89,190,21,123,148,62,147,166,163,61,120,203,182,189,47,207,117,61,151,136,90,187,155,158,107,62,238,153,251,188,154,5,52,62,231,1,22,188,167,45,219,61,223,131,117,189,35,190,12,190,41,215,188,190,37,209,131,61,157,40,71,190,79,121,234,61,251,252,169,190,23,201,72,190,26,49,70,189,243,167,102,190,137,56,152,190,206,150,97,188,34,218,146,190,117,162,145,190,102,48,142,61,118,216,93,190,24,187,39,188,163,130,161,61,12,169,86,62,47,123,22,62,48,113,26,189,53,59,39,61,20,25,224,60,190,242,149,190,217,206,86,60,126,89,105,190,195,22,241,61,105,39,95,189,51,55,211,188,212,171,147,61,34,135,210,61,147,52,162,190,143,112,25,61,13,225,133,62,143,57,71,62,173,47,173,61,213,43,209,190,250,106,243,61,151,78,90,60,182,186,144,189,199,132,173,62,46,140,129,61,150,252,131,188,153,122,46,191,156,169,170,190,187,59,44,190,5,31,230,189,148,142,0,61,116,19,83,61,74,30,26,62,77,104,93,57,156,78,123,189,84,114,233,189,251,44,138,62,40,86,66,61,206,237,21,190,222,255,182,187,131,56,1,62,5,43,136,189,106,146,247,190,251,117,165,61,158,109,156,189,141,127,34,190,98,181,227,191,97,197,182,62,85,107,72,62,121,184,0,63,97,225,203,189,228,128,209,189,176,172,236,61,250,114,142,60,234,8,220,62,98,57,78,61,230,87,133,191,2,151,20,62,252,70,49,63,20,188,138,63,143,194,143,191,60,95,17,63,135,25,147,62,86,251,162,188,25,0,30,62,194,146,36,190,156,113,132,189,93,212,106,189,250,182,158,191,22,102,2,190,142,4,224,62,29,82,81,189,157,245,86,190,97,126,85,190,123,219,147,190,92,147,200,61,216,31,142,189,175,168,14,63,162,23,207,191,175,254,12,62,106,118,35,189,46,15,107,190,194,55,145,189,10,107,196,190,54,56,208,190,75,46,74,191,180,223,78,189,100,1,189,191,99,74,23,61,160,82,197,62,26,209,131,190,159,202,146,191,125,67,96,61,118,149,167,190,46,255,124,62,186,229,231,190,29,87,178,189,67,41,132,190,252,165,199,189,9,230,106,61,151,97,20,191,104,27,191,190,210,173,203,61,7,122,204,62,253,95,6,191,148,254,222,61,199,22,70,62,32,143,87,191,214,156,100,62,137,15,166,62,68,253,132,190,216,216,248,62,38,252,240,189,214,128,60,190,124,106,20,62,228,230,9,60,120,147,225,62,123,141,163,189,239,14,201,189,115,166,116,190,175,183,96,188,72,1,107,62,200,112,115,61,85,167,46,61,3,250,110,189,85,237,19,191,107,159,10,188,246,156,72,191,43,202,44,63,96,118,38,190,252,88,146,191,68,138,124,62,187,28,27,189,55,50,1,189,189,58,245,61,144,23,13,61,221,90,103,62,48,211,212,190,113,254,137,62,26,51,147,59,244,185,31,190,25,42,0,191,166,160,248,62,40,243,12,63,197,165,156,189,165,24,213,60,172,160,15,61,116,52,159,59,6,52,210,62,146,61,230,189,196,158,159,189,37,170,252,189,75,8,155,62,12,248,4,190,65,248,61,191,51,149,208,190,252,120,23,191,136,9,152,62,113,176,160,189,49,219,190,62,129,32,43,190,33,4,243,189,146,229,152,62,133,212,52,61,135,75,160,188,250,148,56,190,52,83,168,190,160,17,44,191,183,197,19,188,144,47,59,62,42,110,214,61,45,129,20,190,114,52,44,62,84,161,64,62,199,116,19,62,2,99,52,63,100,130,220,62,95,137,94,62,58,247,154,61,134,199,109,62,206,243,59,62,242,243,199,189,244,252,193,190,59,6,7,63,177,87,144,62,140,113,89,62,35,198,212,56,213,146,214,62,52,226,219,61,242,135,14,191,5,174,205,188,188,31,42,190,70,99,214,191,172,7,41,191,56,60,147,188,170,201,15,191,216,22,142,61,97,57,168,190,81,30,93,189,245,34,5,62,195,248,38,190,103,252,71,61,108,161,13,190,209,182,117,62,152,222,194,189,66,237,99,190,44,229,85,190,206,115,181,189,156,18,104,62,182,242,241,61,88,89,102,189,219,92,86,191,78,168,132,190,246,162,153,189,234,72,249,189,53,74,137,191,189,73,165,188,253,198,24,190,149,203,60,62,255,15,24,188,39,37,181,190,87,6,199,61,166,63,235,189,66,80,185,190,219,136,182,62,174,222,8,191,62,96,108,190,130,240,178,62,94,26,144,60,192,59,194,62,179,105,142,190,47,157,231,62,118,101,178,191,78,23,192,189,41,98,95,61,247,60,154,191,124,88,191,189,85,215,60,62,110,246,66,62,129,2,223,190,36,160,189,62,87,162,0,189,248,171,130,62,123,195,208,61,97,98,95,188,137,246,16,190,154,178,21,61,240,172,172,61,11,37,191,62,207,196,49,190,115,250,193,190,209,33,221,190,72,196,11,60,98,180,208,190,93,139,197,188,13,106,244,190,38,70,30,62,125,192,248,61,186,210,11,190,186,34,90,61,40,160,9,62,96,57,87,61,46,174,190,61,139,95,219,189,134,225,216,190,188,166,233,61,139,129,220,61,7,142,181,190,185,174,103,62,236,180,201,189,61,31,246,190,14,106,108,190,230,240,197,62,131,48,193,191,101,204,129,63,67,174,116,189,54,8,162,61,202,193,136,62,249,57,108,191,193,64,38,62,34,13,252,188,52,12,17,190,184,149,194,190,253,230,165,61,190,205,13,190,60,110,253,190,10,80,200,189,248,232,244,189,78,58,143,191,240,184,114,190,45,117,82,63,56,11,1,62,207,161,27,189,161,72,170,61,165,70,103,189,39,33,87,191,34,128,168,61,206,109,195,60,238,8,27,191,92,193,136,189,214,47,189,190,201,219,190,190,247,215,8,62,194,131,164,61,233,59,123,62,44,213,154,188,69,130,198,189,6,113,178,61,44,16,24,190,116,40,186,189,248,131,148,190,145,32,238,190,52,236,18,191,54,51,57,61,152,139,2,190,180,180,44,63,165,193,126,191,52,61,3,191,249,220,4,191,112,105,78,190,127,189,105,63,220,242,65,62,30,252,14,63,149,234,128,62,33,206,106,190,184,155,160,62,138,243,125,190,50,96,133,189,14,246,163,62,86,216,213,189,178,70,134,62,229,38,126,190,223,130,49,190,113,133,115,62,78,190,212,189,120,14,253,61,110,113,236,60,59,154,46,190,39,102,68,189,171,121,122,190,230,49,0,63,102,72,223,62,156,175,93,189,229,48,63,189,6,21,40,190,60,29,237,191,229,252,8,191,69,172,231,190,90,153,14,189,65,180,222,190,159,177,230,189,135,198,224,62,14,14,117,63,192,90,176,62,177,204,140,189,126,142,128,189,213,5,85,189,191,149,21,190,221,19,8,62,42,213,140,60,67,171,130,190,208,125,42,190,118,66,129,189,54,205,131,62,227,50,174,62,142,67,73,60,158,61,13,61,180,140,148,62,151,121,209,189,208,14,6,62,252,49,248,190,1,91,212,187,7,64,14,62,85,122,121,189,165,184,197,190,161,10,252,189,190,255,4,63,231,75,79,62,227,66,30,63,140,0,86,191,104,20,49,190,140,178,48,191,167,177,6,63,210,238,238,189,252,28,216,62,198,170,215,62,179,62,181,189,192,26,23,62,228,218,214,61,169,211,189,190,4,15,6,191,46,191,241,191,2,150,63,62,68,155,29,190,173,57,132,191,164,20,77,189,28,160,148,190,128,36,82,58,79,29,97,60,190,206,202,61,24,200,132,190,128,89,87,61,84,164,109,62,120,98,41,191,111,164,181,62,129,75,47,191,147,141,197,191,209,54,33,190,66,23,173,62,129,175,49,188,142,238,132,191,150,231,142,61,24,246,183,190,103,110,201,62,214,142,39,191,108,75,65,191,74,12,31,190,180,56,28,62,125,105,199,61,21,98,49,61,206,57,253,189,182,140,9,62,24,67,197,61,122,58,66,62,218,21,63,62,187,152,159,61,87,197,189,190,223,155,131,190,115,66,98,60,143,240,190,190,9,14,56,60,226,117,136,188,46,10,53,60,95,84,59,62,21,146,11,191,74,83,129,62,145,31,166,189,63,213,28,62,134,184,219,190,76,25,151,190,92,19,20,63,14,148,58,190,156,201,162,62,140,14,39,191,52,87,41,63,190,150,231,190,29,184,114,188,244,206,103,190,46,129,235,190,52,157,209,190,8,169,35,62,98,237,134,189,151,223,72,189,121,215,29,62,65,11,217,62,196,72,107,190,220,186,139,190,94,208,230,190,93,45,255,189,150,148,144,189,133,78,30,190,200,202,76,191,47,71,165,60,215,235,3,190,175,101,154,190,57,201,131,61,127,121,80,190,40,174,84,63,221,108,107,60,56,145,173,56,39,231,4,191,217,237,158,190,225,102,37,62,48,144,145,190,15,82,178,62,16,104,140,62,110,90,131,190,183,231,129,62,74,190,61,62,203,119,48,190,148,183,29,62,155,56,91,191,250,27,147,190,37,148,6,191,127,1,17,190,191,254,108,62,68,21,139,191,49,42,54,188,119,162,222,60,0,148,2,190,182,246,188,190,183,108,217,60,207,178,206,61,94,18,61,61,33,163,167,190,209,34,210,190,68,248,10,63,84,118,171,62,142,73,192,189,183,17,106,62,171,31,2,58,60,73,128,190,206,180,118,191,95,170,161,188,229,20,73,62,221,194,172,62,151,65,236,61,89,6,10,191,244,26,147,62,38,40,46,62,181,64,92,61,251,198,130,191,139,171,238,61,40,191,70,61,188,64,121,190,146,191,177,60,12,225,169,62,126,64,106,187,212,91,127,189,123,225,177,62,149,142,226,188,153,94,0,191,18,197,29,60,189,52,40,62,226,96,108,190,25,160,108,62,27,181,155,62,144,219,39,191,106,3,34,189,142,218,181,61,107,116,107,190,66,105,152,190,100,204,49,62,27,99,116,191,161,167,199,62,183,76,59,191,151,71,151,189,44,64,62,189,39,50,85,190,51,89,95,190,81,81,154,62,172,230,136,186,250,5,147,62,50,150,12,62,195,48,121,62,225,200,85,62,125,206,113,190,192,56,118,62,14,246,125,62,214,7,24,62,20,202,253,62,39,136,146,190,226,153,130,190,80,37,229,61,8,175,241,60,209,131,240,189,183,70,102,190,183,76,147,190,213,129,128,190,163,28,117,62,133,134,95,190,169,244,159,190,216,219,54,190,158,49,96,61,88,24,183,188,191,16,139,62,12,76,89,61,119,144,144,62,142,169,197,61,111,82,188,59,196,8,137,61,30,149,236,190,195,20,192,60,156,214,12,63,144,110,170,62,10,182,23,62,19,73,12,63,171,237,229,190,241,203,19,63,2,206,228,189,174,53,194,190,60,144,115,62,121,235,99,190,136,3,66,190,73,82,170,62,205,94,201,189,200,215,37,191,167,250,145,188,248,2,154,188,69,140,220,61,232,167,27,60,164,234,108,62,59,54,178,190,188,110,133,62,176,86,103,189,104,82,31,191,92,236,146,62,103,219,236,62,238,117,97,189,185,240,10,190,40,246,220,62,150,161,152,62,22,81,238,62,151,171,121,62,221,37,117,62,222,78,118,190,2,198,120,62,66,215,41,62,175,8,28,191,241,8,102,191,213,6,120,189,192,27,114,62,120,10,171,190,86,157,15,190,162,38,240,61,19,53,249,189,161,171,92,62,59,193,169,62,39,47,214,60,5,124,232,188,213,197,202,189,10,214,126,61,19,35,95,61,71,27,132,189,192,77,200,61,176,72,33,191,90,130,144,191,50,46,99,61,159,167,248,189,106,208,220,189,153,80,167,62,147,171,200,190,99,33,210,60,193,188,7,189,146,156,156,190,144,174,41,191,225,199,160,190,38,193,6,62,108,156,145,191,96,34,0,191,188,128,174,189,244,253,112,190,37,61,236,61,200,62,54,62,54,108,32,62,111,81,87,190,175,4,95,191,231,147,111,62,55,107,5,62,245,1,11,63,232,173,57,191,236,75,37,62,25,76,210,61,120,113,234,190,238,24,197,62,75,32,152,62,220,202,183,62,168,254,148,187,64,118,193,62,149,136,162,62,85,129,148,190,217,248,45,189,73,101,124,62,145,143,101,188,14,27,195,62,79,145,56,190,117,159,38,190,130,223,153,191,44,42,183,190,211,253,62,190,176,242,18,62,189,248,154,62,135,158,166,189,55,0,71,62,249,112,235,190,252,5,174,62,236,144,161,190,218,210,191,190,121,146,68,191,41,108,46,62,19,164,74,62,117,46,197,190,143,3,0,191,31,163,47,190,170,220,199,62,98,218,176,190,230,232,45,61,33,137,38,62,29,238,28,63,14,136,158,61,147,129,87,62,185,150,138,189,84,181,200,191,41,82,171,61,21,95,107,190,106,50,211,61,109,160,248,62,54,253,230,61,5,59,166,189,2,55,26,189,129,63,33,191,179,235,11,61,0,243,19,191,170,32,47,190,26,120,120,190,109,101,64,63,198,8,0,63,148,162,5,189,109,216,74,62,145,43,9,62,70,246,172,191,171,178,1,190,13,188,112,61,97,6,71,63,244,206,40,62,64,112,154,62,151,229,160,190,14,116,110,62,0,110,38,190,49,18,154,189,118,246,195,189,219,116,100,62,158,120,250,190,137,4,28,191,102,160,196,191,113,203,120,62,85,158,137,62,88,231,80,190,144,174,18,62,142,195,177,186,210,11,111,184,37,53,57,190,216,84,205,61,6,206,43,61,32,15,250,61,246,94,198,188,133,9,165,62,86,172,19,63,116,99,20,62,114,122,204,189,63,116,43,63,52,81,253,61,3,203,92,191,57,108,118,61,233,65,146,190,86,153,238,61,173,96,92,191,105,47,29,190,61,226,240,61,218,141,22,61,136,246,34,190,158,76,187,62,254,234,1,62,1,34,3,63,117,140,126,62,183,224,18,62,254,125,22,191,64,4,11,63,228,229,137,190,119,224,198,189,94,143,175,189,114,230,102,188,61,214,63,189,216,40,180,61,229,17,247,189,218,8,23,63,35,0,150,62,120,128,90,62,222,114,12,62,95,42,152,60,107,249,147,60,165,193,182,61,127,114,10,191,51,172,250,189,0,182,239,62,29,141,237,189,103,1,29,63,211,164,89,190,86,87,213,189,175,38,101,190,222,27,198,62,195,133,157,62,166,171,22,63,32,1,237,190,62,221,180,190,42,55,115,191,76,188,80,61,249,159,203,189,60,79,198,190,134,1,90,190,48,86,10,190,132,197,206,61,52,134,19,62,60,136,123,191,94,54,49,190,30,142,128,63,29,152,225,62,165,132,47,62,243,228,221,61,57,151,130,191,249,158,167,188,72,83,99,61,30,52,116,190,184,135,36,190,136,181,57,62,41,37,38,61,41,55,194,190,14,141,146,62,80,249,67,190,82,20,4,62,73,15,220,62,139,11,181,189,34,251,14,191,32,240,233,189,103,171,176,62,84,116,9,191,125,137,194,62,149,111,146,191,201,179,140,62,180,86,142,189,90,154,71,191,65,106,175,62,168,102,159,190,122,212,192,190,93,19,35,62,94,172,23,191,192,118,225,189,15,232,237,62,139,49,98,62,190,119,194,190,143,151,152,61,161,10,62,191,84,144,176,61,173,45,92,62,244,70,167,189,206,127,52,62,100,193,170,62,159,91,8,63,230,174,100,62,141,128,178,62,44,63,9,63,18,246,70,189,40,197,17,190,166,121,255,62,40,231,24,189,168,216,206,191,25,246,131,190,20,76,24,62,226,80,201,61,158,235,92,63,228,21,4,191,119,19,76,191,225,88,56,190,246,109,107,62,120,179,236,190,67,235,162,191,14,188,157,191,114,202,11,191,141,85,158,62,121,13,224,62,219,13,214,62,184,70,135,191,198,197,129,186,187,115,98,191,137,220,60,61,128,47,145,191,36,39,215,62,110,77,160,191,194,17,254,61,217,208,37,62,207,121,90,188,93,81,177,62,198,130,243,190,35,11,134,191,73,120,75,63,75,220,123,62,72,94,184,61,204,33,128,191,84,183,254,191,14,174,255,190,33,14,224,62,170,239,51,62,185,88,151,188,165,232,158,61,159,95,162,191,107,14,4,63,175,97,235,62,199,178,232,190,59,23,205,61,187,126,245,62,106,242,66,190,104,168,228,190,8,28,107,62,249,207,158,189,107,129,200,62,105,122,231,190,153,18,178,191,45,129,163,191,162,33,187,191,16,21,165,61,181,85,102,191,224,57,124,62,211,16,6,61,44,161,230,62,7,76,29,62,25,145,131,190,43,163,76,62,226,112,222,62,91,94,221,61,114,232,198,62,20,121,160,62,32,80,65,61,100,3,227,62,248,188,241,62,103,253,45,191,45,123,19,63,235,19,92,63,196,247,15,62,204,59,49,191,80,192,62,62,140,150,202,190,17,236,86,61,177,134,141,62,159,130,236,191,117,162,5,61,91,189,39,63,130,182,192,62,195,164,116,190,211,1,166,61,203,233,45,191,165,250,33,188,161,92,112,63,17,17,200,190,204,245,133,61,221,118,164,190,58,19,149,62,38,93,166,191,245,128,204,191,153,233,152,191,97,72,13,62,66,245,108,62,168,167,97,61,186,182,204,62,10,239,203,60,36,235,159,62,86,162,113,62,228,168,189,191,218,43,22,63,196,183,26,63,184,44,50,191,183,169,144,191,93,32,182,62,61,122,20,190,143,202,169,62,44,233,51,63,233,36,51,191,241,13,249,191,101,145,2,62,92,182,151,191,173,46,29,60,230,197,124,62,244,161,129,62,85,21,29,63,77,36,14,190,130,160,128,62,170,174,204,191,103,80,76,191,109,25,168,191,216,168,10,191,107,154,9,63,243,164,12,63,26,199,240,62,44,153,212,62,125,78,81,63,8,11,4,63,1,56,202,61,208,62,207,191,0,27,41,189,156,215,63,191,209,52,192,190,15,57,133,191,102,81,186,190,6,116,196,191,77,114,66,191,57,208,192,62,109,203,58,191,238,41,81,63,66,35,254,62,0,205,32,62,140,197,66,62,73,242,221,191,205,139,199,188,246,185,50,190,51,27,5,191,161,20,190,62,120,49,189,62,104,68,24,63,176,63,90,190,151,137,40,63,159,23,57,191,201,144,139,190,14,93,148,190,118,228,107,190,39,217,96,63,138,161,141,188,200,108,252,60,64,159,82,62,186,9,139,62,119,31,84,62,59,53,62,62,216,92,81,189,0,98,186,62,60,95,75,189,148,59,27,63,135,162,77,191,215,251,7,63,8,54,164,189,214,69,145,189,16,181,162,191,107,120,97,188,66,45,2,189,190,248,122,191,104,67,29,190,174,152,117,191,157,8,165,191,26,221,156,62,1,215,71,62,1,183,159,62,176,188,162,190,72,157,242,62,70,76,209,62,60,215,83,61,106,28,88,191,166,146,27,190,240,33,166,191,82,144,140,190,121,140,48,63,37,188,182,191,204,211,99,191,135,162,41,189,46,101,168,190,119,79,148,190,223,246,5,191,164,175,58,63,206,62,174,62,231,54,39,62,31,15,67,62,193,248,127,191,15,149,200,62,172,84,98,62,18,156,0,62,254,234,131,189,208,1,138,191,173,37,173,191,221,240,196,62,114,167,203,62,154,148,27,190,21,247,206,62,165,211,147,62,169,38,167,62,255,223,30,63,227,103,135,191,217,3,95,191,223,161,85,189,59,61,50,191,30,183,171,61,194,204,253,62,71,195,112,62,78,77,105,62,182,162,230,62,195,89,141,191,171,45,129,191,204,161,201,62,22,13,247,62,231,116,78,62,6,246,183,62,12,165,219,62,173,224,191,190,7,195,115,191,190,64,153,190,18,192,130,190,106,172,187,61,100,128,84,189,20,152,241,190,172,104,165,191,133,245,83,62,116,10,230,61,12,137,5,63,253,156,13,63,93,105,14,63,212,17,167,190,71,29,106,62,167,61,193,191,7,15,254,190,4,128,106,62,241,146,85,190,38,12,194,190,251,65,141,62,109,194,255,62,144,40,226,61,195,23,26,60,183,242,126,62,97,138,101,62,246,120,254,59,170,211,27,63,131,195,194,191,244,143,217,62,150,21,59,62,219,129,16,191,200,99,47,191,125,117,69,191,36,74,97,63,47,4,171,191,197,90,9,191,127,192,187,191,197,111,10,61,28,156,101,62,136,129,33,63,165,58,74,62,48,236,64,61,144,144,40,62,96,186,111,190,79,110,201,62,136,91,208,190,107,122,29,62,245,242,185,191,36,124,36,62,80,10,57,190,138,217,23,63,97,143,107,190,84,250,41,189,190,154,214,190,139,149,90,191,43,74,21,63,194,53,174,62,69,170,1,63,114,113,40,191,145,116,224,189,22,147,215,190,223,250,24,61,92,12,208,62,203,178,0,191,125,44,167,191,18,193,93,190,147,127,185,190,190,61,216,189,190,131,199,62,96,107,93,62,227,126,96,62,106,129,134,191,148,152,216,191,140,7,153,188,37,93,149,190,23,143,165,61,223,14,156,62,106,2,9,63,111,200,49,63,212,102,239,61,23,15,243,60,38,167,70,190,76,254,138,62,189,177,196,62,53,146,0,60,10,159,41,62,28,92,45,190,75,238,193,189,147,5,82,62,215,69,54,62,59,79,109,190,215,105,11,61,149,156,139,62,47,227,131,189,170,184,241,61,254,71,196,191,49,61,102,63,176,83,148,191,7,156,13,62,162,223,199,189,204,211,9,191,231,89,22,190,177,63,238,189,165,239,16,191,77,184,214,62,85,102,200,189,168,202,92,61,205,236,242,62,248,19,133,191,61,217,140,191,103,187,188,62,200,31,106,62,229,32,166,62,208,176,190,191,8,74,247,62,185,241,192,62,188,109,225,62,147,183,179,189,126,188,206,62,162,21,206,191,101,139,221,189,169,50,143,62,83,201,218,60,40,156,57,62,162,216,59,62,177,150,30,191,146,13,234,62,179,118,176,188,116,0,60,63,107,158,4,191,95,137,172,191,16,221,50,191,136,181,205,191,167,23,129,191,3,250,175,191,107,193,104,189,211,0,32,62,179,192,219,60,4,22,157,62,84,34,88,190,227,71,2,63,84,117,203,188,145,244,94,190,201,251,5,63,92,195,129,62,139,150,141,189,177,240,8,63,14,243,139,62,253,99,165,191,133,26,118,190,6,66,80,190,162,35,143,62,207,255,210,190,123,135,145,61,100,10,9,62,1,9,139,62,55,239,238,61,123,42,219,62,164,82,211,62,243,173,211,62,217,138,200,191,57,100,139,190,88,180,157,62,156,187,239,61,245,196,66,63,137,244,116,62,4,197,86,191,250,151,203,191,47,168,31,63,151,82,38,62,221,161,43,190,221,210,206,191,0,156,150,62,179,183,71,188,155,217,14,191,130,23,20,63,129,104,104,190,200,17,229,62,220,153,31,61,252,16,0,63,208,190,152,190,189,31,162,191,244,114,35,191,49,1,175,62,237,91,107,60,245,123,217,190,108,150,83,62,217,65,215,189,232,63,222,190,15,48,78,191,153,210,50,63,186,116,136,62,195,41,9,188,64,230,34,190,104,195,157,189,255,16,82,191,191,21,167,61,240,181,65,191,150,96,219,189,234,169,62,190,159,83,255,62,176,186,140,191,232,187,249,62,220,70,34,191,25,249,194,190,192,180,117,190,197,197,251,190,125,209,164,62,207,237,49,191,200,243,4,58,79,188,24,63,145,38,158,189,176,178,121,191,234,107,173,190,96,72,43,191,127,44,193,62,18,235,232,62,194,245,187,189,65,172,170,191,109,113,79,62,186,143,3,191,41,35,158,191,146,209,86,191,6,14,2,61,239,212,14,62,53,186,78,63,205,119,84,62,66,231,36,62,208,192,211,189,209,12,81,62,198,134,90,191,128,230,166,190,93,103,160,62,78,114,90,63,195,201,61,63,151,196,37,191,239,211,179,190,162,185,196,191,111,67,154,191,210,60,235,62,13,16,5,63,130,143,109,62,57,208,18,188,169,206,242,62,247,154,61,191,194,26,151,62,25,82,9,62,188,31,39,190,191,12,174,62,73,206,140,62,134,116,136,191,73,122,181,191,155,135,96,62,215,183,201,189,41,53,142,62,98,169,7,63,152,143,112,63,173,94,53,61,117,93,79,191,24,151,173,62,65,206,74,62,178,135,207,191,168,12,154,191,163,51,59,62,35,229,59,191,8,81,145,62,62,39,47,62,173,156,232,191,165,76,80,190,118,139,12,191,28,80,90,63,238,109,119,190,139,229,148,191,188,212,30,62,88,179,9,62,59,122,150,61,103,132,31,62,214,126,71,62,30,233,35,189,19,93,145,62,73,100,254,59,186,27,225,62,111,54,126,191,94,136,108,62,191,56,140,61,116,16,6,189,9,39,55,63,177,208,217,190,77,217,146,62,104,184,133,191,137,12,240,62,227,167,26,63,45,124,124,191,18,110,209,189,46,157,69,62,139,145,150,190,142,16,29,191,33,251,240,61,62,108,141,191,5,50,138,62,72,208,93,62,18,3,154,62,3,42,193,190,10,53,185,62,1,39,3,191,154,229,227,62,233,192,173,190,146,255,78,63,90,250,60,62,234,111,0,191,210,58,14,190,91,39,155,191,220,36,187,191,39,154,208,191,37,191,180,62,9,252,5,191,156,171,194,60,10,185,17,190,89,63,149,62,206,118,48,191,105,57,192,191,33,57,62,62,218,12,163,62,63,101,18,191,143,82,211,62,5,244,212,190,122,119,139,62,182,27,234,62,80,35,105,190,124,203,168,61,60,92,213,62,138,128,143,62,203,183,99,191,155,68,60,62,157,111,115,62,198,177,187,62,196,236,124,62,47,204,55,191,29,0,154,62,225,42,114,191,48,30,23,191,85,117,167,62,218,155,24,63,148,223,227,190,106,119,234,61,43,44,134,61,179,77,136,62,14,147,154,62,46,39,106,191,143,145,188,190,83,175,7,191,20,132,55,190,72,182,150,191,229,143,6,63,250,13,157,62,185,106,130,61,217,246,191,62,82,13,0,62,211,34,4,62,31,132,206,191,229,196,33,189,214,163,94,62,50,24,151,189,208,31,156,191,36,105,9,63,167,85,202,191,136,80,11,63,84,152,165,62,116,111,199,61,3,181,233,62,40,86,139,191,89,217,249,62,9,47,72,63,161,19,146,189,40,248,117,190,212,97,176,62,11,144,5,63,148,127,188,191,215,92,184,191,71,188,85,58,9,41,235,62,178,115,130,62,194,111,153,191,214,249,89,62,215,222,180,191,227,164,65,63,179,180,133,62,253,148,28,190,105,180,225,191,206,240,76,191,251,134,127,62,162,246,6,63,51,32,9,191,244,87,214,62,135,47,141,190,208,243,76,191,225,134,113,191,98,227,183,190,196,90,132,61,185,126,130,191,77,212,241,62,87,27,99,191,88,3,150,62,115,249,152,191,209,70,43,63,76,252,92,191,125,196,254,60,165,1,166,191,160,31,56,62,128,108,240,60,156,2,175,191,220,31,2,191,135,168,6,191,131,136,255,190,244,205,212,62,131,191,205,190,19,181,56,61,23,196,189,62,36,86,194,61,128,107,149,191,22,73,183,191,96,15,135,190,111,134,230,62,51,150,2,63,130,171,3,191,241,235,8,62,76,3,6,63,149,239,199,62,50,175,221,190,21,255,184,190,36,150,53,190,253,115,172,189,211,46,85,191,197,215,243,190,231,222,219,62,138,13,176,62,196,97,12,63,184,187,25,63,114,43,32,62,97,173,191,61,101,182,27,190,40,132,202,190,25,213,141,62,27,45,32,62,189,145,234,62,203,128,217,62,41,4,122,191,218,228,175,191,233,67,216,62,14,89,9,61,132,120,236,62,207,47,157,191,95,144,133,62,254,45,255,62,198,47,48,61,123,231,247,62,89,108,2,189,207,131,255,62,195,17,72,191,168,240,77,62,168,252,210,189,77,234,97,190,1,123,154,191,101,161,242,190,238,123,21,189,152,10,114,189,103,155,51,190,73,107,20,61,198,254,229,62,196,234,241,62,237,156,138,191,249,166,29,190,79,84,165,190,236,142,79,191,178,243,27,191,72,50,26,62,69,26,63,191,133,152,247,62,241,120,160,62,139,247,48,190,51,238,186,190,17,189,140,62,215,95,2,62,2,192,185,62,95,206,38,190,10,15,17,190,180,75,24,63,71,70,169,191,214,84,191,61,139,169,99,191,192,237,179,191,96,17,207,190,59,74,157,191,126,250,204,62,187,253,191,62,69,117,132,191,71,33,161,62,18,109,139,191,41,15,83,62,147,19,235,59,237,78,32,191,151,220,23,62,190,45,151,190,214,72,149,61,128,240,59,62,204,29,246,62,241,197,220,62,249,142,186,62,20,223,168,62,106,181,219,61,187,136,150,59,119,72,192,190,183,111,32,190,2,132,51,62,184,116,9,63,99,59,58,61,41,30,66,190,136,80,209,190,140,41,188,62,13,98,148,60,85,243,206,62,113,246,148,190,199,207,140,190,237,79,216,191,109,210,218,61,71,27,98,62,61,38,197,191,173,25,194,191,233,71,97,189,215,186,61,61,66,237,198,190,69,161,235,62,188,154,108,190,100,176,94,190,98,72,171,189,151,199,61,62,29,176,10,191,11,235,207,62,209,68,158,189,55,83,181,190,134,115,153,62,125,51,27,62,121,185,133,190,232,158,175,62,229,151,2,63,154,1,100,60,156,68,51,62,99,100,198,61,195,81,28,63,205,99,133,191,15,49,75,189,115,20,98,62,208,63,214,62,77,88,205,62,68,16,12,191,39,0,36,62,103,63,162,190,242,197,18,63,88,48,3,191,68,144,237,62,130,131,216,189,59,137,211,191,49,46,34,191,21,127,125,191,16,165,1,61,198,51,221,62,117,15,147,62,24,186,11,63,137,125,52,63,15,189,253,62,47,84,59,191,102,144,251,62,43,100,10,190,176,36,192,189,56,84,140,191,245,82,140,62,5,212,30,63,69,166,252,62,72,213,77,62,22,233,10,191,228,55,17,191,63,193,250,62,173,97,218,60,25,43,0,62,81,91,57,62,150,226,46,62,187,105,250,190,49,146,3,189,198,205,43,63,80,35,241,62,71,135,201,191,115,155,139,189,248,161,238,190,61,59,209,190,120,140,133,62,254,92,166,62,171,86,212,190,246,100,209,61,107,255,19,190,206,251,83,190,127,78,147,189,90,33,160,191,248,71,88,191,23,38,171,62,24,206,235,61,171,22,11,191,114,40,44,191,68,235,16,63,130,243,120,191,182,96,140,191,57,91,10,191,8,133,66,61,155,14,78,61,155,60,57,63,134,32,247,190,64,173,119,191,140,92,182,191,8,113,37,61,144,216,59,188,229,128,240,62,190,67,62,191,181,13,18,191,74,58,16,191,81,130,46,191,130,75,248,191,207,60,243,191,205,92,75,62,232,10,145,190,184,234,140,191,53,160,7,63,192,135,149,191,179,253,206,191,99,213,241,190,174,232,49,62,248,139,141,62,48,220,88,62,91,28,165,191,115,139,92,191,154,201,177,190,224,191,34,190,94,243,42,63,179,61,190,191,53,31,151,62,167,136,55,62,19,28,173,62,73,216,18,63,23,175,186,62,103,207,129,188,203,85,20,63,26,204,79,61,110,5,60,188,89,141,108,62,4,102,147,191,114,62,50,62,72,155,235,61,34,3,61,62,216,114,127,191,57,73,70,63,219,74,118,190,92,150,34,191,27,82,44,191,246,44,136,62,61,16,49,62,195,109,4,191,34,252,155,62,158,116,113,189,149,130,40,63,25,102,181,62,181,30,25,63,3,224,5,190,134,113,135,190,215,204,46,62,70,29,237,62,229,196,37,188,96,127,22,62,248,122,65,63,46,84,196,191,138,159,67,189,137,131,244,190,14,48,178,62,81,210,195,62,49,197,29,62,38,131,180,61,97,34,36,62,251,227,155,60,71,37,154,191,39,204,22,190,83,194,131,191,212,207,80,190,156,130,184,191,130,104,224,190,49,184,94,62,211,75,60,191,14,107,75,191,56,158,68,62,243,136,82,62,73,175,200,62,57,198,230,62,149,126,222,61,20,199,103,191,170,66,182,61,213,193,134,191,71,75,207,188,45,159,102,191,138,182,8,190,241,87,22,62,186,95,225,189,140,75,20,63,182,106,94,191,154,24,188,62,220,108,185,62,21,223,92,190,156,230,141,191,192,204,231,62,187,194,49,63,228,30,156,62,112,69,150,190,50,35,49,190,97,31,94,63,86,135,236,189,230,168,164,188,36,127,17,62,237,84,158,61,180,137,41,189,180,6,17,62,246,59,231,62,199,22,194,62,214,136,249,189,230,189,174,62,102,19,235,62,229,217,49,63,51,163,175,62,252,24,0,63,194,167,151,191,164,190,157,62,165,199,231,60,24,41,106,62,184,122,86,191,144,239,77,61,57,33,159,191,102,21,214,190,47,158,41,191,9,53,168,62,149,195,38,63,10,0,40,60,231,74,163,191,151,158,38,190,58,103,146,62,5,188,40,63,216,126,140,62,241,47,173,191,194,91,158,62,139,28,172,191,72,57,206,60,109,1,2,191,149,117,4,63,173,167,137,62,75,56,63,62,166,97,240,188,120,100,44,191,142,58,75,190,125,53,148,191,192,230,87,188,89,250,158,190,83,81,132,61,191,105,236,190,15,43,6,190,70,37,16,191,244,219,107,62,184,91,150,62,178,84,225,61,172,139,151,189,142,159,19,62,44,52,188,62,204,14,133,62,35,120,165,62,183,79,43,191,237,123,167,189,140,211,184,190,37,105,206,190,106,192,24,63,18,213,182,191,7,194,11,189,11,162,192,190,93,237,3,63,198,84,186,61,105,176,188,190,119,181,213,62,186,234,174,62,180,144,234,190,211,237,51,189,207,19,182,191,205,102,3,191,192,28,126,61,58,97,138,190,124,177,158,62,236,75,46,190,196,196,17,190,193,205,38,191,240,19,209,190,200,137,146,190,253,196,160,189,170,80,177,190,55,250,107,62,194,102,221,190,245,225,206,190,135,246,94,60,8,57,33,189,153,180,131,62,52,84,7,63,5,237,22,62,26,190,30,191,125,120,20,61,255,78,102,62,120,219,152,190,63,6,81,62,99,161,145,191,5,146,234,190,23,37,68,62,184,46,244,190,219,124,15,62,161,214,6,63,104,12,119,190,16,104,29,190,249,87,48,62,136,41,186,188,18,140,139,62,116,96,54,189,251,206,118,62,233,0,224,188,191,227,13,61,192,157,216,61,124,54,168,189,200,207,196,62,34,142,27,62,89,92,169,62,103,222,166,191,137,119,237,190,137,67,87,62,241,176,153,62,113,224,95,62,153,139,98,62,85,167,186,191,179,240,156,61,10,58,165,58,140,107,185,61,192,247,86,62,161,56,99,191,146,82,13,191,37,4,202,190,237,186,176,61,242,169,46,62,224,34,179,189,247,219,167,62,116,4,87,58,24,111,9,190,71,236,140,62,249,132,46,191,203,37,193,62,171,185,221,60,190,231,218,62,16,142,232,190,57,54,247,190,244,220,144,62,107,5,149,190,230,180,252,61,89,199,202,190,89,255,252,188,88,165,133,191,122,154,4,61,143,19,55,190,10,112,82,190,10,220,11,63,44,62,17,190,249,52,143,188,184,39,137,190,79,182,187,61,165,9,146,190,127,220,120,189,38,246,0,190,234,96,40,62,239,206,170,190,148,9,141,60,122,229,3,190,140,222,41,62,254,24,124,62,138,105,160,191,186,6,42,190,249,76,247,61,158,48,94,62,5,195,168,191,188,28,230,61,171,228,54,61,176,201,136,62,134,191,14,60,127,216,106,62,219,225,182,189,148,2,195,190,199,80,45,191,49,9,196,62,43,93,219,189,3,91,59,188,178,140,183,62,173,25,241,62,6,220,2,190,112,168,86,190,117,46,112,62,204,135,99,191,26,195,229,61,22,31,149,62,26,99,98,62,221,72,105,61,159,62,175,60,221,156,91,61,234,119,7,63,165,113,87,190,128,103,18,190,3,74,245,59,198,139,131,62,253,199,132,189,86,48,251,61,91,254,