{"meta":{"epsilon":0.01166534423828125},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,22],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[202,90,160,190,41,198,207,61,58,218,20,190,76,153,231,190,5,210,200,190,194,74,15,63,130,243,11,61,172,161,18,61,241,107,32,63,215,240,211,62,206,38,177,191,142,241,11,62,205,149,11,62,93,66,63,62,90,0,4,189,233,133,64,62,57,102,196,62,53,101,35,61,72,114,13,63,223,214,84,62,127,71,220,189,168,79,239,189,184,21,79,191,231,131,241,61,9,30,12,191,177,117,130,62,16,126,158,62,42,150,208,62,213,51,21,190,124,84,24,63,98,95,88,191,162,21,72,62,197,188,16,62,141,181,64,190,217,58,134,61,228,183,101,62,154,5,79,62,228,187,30,190,104,237,109,62,207,93,240,190,54,13,140,189,220,44,35,190,144,152,212,60,97,53,192,62,205,234,89,191,17,229,77,59,49,19,160,62,174,193,60,63,67,144,52,62,70,60,123,62,195,200,249,189,209,76,222,62,12,237,127,62,73,78,70,191,51,162,234,189,26,211,100,190,8,229,67,191,198,209,129,191,188,90,19,190,219,32,149,62,119,230,102,63,123,233,199,62,31,60,226,190,231,85,144,188,71,224,8,63,121,46,3,188,182,101,206,62,21,49,182,189,202,97,183,191,143,171,223,190,98,29,153,190,12,103,76,191,115,165,8,191,27,51,192,62,211,113,158,189,137,251,229,190,102,207,190,190,29,164,224,61,247,236,80,190,56,112,245,190,122,103,122,62,41,96,130,190,250,110,12,191,252,210,183,62,177,234,115,190,106,116,108,62,30,209,146,62,43,206,248,62,136,88,38,62,218,60,178,190,190,162,140,62,3,50,31,63,90,217,105,62,171,210,66,61,122,145,25,191,28,65,22,191,46,179,222,190,36,130,134,61,148,252,0,191,159,235,120,191,71,100,157,62,225,195,221,190,35,114,13,63,43,14,31,191,73,121,129,190,169,193,42,190,6,68,147,62,192,45,87,62,125,118,253,190,119,78,143,189,141,55,19,63,41,237,124,190,198,128,88,62,205,229,18,191,208,96,0,63,26,206,106,189,26,199,77,190,219,119,249,62,102,194,97,190,228,96,35,190,213,73,142,61,232,254,185,62,113,9,184,61,150,53,3,191,219,104,197,188,113,105,89,188,119,121,164,62,195,105,34,189,10,123,101,189,151,154,118,190,149,128,41,62,200,87,215,188,31,169,29,63,253,225,6,63,237,2,8,63,203,200,1,189,197,5,37,190,197,40,180,190,118,153,169,189,24,222,112,191,43,221,129,191,135,168,215,60,105,89,160,190,141,237,20,190,142,208,171,61,232,77,29,190,175,170,151,189,46,63,21,191,136,106,4,63,182,181,129,62,112,55,13,190,15,30,206,191,139,232,14,191,251,185,253,60,215,108,122,187,254,239,26,62,92,94,180,190,223,207,19,189,49,163,66,189,140,24,13,190,188,17,185,62,88,172,205,189,50,138,154,62,239,161,162,190,192,245,51,190,117,38,4,62,58,85,183,62,51,227,37,191,160,55,35,191,75,234,40,191,20,223,177,62,111,164,93,189,104,59,115,191,183,71,16,191,69,92,156,190,45,33,132,190,255,184,6,63,39,196,22,62,153,111,8,190,15,69,8,191,49,188,154,189,85,98,144,62,188,67,5,191,146,229,195,190,52,160,138,62,37,204,208,190,139,194,131,62,24,87,87,62,35,190,69,190,126,20,232,62,198,188,119,189,35,224,34,191,195,106,103,60,11,43,126,191,26,233,144,190,1,20,28,62,36,146,202,62,37,204,52,190,109,132,98,191,32,133,238,189,237,141,15,191,220,35,232,62,82,43,147,190,197,123,185,190,195,28,225,62,188,224,66,191,92,197,205,62,156,121,248,190,170,199,16,190,216,178,27,63,32,65,16,63,23,184,228,61,69,154,140,62,11,229,205,190,2,110,226,60,113,100,93,62,105,25,171,190,69,159,24,62,193,161,172,190,243,174,119,191,218,199,35,63,100,92,57,191,188,45,138,62,155,239,0,62,233,2,193,62,57,230,210,190,64,14,91,189,106,182,96,62,138,225,254,190,226,17,21,190,189,232,27,63,109,214,151,61,124,61,72,62,88,150,14,189,196,95,90,191,226,17,233,61,198,148,25,61,228,15,176,190,4,113,192,61,226,216,35,188,158,130,66,63,199,237,8,190,29,175,1,191,71,108,233,190,157,5,96,62,215,218,0,191,133,156,206,61,57,215,175,62,223,249,161,62,228,135,67,190,54,1,106,190,238,1,241,189,88,142,93,190,232,34,179,190,146,231,214,62,154,43,137,191,131,250,76,60,191,32,199,189,208,36,155,62,24,88,95,191,159,134,14,63,2,103,154,61,2,92,236,62,75,23,139,189,161,184,128,189,90,225,220,190,172,24,212,190,67,220,70,63,90,85,177,190,227,153,160,62,30,222,201,190,181,243,177,61,22,182,118,60,76,165,165,62,233,202,254,189,128,165,66,62,188,148,159,62,158,196,60,191,75,200,158,190,196,168,211,61,244,136,236,190,204,127,6,191,5,191,138,62,130,139,47,60,244,242,233,190,209,116,53,191,91,177,87,191,18,39,99,62,67,107,91,62,67,13,136,62,150,113,33,63,52,126,43,63,42,88,10,63,145,241,248,61,89,75,23,191,140,172,192,190,234,23,6,63,64,205,174,190,104,254,19,191,244,227,46,190,189,231,88,190,252,110,29,63,245,216,107,62,156,154,154,62,49,3,86,61,156,228,137,190,73,98,115,61,47,183,198,190,23,136,147,190,63,48,78,190,155,32,81,190,240,131,189,188,151,154,187,190,83,52,136,62,112,216,188,62,49,127,207,189,228,27,73,191,42,184,92,186,241,250,74,191,10,32,215,62,138,209,156,190,126,141,19,189,190,179,3,191,112,91,169,62,51,5,192,189,142,70,18,62,171,63,97,62,199,99,166,190,109,169,193,190,230,213,215,190,205,164,117,191,69,186,167,190,14,216,18,63,82,169,147,58,73,25,135,61,90,226,39,63,77,97,27,190,206,142,49,191,198,51,109,190,139,69,241,190,114,90,62,188,165,222,117,190,82,176,242,62,200,163,49,191,128,250,29,191,57,232,174,190,160,196,64,62,204,13,242,189,227,224,138,62,100,1,105,191,163,158,195,62,9,64,226,62,235,47,67,190,199,112,87,61,114,35,195,59,194,236,93,191,60,41,95,190,255,237,200,190,97,30,125,61,50,84,11,191,101,215,146,190,193,234,101,62,163,77,54,62,32,118,140,190,220,235,49,191,3,21,158,190,95,45,129,190,197,85,146,190,113,233,85,191,2,158,145,62,140,9,189,62,196,156,2,189,141,138,218,61,66,0,167,61,131,125,221,62,50,99,78,190,174,206,53,62,80,132,156,190,208,253,141,61,193,247,8,190,169,236,66,191,138,17,147,191,230,11,2,191,165,85,5,62,136,46,113,188,212,102,139,190,22,220,9,190,243,133,235,190,95,227,28,191,127,213,168,62,171,84,0,191,245,24,32,62,25,86,14,61,89,161,2,191,55,95,32,63,227,138,159,62,147,138,143,189,162,10,239,62,204,243,30,63,44,78,145,61,122,226,103,190,235,98,231,62,201,234,39,191,101,19,232,61,168,21,129,190,125,175,20,190,243,81,63,191,188,96,165,190,148,238,248,61,19,198,87,60,47,100,231,62,192,164,2,191,38,181,31,63,199,218,190,61,183,43,136,62,247,33,175,61,180,44,122,190,255,187,19,190,208,170,71,190,23,139,67,189,21,98,160,190,165,59,53,190,101,194,231,62,68,156,115,61,73,190,152,62,33,103,220,190,234,75,2,191,136,2,26,191,96,209,115,62,228,86,21,190,246,205,76,191,89,203,144,190,151,248,41,191,56,198,224,60,159,169,148,189,22,228,37,190,6,170,141,190,185,252,149,190,145,248,92,191,244,208,54,62,105,43,17,191,31,175,121,190,223,197,187,189,103,123,147,189,143,116,128,191,39,189,30,191,79,68,65,190,176,76,253,62,31,26,199,62,134,74,92,188,150,227,108,190,147,104,245,62,253,17,207,190,101,70,87,62,49,141,200,62,45,12,18,189,183,134,28,190,50,251,14,62,208,171,80,61,184,228,61,189,235,17,207,190,73,123,227,62,166,156,55,60,184,49,135,62,7,255,64,189,246,158,209,61,164,1,86,62,166,42,166,62,227,118,249,62,188,108,212,61,25,211,52,191,17,7,213,62,211,190,107,191,149,157,129,190,3,245,144,191,255,139,181,188,235,174,8,191,154,30,222,190,37,190,248,62,95,96,44,190,240,50,46,191,164,165,238,189,116,52,222,190,3,127,136,62,219,164,36,191,177,177,99,60,212,39,12,189,70,98,153,62,184,242,107,189,16,255,6,62,161,44,70,63,19,12,96,62,28,116,183,62,184,133,85,62,195,99,136,191,216,54,88,63,196,245,134,190,245,226,30,62,242,76,67,191,46,55,109,189,18,105,142,190,83,106,52,191,180,61,185,62,32,110,236,60,186,29,235,62,214,242,115,62,35,224,125,191,111,110,159,62,36,243,107,189,60,40,227,190,73,78,159,190,253,144,24,63,129,241,4,191,55,181,164,62,184,187,32,191,160,120,63,62,249,249,27,191,136,124,126,190,241,220,75,191,29,230,199,62,37,254,44,62,80,198,248,190,191,44,46,190,21,139,144,190,87,12,14,191,237,137,215,62,181,158,217,189,137,12,58,62,215,151,223,190,156,24,88,60,13,247,68,191,220,50,192,61,190,195,125,191,143,33,5,63,69,167,101,190,152,71,25,62,166,126,52,62,196,249,43,63,64,115,61,188,119,66,5,190,87,200,40,189,211,227,164,190,198,13,93,190,250,227,60,189,155,23,196,190,133,226,21,63,229,80,15,191,176,183,240,190,206,130,140,191,145,179,212,61,82,74,242,62,186,106,145,62,3,254,185,61,217,67,77,61,209,148,248,61,179,169,114,62,96,232,192,190,181,232,71,191,52,226,105,190,216,36,65,190,112,54,97,191,44,0,63,62,96,121,218,190,103,150,64,62,106,224,6,63,57,220,59,190,43,2,91,190,225,179,62,63,247,247,145,189,147,239,1,191,48,230,208,62,23,227,109,191,20,42,224,190,49,24,14,190,162,239,239,61,197,97,39,61,2,212,180,61,32,101,98,189,121,40,167,62,207,212,158,190,174,195,94,189,79,232,123,190,145,19,53,190,244,59,20,189,241,130,77,190,155,174,24,191,239,154,38,62,73,156,203,190,177,102,143,190,196,191,201,60,2,252,38,63,252,212,72,62,198,141,147,62,212,26,27,61,156,210,219,190,58,16,214,189,190,112,32,191,105,158,209,190,39,148,152,62,167,25,6,191,225,241,167,62,229,179,149,190,52,183,137,188,60,213,252,190,68,33,135,61,208,111,49,63,7,182,145,190,253,31,167,62,227,111,190,62,31,109,184,189,232,38,111,189,189,6,149,191,136,111,39,189,31,183,189,190,30,138,32,190,83,58,5,190,70,178,138,62,98,250,30,62,237,152,160,62,103,87,226,59,177,248,197,190,152,3,44,190,228,102,189,190,129,149,245,60,195,255,96,191,223,1,13,62,179,45,133,62,239,154,171,60,248,111,145,189,40,130,4,191,216,6,141,191,10,102,53,63,129,117,189,62,106,111,7,62,140,135,191,61,123,60,213,190,163,197,192,62,55,21,18,188,3,180,195,190,139,55,169,190,44,70,85,190,134,172,140,187,226,217,74,62,89,218,153,62,133,165,246,189,232,166,134,62,50,207,214,190,45,126,216,61,102,158,67,62,134,174,157,190,148,98,84,191,86,223,73,190,153,24,183,190,98,248,128,190,29,98,211,62,222,85,179,61,91,92,104,190,239,88,24,191,129,5,56,62,20,157,191,59,50,244,15,191,122,160,254,62,92,162,16,63,193,238,158,190,47,201,71,62,157,157,37,191,38,61,198,61,61,131,154,188,151,207,207,62,119,114,62,190,218,111,7,190,62,220,176,61,237,24,87,189,86,39,15,189,60,34,151,62,4,205,249,189,213,240,87,190,187,136,238,62,69,14,220,190,93,168,74,62,37,26,192,189,166,99,172,190,171,77,143,62,221,75,200,62,110,159,223,61,61,135,26,190,195,38,32,62,187,181,178,60,145,38,194,190,56,72,165,190,181,251,136,191,184,232,163,61,152,237,231,62,195,206,131,191,201,4,34,188,231,111,189,190,135,226,153,62,134,9,92,191,146,98,203,190,139,117,228,61,232,173,217,62,0,131,246,61,216,72,21,190,185,225,5,191,133,79,37,191,121,162,206,190,178,25,173,62,84,209,188,190,212,199,221,62,120,237,105,191,22,11,183,62,206,65,124,60,107,72,151,190,125,129,15,190,31,6,34,189,123,0,173,190,126,21,233,189,92,160,184,62,104,173,152,190,187,187,255,190,200,31,254,60,160,120,58,189,70,173,235,62,105,215,13,190,212,207,149,190,112,127,208,190,201,99,234,61,244,77,198,190,204,221,200,190,141,216,63,61,242,113,203,189,195,28,131,190,126,157,46,191,182,138,252,61,128,38,119,191,247,26,171,189,68,121,245,190,195,119,93,191,124,38,135,62,92,18,76,188,121,192,15,190,251,114,48,62,169,79,18,190,33,90,10,188,177,144,57,62,153,251,253,62,131,215,184,62,219,92,234,61,168,51,68,61,128,193,162,60,231,217,131,190,172,123,47,191,154,154,84,191,10,174,222,62,170,23,7,190,47,246,116,190,17,196,96,191,142,218,214,190,49,254,39,62,202,176,212,61,3,198,59,190,185,134,10,62,1,110,9,63,241,61,157,190,9,152,13,191,66,155,42,63,30,197,87,191,152,51,38,63,7,180,177,190,55,119,23,62,151,60,196,62,176,200,106,190,100,63,153,61,116,48,207,189,140,191,174,190,240,208,27,60,184,14,122,62,33,212,109,62,198,16,147,190,51,193,138,61,248,88,133,62,67,111,72,62,41,12,209,62,243,97,215,62,95,56,24,190,255,184,38,62,6,203,179,189,234,94,162,189,10,216,236,188,111,202,17,61,5,189,41,191,57,103,28,191,209,73,52,190,233,82,29,190,203,58,88,190,177,140,255,62,225,136,133,62,231,105,173,189,29,106,218,190,96,123,160,62,122,172,26,191,250,91,138,190,52,50,222,61,123,75,138,61,106,120,170,62,131,127,41,190,121,6,4,61,111,111,109,190,60,69,39,60,213,31,137,62,52,107,251,189,178,50,13,191,75,115,141,61,9,160,148,62,29,141,61,62,247,111,213,189,56,224,30,62,42,136,121,62,218,221,105,60,26,139,38,63,8,62,170,62,220,228,64,191,90,127,166,61,66,115,45,62,255,248,130,191,95,108,26,62,164,46,160,61,187,63,134,62,87,102,139,190,234,224,193,61,122,144,26,63,107,151,170,190,155,53,76,62,173,63,204,62,10,42,81,62,167,224,143,61,35,199,70,190,45,116,8,190,113,184,220,62,45,137,148,190,127,9,214,190,60,169,63,62,116,66,183,61,72,114,40,190,227,5,161,60,20,99,65,190,187,211,148,190,225,42,133,62,239,51,199,62,157,235,99,62,8,229,91,189,200,218,44,62,250,155,156,190,126,99,79,60,129,71,146,61,7,49,43,62,155,139,39,62,192,90,30,189,232,39,157,190,25,217,116,62,245,227,220,60,4,252,109,188,160,250,7,58,172,193,179,62,63,70,70,61,244,115,167,189,250,137,127,189,66,134,48,191,254,73,51,190,73,244,114,61,239,225,28,63,35,27,201,62,174,48,246,189,171,58,101,189,231,240,105,62,36,141,96,191,123,187,133,189,227,96,230,190,45,171,89,190,238,178,162,190,127,97,102,62,97,19,236,190,44,6,238,189,86,10,157,189,123,112,207,62,199,249,115,61,217,198,223,188,231,106,54,62,238,238,148,190,42,143,144,190,33,234,242,62,32,244,98,62,133,205,97,190,50,163,133,190,179,240,136,61,183,133,187,62,87,145,153,62,206,118,83,61,190,216,22,61,153,69,60,62,160,251,200,62,72,192,119,189,40,185,76,191,206,79,35,62,169,20,173,190,46,154,182,62,77,196,3,189,63,226,6,191,47,245,253,190,252,107,34,190,219,15,3,63,111,89,45,190,189,23,14,61,228,45,112,191,250,187,174,61,100,49,173,189,220,0,113,190,12,61,141,190,37,64,41,189,51,37,190,190,233,237,9,191,120,138,105,62,64,253,214,62,241,180,183,190,219,119,5,190,254,198,104,61,73,63,152,190,234,75,121,61,136,208,43,62,247,78,181,189,232,228,3,191,182,190,134,190,19,92,178,189,11,193,56,190,119,81,51,62,18,93,58,191,131,133,181,62,250,182,75,190,150,237,190,62,162,232,179,188,49,175,186,190,31,240,157,189,61,19,162,188,73,88,42,190,214,237,240,61,213,173,112,62,130,241,66,62,156,186,92,190,83,185,227,62,136,164,106,62,247,81,79,61,17,100,37,191,216,140,186,189,208,131,49,190,48,161,132,62,45,130,163,62,151,15,134,62,131,71,54,62,126,8,249,188,182,74,61,190,68,153,105,62,64,77,28,191,85,1,70,188,12,174,100,60,85,210,17,191,189,216,98,190,37,220,178,61,104,138,206,61,101,246,74,61,90,141,70,191,157,0,38,191,119,140,224,189,93,95,28,191,89,150,24,62,169,20,10,60,53,0,112,189,223,27,56,62,163,177,90,190,217,10,141,62,158,131,203,62,23,249,19,191,131,191,82,62,104,28,166,62,33,127,20,63,238,55,249,190,139,66,5,63,35,100,235,190,134,247,252,190,109,44,114,191,104,229,172,190,55,213,100,61,140,172,219,62,92,236,191,62,221,221,162,62,212,165,65,60,173,208,83,62,83,223,52,190,47,62,122,190,87,135,170,190,241,157,79,191,115,177,200,190,232,95,0,61,154,53,17,190,87,161,243,62,253,48,158,62,49,178,56,190,89,144,180,190,30,216,0,62,212,196,15,191,77,105,121,190,241,175,143,189,147,118,33,188,158,88,87,188,177,249,248,61,231,245,29,191,167,227,214,62,131,12,177,61,65,239,146,62,171,243,18,62,243,160,160,189,120,188,218,62,125,40,115,188,154,157,158,62,211,162,150,190,154,227,40,62,132,191,71,189,221,216,101,62,175,178,93,190,97,25,215,61,10,153,194,61,230,135,81,62,42,179,232,187,253,28,75,62,141,21,239,61,3,102,18,60,149,17,217,62,55,14,146,190,46,245,222,187,201,44,170,190,6,231,218,189,134,95,150,62,86,182,120,190,206,230,212,190,169,81,8,190,12,206,251,61,192,96,125,190,68,95,145,62,62,76,76,190,102,55,17,190,60,11,241,190,46,230,5,191,147,79,138,62,28,195,151,190,68,178,214,61,65,121,189,189,62,39,136,190,203,143,137,62,108,21,111,189,131,165,176,62,112,93,136,62,56,128,14,190,47,103,185,61,211,81,200,190,21,103,3,61,56,143,81,62,41,229,40,191,13,215,142,62,25,17,213,190,224,188,170,190,15,219,10,60,156,60,40,62,28,154,237,61,110,0,83,189,223,68,251,190,236,162,82,189,223,111,64,189,224,124,23,191,56,14,238,61,145,202,143,60,75,45,4,62,45,162,165,62,20,171,182,59,149,4,164,62,180,15,78,62,84,124,244,60,233,56,198,61,224,97,213,189,253,52,95,62,103,163,199,61,106,95,27,190,81,57,181,61,84,42,78,62,183,209,1,62,216,100,132,62,38,9,79,190,172,241,117,61,86,78,214,62,249,27,139,61,200,105,74,190,105,195,42,60,67,196,179,189,85,243,19,190,147,117,101,62,221,178,54,191,41,194,113,190,18,186,237,190,92,174,77,190,216,214,134,62,64,181,187,61,4,42,158,190,213,245,168,61,43,161,34,62,37,226,115,191,183,208,11,62,230,58,229,189,236,241,45,191,34,192,114,189,38,209,72,190,121,86,221,190,238,248,45,61,40,177,166,188,243,158,81,189,36,104,101,59,68,117,144,189,167,49,136,62,162,8,40,188,57,194,217,189,129,55,90,189,57,191,143,190,211,58,79,62,87,4,12,190,212,124,131,190,45,219,6,191,67,139,235,187,31,79,9,62,213,163,58,189,192,90,111,190,119,144,188,189,74,75,12,190,43,73,110,189,129,244,38,190,63,116,110,62,135,235,156,62,107,36,18,61,40,32,112,60,214,17,134,189,95,42,169,189,117,12,83,190,123,167,128,62,181,186,138,190,155,161,95,190,252,51,33,189,138,2,207,61,153,225,197,186,205,229,232,190,105,95,153,189,186,184,181,61,194,167,23,61,135,135,20,190,93,52,55,62,156,236,151,61,86,149,98,190,91,54,243,61,27,135,156,61,234,219,166,189,174,214,138,62,129,72,75,190,193,169,18,190,43,65,169,60,191,163,68,62,225,125,199,190,76,79,31,62,20,77,65,62,48,214,250,61,200,152,249,190,68,53,103,189,3,13,244,189,30,127,246,62,238,225,168,190,77,246,138,190,106,89,211,189,48,124,187,189,194,1,77,62,100,22,140,62,145,193,29,61,96,194,149,187,196,224,27,191,63,200,1,189,159,138,134,190,32,3,128,60,99,23,9,63,67,7,82,61,218,165,188,190,209,194,177,61,236,234,137,62,11,239,76,59,103,126,91,62,90,44,103,190,202,14,54,190,103,20,47,190,126,83,28,189,144,112,3,61,133,141,31,190,240,77,94,189,57,50,231,190,194,8,253,190,204,142,50,191,16,3,179,62,208,66,48,189,243,185,249,61,215,247,5,190,215,211,58,62,187,228,79,191,211,216,30,191,240,150,128,61,161,222,195,190,176,245,80,62,105,75,203,60,15,146,5,61,219,112,33,62,42,112,62,62,50,9,249,60,178,72,147,61,230,165,186,61,72,96,144,61,227,83,137,189,211,128,28,188,209,19,83,190,229,191,41,61,187,161,81,61,0,184,59,62,243,68,173,60,144,78,161,62,218,140,61,62,15,130,137,62,204,140,15,63,226,164,73,189,203,255,154,62,77,70,76,190,64,123,228,190,242,90,191,190,11,20,96,190,200,78,38,189,89,127,101,62,48,65,103,189,191,253,141,62,123,70,251,61,249,148,83,62,16,89,8,190,197,244,155,190,44,185,199,62,161,193,17,190,112,94,154,61,4,85,125,190,212,212,182,190,82,140,145,189,217,236,192,62,86,4,9,188,122,52,177,190,122,92,199,61,19,181,33,190,107,58,195,62,48,168,161,62,208,118,154,61,195,29,157,61,2,98,101,190,49,154,33,61,217,203,130,190,14,253,96,188,72,66,165,189,229,71,106,190,253,10,103,190,52,180,39,62,79,176,114,61,146,248,2,191,27,116,80,62,182,182,205,58,164,220,108,61,152,0,84,62,55,108,231,190,20,95,40,189,233,224,160,61,36,97,227,189,138,107,137,62,187,98,30,190,10,201,240,189,52,194,83,190,18,135,10,191,119,60,162,190,50,57,141,190,195,189,71,62,33,113,27,190,49,233,21,190,56,7,62,62,128,5,179,189,203,226,121,190,98,234,215,190,184,128,0,62,94,156,147,188,181,225,35,62,24,46,32,191,18,66,228,61,1,3,229,60,73,98,129,61,118,122,82,62,176,11,1,60,239,120,66,62,113,168,34,190,30,98,62,190,160,32,31,188,144,21,177,189,148,49,45,62,248,180,242,190,193,76,160,189,49,37,11,190,177,85,125,190,218,124,59,191,154,79,23,190,212,211,235,61,70,101,186,62,35,151,39,62,81,87,37,61,178,3,76,189,96,162,208,61,91,135,141,189,139,54,209,190,107,186,90,62,142,170,14,62,137,100,90,191,80,72,151,190,162,117,58,191,69,232,111,61,20,108,64,62,68,215,133,190,148,181,206,190,156,157,15,191,181,215,120,62,57,185,149,62,69,67,153,62,126,43,47,191,124,66,35,61,178,227,147,61,53,35,147,190,115,203,165,188,195,166,76,62,106,200,155,61,99,16,43,62,10,176,131,61,92,110,103,189,195,89,190,190,6,251,97,62,157,39,120,190,141,103,84,62,89,226,128,62,156,105,113,62,162,49,202,190,198,207,172,62,161,55,71,190,116,181,164,62,66,142,9,190,187,2,251,61,98,18,36,62,101,30,180,190,62,94,125,62,110,170,152,190,90,170,114,190,155,188,232,189,74,100,87,61,106,174,82,62,93,222,33,191,230,7,146,189,100,29,160,61,114,153,56,62,44,39,61,62,191,161,25,190,14,246,135,190,70,72,186,60,204,189,1,190,26,113,79,190,59,246,129,188,50,30,109,61,156,151,213,189,243,1,84,60,181,108,87,61,136,59,6,61,115,204,25,62,167,95,36,62,29,74,41,188,187,139,138,61,185,210,39,62,226,147,48,190,131,176,35,62,74,153,234,189,35,201,251,189,30,105,1,61,34,198,11,190,138,40,134,61,63,67,149,60,203,91,67,190,73,133,167,62,195,70,35,191,164,193,193,190,253,150,236,62,159,127,94,190,203,44,147,189,243,235,218,62,29,138,185,190,20,178,103,191,188,164,19,62,113,84,4,189,141,201,135,60,128,138,77,190,163,110,45,189,9,45,40,62,185,177,138,187,231,8,126,190,126,221,249,60,38,85,216,187,109,154,152,190,5,103,155,190,72,84,85,62,225,99,160,190,103,241,170,190,59,233,81,188,87,222,53,61,24,244,178,62,42,190,76,62,92,105,65,61,101,247,133,190,120,48,254,61,104,6,74,62,54,255,87,62,144,153,207,61,86,126,206,190,158,70,114,61,68,125,137,62,104,90,225,188,145,76,113,61,48,57,146,60,151,149,135,190,77,106,2,191,131,26,147,61,148,226,144,190,161,146,84,190,237,15,113,190,219,49,171,60,122,83,151,190,135,141,45,188,5,155,77,62,218,84,252,189,148,225,117,62,255,211,150,62,17,64,153,62,111,102,201,189,239,16,118,61,30,92,157,189,55,97,228,189,32,70,69,190,52,178,209,190,155,211,158,62,47,3,214,189,229,86,65,190,166,21,117,62,11,140,42,62,252,245,134,62,135,219,148,190,171,11,186,189,208,197,150,61,4,137,163,62,228,86,222,62,11,197,26,190,125,116,164,62,103,190,8,190,167,187,156,60,174,201,25,62,119,45,161,61,205,204,88,61,224,40,246,190,33,119,218,189,250,55,160,58,158,243,105,190,111,94,53,189,128,84,114,61,200,241,144,189,232,230,197,62,49,87,130,62,15,77,240,189,244,200,168,190,61,36,173,62,167,141,0,61,31,71,40,189,109,7,114,62,117,28,52,62,198,170,178,190,56,237,41,62,36,36,19,188,25,19,129,190,198,118,27,191,214,160,127,189,66,25,125,60,89,249,71,62,121,74,151,62,247,107,236,190,253,151,181,189,158,47,8,190,127,69,78,189,66,108,187,62,95,230,207,189,176,118,64,61,246,35,152,62,148,153,246,61,59,206,232,59,209,84,48,191,3,235,207,190,18,253,168,60,223,97,20,187,75,55,191,189,35,239,167,59,101,88,110,62,127,148,217,190,64,96,70,62,75,236,10,62,224,53,194,188,176,24,102,190,90,108,117,62,16,140,49,61,251,8,211,62,43,162,90,189,129,122,174,61,252,74,146,62,24,124,94,188,179,12,241,61,183,250,92,190,114,252,204,62,132,152,9,190,73,237,6,191,11,98,7,63,50,145,23,62,65,95,80,62,243,12,82,191,239,117,202,60,2,194,46,190,177,175,164,191,165,218,22,190,41,244,42,190,152,213,113,62,100,28,11,63,38,245,171,188,115,203,42,62,135,227,186,187,145,130,119,190,127,66,80,190,229,121,96,190,92,124,11,190,218,133,161,62,126,233,139,188,65,185,21,61,180,193,101,191,11,212,51,60,13,138,69,191,199,11,190,60,45,117,158,62,21,144,57,62,8,123,243,62,148,131,50,62,172,211,140,62,161,243,67,62,64,72,183,189,50,237,167,61,231,193,191,188,56,226,86,62,145,167,62,190,54,50,6,63,213,149,5,189,203,254,232,61,199,126,120,191,18,165,152,190,47,51,140,61,176,108,187,62,205,191,253,190,68,153,114,190,105,223,153,191,138,163,240,190,62,254,225,188,76,196,172,62,202,88,184,62,92,9,62,187,47,89,99,62,169,250,1,190,43,74,20,190,157,254,154,62,134,160,220,62,205,252,64,190,242,64,254,62,56,228,103,62,224,125,128,188,147,108,82,62,179,225,189,189,63,63,189,190,33,49,19,191,63,20,14,62,224,146,41,62,135,100,93,186,233,186,61,62,41,140,44,63,186,102,200,188,135,235,7,187,210,18,157,190,198,24,235,190,37,184,60,191,239,78,153,189,186,217,175,61,194,42,59,191,141,181,170,62,35,42,112,189,161,68,200,190,81,9,84,62,213,102,185,62,15,114,9,62,245,44,231,61,72,196,131,190,227,167,182,61,133,108,97,61,196,162,94,191,191,18,113,191,141,154,102,62,242,81,188,57,132,139,164,190,236,95,70,189,106,174,10,191,61,12,203,190,43,218,131,191,94,108,123,62,193,62,1,190,48,107,247,189,141,64,136,62,142,166,88,190,20,138,135,62,220,28,168,189,246,215,228,61,44,172,160,190,129,162,177,188,25,12,221,189,153,14,229,187,140,187,109,190,71,34,191,189,178,143,106,190,182,215,188,61,89,5,22,63,212,34,202,62,168,157,34,62,248,200,243,189,185,255,105,190,232,254,21,191,52,170,64,62,36,208,82,62,10,106,22,189,232,214,102,62,55,166,165,191,57,68,234,189,51,4,232,62,156,83,163,60,181,15,82,62,194,161,67,191,172,125,143,62,2,75,34,62,141,45,177,62,192,180,253,190,255,168,153,189,3,104,153,61,124,25,156,62,2,57,195,61,168,181,108,60,187,123,20,62,163,249,95,191,212,204,22,62,115,64,165,62,227,109,152,191,113,236,182,189,160,42,19,189,64,237,227,62,169,203,137,191,226,65,248,61,120,173,43,191,101,141,130,62,159,24,139,62,151,209,157,191,232,47,15,188,198,7,178,190,113,111,198,190,35,252,7,191,212,129,121,191,19,123,152,62,175,87,177,60,205,145,151,190,229,72,234,61,88,138,179,61,0,166,200,59,41,251,19,191,145,27,137,61,166,179,5,62,136,180,74,62,110,88,184,190,139,35,245,189,213,198,65,62,166,181,31,62,136,60,131,62,56,230,81,191,8,87,251,62,129,183,67,188,186,207,255,190,216,188,71,62,126,175,243,62,182,124,67,62,74,255,44,188,142,228,252,61,19,121,203,62,116,103,133,60,183,249,179,62,191,162,180,62,135,211,170,62,101,125,18,62,91,1,143,62,216,228,208,189,215,46,252,190,236,240,153,62,71,96,50,60,141,234,130,191,127,128,114,62,221,42,49,189,250,215,35,191,215,201,132,191,239,162,89,191,157,86,88,62,135,64,6,63,104,5,7,60,65,42,134,189,111,233,105,191,35,178,53,61,117,2,139,190,188,116,17,190,72,92,235,190,79,154,120,62,170,121,239,190,56,224,172,62,106,143,0,191,140,63,33,190,223,183,145,188,50,182,44,191,195,215,183,62,195,13,165,62,142,217,174,190,42,193,177,189,51,15,185,189,113,239,92,62,233,173,123,62,185,112,113,61,8,36,189,62,160,77,90,191,39,5,229,190,153,67,70,191,158,89,45,190,191,162,131,189,133,179,149,188,132,9,147,189,22,121,122,62,75,248,48,62,198,65,246,61,179,86,85,62,240,54,178,62,151,85,94,62,42,254,206,62,164,195,76,62,200,109,173,190,100,128,174,62,175,114,93,191,130,245,220,190,180,3,9,189,174,109,42,61,80,208,19,190,99,225,238,190,205,145,70,60,174,15,19,190,43,232,101,62,121,246,176,190,101,17,159,62,66,104,25,63,5,98,254,62,216,202,48,191,236,105,195,62,145,112,118,62,170,189,255,59,192,152,17,191,15,58,177,190,175,108,46,62,194,59,44,191,191,119,226,62,14,15,224,62,106,58,137,62,209,41,175,189,56,184,155,61,97,139,193,190,180,102,237,190,149,36,9,191,159,144,133,190,1,183,14,62,7,167,121,190,23,247,133,62,22,194,66,190,42,140,9,63,199,3,207,190,14,82,198,61,79,227,150,191,34,157,19,191,178,18,133,190,66,252,18,62,83,168,50,190,49,23,209,190,82,111,247,189,37,254,161,61,183,173,44,62,135,70,99,191,126,30,130,62,245,129,115,190,165,94,10,189,7,186,79,57,250,164,213,61,54,178,216,62,84,42,236,190,149,115,228,190,125,101,0,63,70,180,67,62,56,160,22,189,242,83,178,62,142,145,159,62,208,99,0,191,16,222,137,62,198,147,113,190,181,42,158,61,221,34,227,190,151,212,224,189,44,19,231,190,226,235,140,62,19,109,64,62,74,247,159,62,126,245,47,62,202,154,53,62,222,25,28,191,70,89,11,188,152,68,3,191,183,119,102,191,93,110,128,62,111,188,28,191,154,16,80,190,212,7,168,189,124,67,166,62,13,175,172,190,229,67,219,190,227,217,66,189,162,111,112,61,127,205,219,190,37,101,61,190,178,71,251,61,200,117,144,62,215,170,142,62,66,132,141,62,222,228,205,190,104,23,105,190,71,101,41,191,196,4,107,62,29,236,11,190,17,104,85,62,231,93,11,191,158,255,52,191,174,203,148,189,4,126,0,61,13,180,143,62,45,8,218,62,184,250,75,190,15,84,137,62,127,233,44,191,166,236,75,189,239,36,232,61,37,175,46,62,107,67,186,61,70,101,183,61,92,169,119,62,244,116,195,62,13,203,19,191,201,19,3,190,88,38,150,62,128,249,121,62,189,3,77,62,159,176,62,61,184,174,166,189,220,26,179,62,95,29,0,62,178,199,121,189,241,178,237,188,175,128,149,62,129,105,81,188,237,27,125,62,59,101,18,191,52,236,135,191,4,35,29,191,240,186,172,189,245,193,11,62,225,48,22,190,137,41,187,61,28,215,208,62,5,47,218,62,43,174,167,190,69,181,204,190,242,226,2,61,150,252,34,62,157,210,125,189,149,248,148,62,183,158,210,190,10,149,146,191,30,55,82,62,1,180,156,190,35,156,241,61,24,37,31,62,48,137,35,191,210,186,71,62,134,32,153,187,250,178,132,190,70,183,85,190,4,180,173,61,56,88,41,61,127,140,49,62,245,15,135,190,32,200,30,190,148,81,117,190,200,13,144,62,136,85,122,61,44,16,102,191,38,20,136,191,170,1,61,191,47,25,148,189,84,94,35,190,162,51,72,191,49,60,146,62,229,230,104,62,61,198,105,62,113,150,142,187,6,89,91,62,79,26,248,62,211,162,249,190,246,73,210,62,16,56,125,62,132,125,129,62,26,195,220,190,84,213,25,189,205,78,178,62,57,66,39,190,170,150,224,190,91,97,57,191,28,181,128,190,122,90,193,61,117,152,98,62,4,121,103,189,3,62,24,62,91,151,127,62,49,54,206,189,27,135,241,62,186,234,121,62,254,139,119,189,217,155,220,190,242,187,115,191,247,64,88,190,12,197,174,62,161,6,155,61,23,112,143,190,37,162,188,61,125,10,37,191,96,133,147,62,184,181,71,62,119,6,92,62,148,189,160,61,201,237,71,62,223,93,210,190,151,82,237,61,108,206,17,62,217,42,7,191,14,13,231,62,125,31,141,60,60,64,134,61,92,136,149,61,162,207,54,191,148,164,113,191,221,149,190,61,16,57,107,60,144,33,206,60,21,99,92,190,35,152,37,62,151,108,224,61,88,217,180,62,137,8,11,191,154,188,127,190,220,46,167,190,153,37,58,62,237,223,237,189,243,235,119,62,55,253,16,191,245,181,135,61,59,137,125,190,205,186,122,189,183,133,92,61,94,100,6,191,55,92,21,61,71,125,253,190,5,182,246,61,98,133,74,191,187,84,232,62,177,30,44,61,138,169,149,62,90,130,99,61,136,33,149,190,143,86,96,188,127,113,204,61,115,248,32,62,197,148,38,62,198,83,150,62,205,143,43,191,233,94,81,191,245,63,93,190,125,89,85,190,176,95,181,189,11,47,142,62,127,53,185,190,15,160,139,191,152,103,32,63,94,124,191,189,29,247,168,62,131,225,8,190,47,116,95,62,231,47,21,190,154,69,39,60,84,113,50,190,194,174,34,61,245,85,169,190,219,142,42,62,234,2,121,190,110,0,20,189,245,206,175,62,182,109,138,191,178,207,221,189,181,55,87,190,42,143,239,60,243,136,185,190,43,211,242,62,38,237,131,191,166,232,137,189,222,132,206,62,141,246,254,60,244,177,249,190,145,169,165,190,211,70,190,62,138,40,70,191,127,243,97,62,39,21,158,62,168,95,15,191,253,248,91,191,26,237,42,190,119,74,67,190,207,184,79,190,69,154,116,62,147,127,139,189,40,254,126,62,250,162,170,62,225,122,176,62,213,247,213,189,130,66,62,191,170,252,161,189,97,191,119,60,150,188,230,190,194,86,174,62,192,115,54,190,159,234,85,62,239,78,217,188,214,10,50,62,154,40,73,191,127,119,127,191,222,245,137,191,155,40,60,62,117,63,134,191,0,12,180,61,242,208,223,185,160,103,75,189,54,179,50,190,147,31,2,63,196,127,141,61,194,98,8,63,245,254,138,189,166,148,140,62,44,8,57,189,214,208,130,62,41,239,125,61,156,48,154,191,113,143,97,188,18,246,17,188,115,60,201,188,137,190,45,188,84,203,97,189,67,218,147,190,93,86,66,189,252,222,48,191,120,108,102,61,61,227,74,62,151,97,225,62,121,197,201,190,245,33,16,62,100,51,148,190,53,158,10,58,212,16,27,62,23,75,7,63,18,159,165,62,210,101,5,62,126,139,63,62,182,27,85,190,84,206,14,191,196,196,3,62,65,165,41,188,105,204,205,190,80,104,254,61,248,251,232,62,208,214,82,62,113,203,9,190,4,222,27,191,2,124,243,61,233,164,58,191,81,82,166,62,110,99,191,190,32,151,29,62,69,214,138,191,162,185,143,62,76,148,47,190,88,184,186,189,227,92,29,191,144,171,4,189,135,126,210,62,92,239,245,61,147,170,223,190,109,230,64,62,44,22,22,190,70,156,237,61,252,42,184,61,169,200,94,62,216,217,77,62,148,178,153,191,37,51,218,61,65,73,186,62,255,120,163,62,53,168,11,190,230,159,17,62,137,221,192,61,122,180,70,191,244,221,188,190,78,39,100,61,78,107,111,190,237,79,74,191,204,60,123,61,84,211,237,189,144,129,18,190,207,67,153,190,202,191,25,191,215,112,102,191,189,136,155,61,247,112,175,62,97,76,232,60,112,134,105,62,203,67,57,191,6,35,183,190,67,6,212,62,174,244,221,62,184,71,183,188,180,205,160,60,42,54,36,191,7,199,132,62,177,236,115,190,228,217,25,61,170,14,141,62,28,92,188,61,85,3,154,190,214,149,89,189,248,86,9,63,59,9,207,62,47,252,240,62,191,245,197,61,99,80,148,62,85,208,10,190,85,34,1,62,3,150,167,62,131,205,33,191,120,84,254,190,32,68,161,190,98,58,130,60,254,138,204,62,8,37,167,190,158,153,79,191,40,4,20,63,212,35,146,190,141,231,115,62,35,81,177,62,59,162,69,189,191,5,113,61,119,155,92,190,131,126,148,62,118,198,218,187,7,145,91,62,190,254,157,61,75,183,9,63,142,120,45,187,11,55,18,63,225,171,172,62,170,132,139,191,40,80,210,189,157,51,151,190,115,254,253,61,243,40,91,62,216,152,168,190,2,245,188,62,35,143,211,60,65,64,88,62,74,33,130,190,56,120,58,191,73,177,23,191,144,244,222,190,194,142,183,62,107,118,139,190,203,10,108,62,101,201,6,191,1,206,51,62,173,221,80,191,130,113,52,190,56,175,88,190,47,129,9,190,31,17,143,60,147,27,0,63,80,255,65,191,14,223,16,191,149,145,95,190,245,204,239,62,146,73,130,62,143,67,102,191,247,185,202,62,189,221,158,61,42,182,131,62,238,246,3,191,23,95,195,61,95,225,133,62,13,106,150,190,21,200,103,191,101,211,59,190,37,76,164,62,107,14,105,62,131,135,68,191,233,249,157,189,1,155,242,190,139,87,88,62,218,89,100,60,218,105,181,190,204,227,119,191,29,100,44,62,121,167,201,62,16,161,209,190,124,19,188,62,173,32,223,58,63,56,39,62,41,71,62,62,228,188,193,190,63,111,195,190,20,225,206,61,117,251,157,190,118,234,131,62,232,7,95,61,157,157,188,190,187,191,5,191,157,31,210,190,212,8,62,191,51,237,173,62,238,83,224,189,177,72,49,61,86,212,35,62,84,214,147,191,7,63,195,189,92,114,181,62,18,84,40,191,208,111,175,62,202,150,221,60,145,8,104,62,40,120,192,62,194,218,149,61,109,172,75,189,10,1,253,61,194,135,52,61,86,97,227,61,107,166,162,191,6,109,233,189,227,19,76,190,118,53,42,191,218,95,171,60,98,92,224,61,7,15,10,190,149,193,44,62,36,222,217,190,61,221,191,61,80,251,223,190,128,40,218,190,86,204,31,191,137,69,35,62,134,1,200,62,10,28,43,191,0,81,46,190,255,193,169,62,205,111,30,191,6,49,3,190,92,214,191,62,171,234,173,62,139,11,143,62,28,227,62,190,66,119,126,190,238,141,197,190,149,80,143,62,133,130,221,62,180,209,164,190,125,133,111,62,206,65,166,62,199,218,6,62,234,58,179,190,190,103,21,191,139,44,88,62,247,183,62,191,41,205,193,189,3,177,17,188,227,118,6,191,245,135,121,59,192,115,118,191,221,104,65,191,29,51,83,60,99,169,204,61,74,231,123,191,105,213,254,61,248,49,172,62,176,85,11,62,2,131,204,189,61,233,189,190,220,33,189,61,153,145,98,62,220,157,70,61,14,44,229,61,179,119,72,190,28,3,68,190,248,187,129,60,45,78,13,191,184,57,46,191,60,74,169,62,74,85,75,190,35,232,161,189,142,183,120,62,76,195,74,190,4,23,164,190,53,168,11,190,124,62,237,190,157,31,152,61,100,83,177,190,57,46,4,61,217,125,12,62,211,114,135,62,231,77,61,190,228,3,58,191,33,45,208,190,41,64,69,190,242,64,18,191,96,198,148,190,130,178,164,62,17,45,131,62,65,61,111,62,207,170,176,62,184,194,191,62,234,61,94,191,211,25,61,191,43,244,92,188,53,14,162,61,152,239,134,62,120,34,199,61,198,45,173,62,50,92,160,190,113,9,214,190,57,97,160,189,243,86,173,62,19,235,89,62,213,162,164,62,91,102,84,188,127,91,211,62,103,154,195,61,202,14,16,191,156,158,157,62,194,161,226,62,158,239,96,61,193,242,238,189,3,199,202,60,185,29,213,61,33,148,174,61,205,205,175,189,170,101,44,62,27,83,246,190,237,155,4,187,252,83,247,189,107,181,173,62,8,115,85,191,174,248,22,62,241,115,104,62,126,156,244,62,27,61,48,61,17,212,62,191,50,248,25,190,63,85,142,61,84,25,135,189,99,233,171,62,26,241,0,62,232,33,16,191,146,61,32,62,171,34,130,189,251,221,52,62,176,158,130,190,120,121,35,62,97,96,34,191,193,60,241,62,172,44,166,190,129,31,102,190,237,238,30,62,107,154,213,60,211,84,22,62,84,64,186,62,37,101,54,61,59,109,112,190,213,176,187,190,18,69,149,61,166,230,65,62,221,135,128,61,28,44,161,191,202,31,68,190,51,242,1,191,95,241,102,62,43,88,6,191,146,254,155,61,92,220,10,62,188,39,23,62,212,194,149,62,28,26,215,62,41,132,189,190,128,121,141,61,233,39,63,191,65,114,191,62,67,161,100,62,211,153,99,191,147,101,111,61,91,177,96,190,116,64,85,191,85,165,8,190,206,231,164,61,49,129,255,59,236,165,38,190,138,11,119,189,109,208,67,190,165,91,139,62,131,194,148,190,29,191,21,62,24,40,143,189,46,157,168,62,10,0,93,190,218,154,61,190,65,150,126,191,239,246,167,62,0,30,220,190,26,26,103,61,148,103,31,191,174,133,32,62,158,184,94,191,160,118,118,62,44,248,12,63,217,58,11,61,251,238,142,191,55,15,55,191,113,163,172,61,151,200,11,191,228,200,187,190,166,119,150,190,22,62,213,190,115,169,5,190,69,123,51,190,201,58,85,62,67,76,65,62,113,100,15,191,165,227,52,62,56,249,54,62,158,88,129,62,124,110,249,189,180,122,83,61,241,194,185,62,112,43,76,191,199,38,243,61,19,35,142,61,50,74,195,62,188,43,154,60,49,114,108,62,246,184,86,189,202,179,80,62,197,171,45,62,37,198,137,62,255,90,169,190,96,244,117,62,89,233,5,188,22,177,76,190,215,195,177,62,179,175,145,190,126,44,158,62,40,1,8,63,198,184,132,190,124,86,248,190,18,214,127,62,35,174,93,190,116,36,116,191,7,129,45,61,157,29,58,191,211,168,168,62,181,172,243,62,169,58,206,61,2,41,155,62,4,84,219,190,86,184,76,62,58,133,48,62,5,185,190,61,145,217,129,188,138,178,188,62,51,132,198,190,235,13,32,188,234,88,28,191,150,204,211,190,189,27,240,62,90,219,105,190,235,44,235,62,70,122,28,190,180,61,12,191,189,100,201,190,117,210,57,62,10,220,162,189,148,156,118,62,65,3,27,191,147,150,242,189,13,19,137,62,164,50,227,61,241,219,162,190,182,187,246,61,3,91,209,62,185,198,221,190,76,169,242,190,188,201,80,62,109,86,181,188,47,62,89,62,148,82,144,61,51,234,35,190,249,66,218,61,66,200,79,190,93,131,168,62,197,127,224,189,158,61,201,189,210,147,132,191,99,169,131,62,243,16,17,62,124,192,141,190,133,125,201,189,105,175,110,189,51,255,227,61,218,214,65,62,47,129,171,62,236,47,252,190,81,188,162,190,142,135,231,189,126,4,140,190,76,27,141,189,61,201,163,62,4,221,157,189,39,117,139,61,37,73,171,62,34,9,49,191,20,232,102,61,164,78,7,189,52,244,51,61,234,152,153,62,106,193,46,188,26,141,251,59,254,152,59,190,237,122,87,62,223,237,22,190,50,130,131,60,4,254,108,62,164,121,145,189,68,197,60,61,166,216,117,190,127,224,178,190,27,162,243,187,179,63,69,62,50,86,72,190,86,194,6,190,65,160,133,61,146,229,184,59,118,197,126,190,21,242,78,190,144,116,37,191,202,166,86,190,109,181,131,189,194,76,18,189,174,105,88,190,177,35,160,59,30,42,10,62,103,94,112,62,1,147,167,62,104,179,187,189,158,75,39,62,245,162,189,60,191,126,240,59,164,159,139,189,17,130,217,62,255,179,204,187,173,196,62,62,222,229,54,62,206,31,176,190,60,237,90,61,215,159,59,62,36,51,48,62,246,50,169,190,239,26,146,190,233,137,50,62,70,90,49,191,247,140,41,191,187,5,17,191,102,35,200,62,233,144,191,62,68,50,22,189,136,123,11,190,139,65,88,190,111,50,114,62,147,78,88,62,242,176,156,190,174,237,8,62,74,12,113,62,22,251,157,62,195,231,144,62,90,139,68,62,147,241,177,62,41,247,32,61,208,201,140,190,116,70,251,189,194,153,25,62,182,112,251,189,244,55,44,62,98,82,124,61,51,103,87,190,167,101,221,61,253,113,140,62,51,58,104,62,125,159,237,189,30,91,63,191,45,44,133,190,170,81,146,188,222,29,63,59,203,205,218,62,171,23,0,191,42,196,47,190,32,17,164,191,90,68,210,62,82,33,67,62,162,183,156,189,126,10,26,62,114,32,210,60,218,246,75,62,9,39,179,190,16,57,96,62,193,117,215,190,222,6,119,61,108,243,236,61,9,222,157,189,186,178,240,190,28,237,204,189,210,119,175,61,123,5,46,191,108,193,60,190,172,94,250,190,206,123,177,190,77,196,34,190,115,18,147,61,85,194,254,190,210,24,53,62,177,197,0,62,145,136,2,62,18,21,255,188,171,93,143,190,251,36,40,190,142,73,229,191,148,13,55,190,114,180,36,190,81,181,4,191,5,174,65,190,87,67,135,61,158,6,65,189,24,193,105,61,81,1,228,190,201,103,6,189,105,120,93,190,135,161,92,62,166,28,130,60,103,3,39,60,106,89,169,191,154,164,87,189,103,6,18,191,247,206,57,191,204,82,135,62,34,93,225,190,241,61,30,61,3,149,154,190,173,46,102,61,214,105,226,60,115,68,61,62,120,184,210,187,20,50,36,190,27,217,229,189,89,70,174,61,137,158,60,189,253,65,47,190,196,231,232,61,173,101,45,190,223,31,84,62,121,9,5,62,115,226,64,190,164,122,173,189,48,139,79,62,68,136,203,62,206,36,75,190,98,56,199,61,243,194,88,62,33,60,90,190,21,207,5,190,214,47,47,185,91,80,193,62,21,216,114,62,155,55,200,190,117,251,133,190,111,153,37,190,184,68,13,62,28,246,85,189,226,160,12,61,19,22,136,62,190,108,119,62,126,80,133,188,34,220,236,188,91,47,224,61,85,135,167,189,126,17,63,62,54,174,156,61,56,108,69,62,228,3,58,190,26,170,84,62,254,48,69,190,194,140,72,191,49,205,67,62,237,27,29,62,58,145,121,187,42,81,62,61,64,167,52,190,145,105,117,190,11,227,143,62,237,238,58,62,39,250,86,190,95,200,35,61,54,186,106,61,74,222,15,189,240,149,23,189,61,83,181,189,84,38,147,189,63,39,65,190,115,58,214,61,132,163,71,190,229,161,105,189,197,239,33,62,113,198,149,190,172,145,141,62,87,72,122,61,166,247,182,190,188,228,199,190,163,135,129,189,20,73,11,191,35,219,152,189,193,69,27,62,204,119,152,62,124,80,241,190,136,97,24,60,128,30,35,190,206,74,220,190,23,214,48,190,22,183,28,61,136,185,169,189,251,96,251,190,180,136,189,62,168,22,171,62,149,100,59,61,138,249,19,190,98,149,0,61,52,219,154,190,211,72,165,190,205,222,154,189,55,209,54,61,251,245,39,191,38,209,66,189,74,242,50,191,167,92,153,190,201,186,219,61,7,16,57,190,251,174,137,188,130,17,139,190,124,23,141,189,79,198,244,62,176,139,119,190,123,152,6,191,186,192,42,190,45,175,247,61,166,168,146,62,123,21,193,62,204,37,39,191,46,25,132,190,181,86,57,62,155,167,56,61,51,165,217,190,44,140,205,190,25,125,175,189,44,217,67,61,206,201,12,62,80,32,237,190,30,162,190,190,105,180,92,190,8,31,14,190,78,134,160,190,135,136,94,62,110,49,4,62,20,201,95,62,198,118,43,189,209,24,11,191,35,221,87,189,36,55,118,61,152,217,223,61,94,251,74,187,115,39,146,190,170,220,85,190,72,174,191,188,235,80,217,190,77,228,172,62,202,168,5,191,231,98,164,61,230,75,218,189,165,209,72,190,251,24,69,62,197,216,235,61,244,1,77,190,91,212,180,190,197,153,181,188,155,113,154,61,48,166,9,190,224,138,175,61,215,94,153,62,172,71,185,61,65,87,92,190,121,108,25,190,149,143,147,190,224,187,157,190,234,33,194,62,235,152,47,191,67,121,140,190,105,245,165,62,190,95,56,189,13,1,40,62,229,47,93,187,60,116,63,60,30,237,203,188,34,75,246,187,51,85,94,60,210,128,131,188,73,210,131,190,252,39,58,190,52,152,245,61,215,48,8,62,43,195,234,190,77,30,0,63,74,175,225,190,224,202,183,189,197,79,191,189,166,27,76,62,43,225,162,61,118,221,59,190,14,143,202,61,62,7,184,191,25,23,122,61,167,183,215,61,113,196,172,190,123,144,158,62,121,138,154,190,212,221,21,191,33,196,165,190,18,102,42,62,232,24,210,190,16,15,39,61,33,152,151,189,188,64,236,61,252,38,59,190,107,243,171,61,205,243,236,188,14,4,136,62,61,3,178,190,172,125,11,62,149,41,136,61,26,135,222,62,149,126,99,61,243,180,254,57,5,195,235,189,205,250,135,61,40,83,174,62,255,38,53,191,51,57,238,190,207,215,232,190,209,117,81,190,159,209,177,188,200,144,17,62,176,41,225,189,217,142,141,190,184,249,167,61,146,75,135,61,193,111,82,62,240,14,171,190,25,186,154,61,49,17,211,189,78,161,130,62,197,44,124,190,189,230,36,61,183,225,247,190,172,252,82,61,115,186,70,190,39,88,102,191,134,193,91,190,168,11,59,62,49,235,250,60,78,136,141,190,17,165,144,61,79,35,147,190,212,91,74,62,41,57,230,189,204,123,174,60,75,156,10,191,171,11,139,190,144,186,215,189,219,31,209,190,119,105,180,188,3,28,187,62,33,24,148,189,139,31,132,189,46,46,122,190,97,71,160,62,128,77,79,61,50,208,47,191,78,19,85,59,86,63,163,61,87,102,20,191,42,127,7,190,150,160,121,190,127,97,109,62,249,146,168,62,221,8,136,61,152,75,188,189,234,118,193,190,72,152,6,190,123,30,56,191,53,85,128,186,241,134,45,189,95,162,153,61,151,162,118,62,81,209,155,62,193,225,102,62,179,29,21,189,182,39,178,189,171,44,226,189,62,139,114,61,164,209,13,62,212,127,30,62,110,177,37,190,123,147,207,190,164,55,53,62,116,83,175,189,83,51,8,190,11,221,21,190,74,115,112,62,130,239,161,61,74,63,189,61,246,159,130,191,253,84,197,189,125,64,26,190,210,40,185,189,43,180,28,61,108,182,51,60,97,11,180,189,241,220,246,61,29,132,5,62,196,83,12,62,75,9,184,189,105,84,181,190,14,200,107,189,1,123,30,189,155,204,249,188,188,73,42,62,31,45,155,189,201,165,192,62,139,92,222,190,126,242,106,190,185,134,251,190,91,214,66,190,160,164,137,62,224,90,153,190,233,248,188,188,193,248,181,61,158,181,112,190,40,191,10,61,30,96,139,190,1,15,167,61,150,39,154,60,128,182,31,191,238,159,140,61,134,213,29,189,47,184,195,189,105,145,139,190,140,1,106,60,30,115,34,191,104,198,156,190,149,218,210,62,213,170,2,190,3,170,103,62,95,251,107,61,11,12,24,62,23,138,97,190,223,74,223,189,97,232,188,61,166,153,52,62,153,30,157,190,158,177,251,61,190,81,171,189,254,160,89,62,149,156,198,190,99,99,107,62,144,246,106,191,109,175,161,189,143,0,80,189,112,150,249,189,30,116,40,189,46,5,191,62,243,48,255,61,44,53,9,61,67,162,35,62,196,203,168,189,198,191,64,62,212,83,181,190,225,55,165,188,118,253,191,189,213,84,148,189,91,187,116,61,174,97,74,191,4,203,86,62,187,238,48,189,184,149,160,62,230,68,180,188,14,39,36,191,82,174,166,62,78,193,140,190,142,207,204,60,12,71,159,61,2,88,84,62,156,190,17,189,22,87,227,189,206,210,109,189,11,244,116,191,39,247,217,190,146,12,238,189,144,156,120,60,110,249,122,62,21,8,4,62,81,207,145,61,140,229,74,190,105,44,136,62,141,15,18,191,161,213,239,60,242,219,109,189,27,240,64,61,147,79,35,190,59,213,44,190,252,18,35,190,172,162,184,61,156,147,48,190,111,13,253,188,1,113,209,61,23,254,137,61,77,169,24,190,38,166,215,188,219,228,171,189,204,29,41,61,235,147,10,190,149,88,0,62,242,156,31,57,133,247,254,61,236,1,190,60,189,95,16,62,30,1,185,62,107,12,13,191,57,200,135,190,30,24,3,190,99,243,173,190,166,66,173,62,138,194,177,188,82,61,40,190,119,187,132,190,225,66,44,190,207,111,128,190,33,76,81,190,48,251,203,190,91,246,120,190,218,183,138,190,115,155,129,190,200,251,156,190,2,147,156,62,173,226,175,62,238,169,3,190,191,232,118,189,6,197,128,189,189,42,5,189,3,188,5,190,156,187,15,62,175,146,10,190,167,14,243,60,190,10,53,61,82,210,90,60,112,146,123,189,63,95,177,61,47,43,59,190,88,151,91,191,61,179,77,190,4,228,83,190,213,253,4,191,222,253,4,190,66,175,42,62,238,204,91,187,7,157,45,190,44,76,8,191,241,172,101,62,50,64,13,61,178,73,155,190,17,36,57,190,54,231,165,189,207,93,245,61,145,130,176,61,225,70,60,61,110,69,223,59,61,200,93,189,71,100,216,189,55,110,195,189,243,159,73,61,35,42,33,62,93,181,25,191,230,245,6,62,147,145,184,61,163,13,194,61,216,36,158,62,59,25,227,61,23,32,35,61,231,19,166,190,114,172,28,62,7,68,193,190,94,50,253,190,144,62,17,191,172,204,139,189,42,102,96,191,153,69,169,60,9,55,140,189,109,102,14,190,86,180,75,61,112,247,174,190,37,8,240,61,55,1,170,189,62,155,131,59,132,162,192,60,65,198,91,60,88,191,66,62,43,61,92,190,185,181,210,190,176,45,127,190,2,213,135,190,12,167,62,189,43,158,113,61,90,9,195,60,243,12,11,62,189,168,135,190,228,65,111,189,9,192,214,61,80,208,114,188,56,228,149,189,117,170,138,61,2,41,33,62,141,110,138,61,0,134,140,62,193,213,162,61,80,221,39,190,83,71,102,190,20,1,50,61,221,253,102,190,212,21,207,62,200,103,254,60,36,189,55,62,124,239,184,189,15,44,243,58,7,206,137,190,176,223,82,190,251,30,15,61,26,160,211,62,65,242,176,61,192,250,18,191,134,100,55,189,152,9,10,59,135,61,166,59,226,123,21,190,240,78,206,62,24,105,137,61,37,227,18,191,59,68,24,191,22,213,240,190,247,67,159,191,173,229,145,62,146,154,207,61,32,120,174,61,253,28,17,62,89,97,45,189,244,122,141,190,87,19,13,62,243,45,10,62,1,98,170,189,134,96,28,190,136,143,65,60,60,240,1,191,98,183,244,189,35,35,63,191,172,194,44,60,236,188,14,190,206,2,254,189,236,85,200,61,194,190,68,190,104,96,23,62,177,3,16,62,239,239,145,190,234,254,242,189,119,75,28,190,130,246,135,190,58,190,8,62,255,134,79,190,4,224,224,190,187,67,228,189,68,69,90,189,229,226,95,61,110,124,110,190,93,113,95,188,132,234,84,190,61,101,222,189,154,31,141,62,138,147,197,190,44,3,6,62,14,109,189,190,24,58,21,62,206,161,210,190,107,17,106,62,120,249,168,62,32,248,11,62,194,176,2,62,53,164,138,61,159,97,26,187,99,237,88,61,27,218,251,61,57,55,11,191,113,230,141,61,202,159,33,62,76,116,134,190,250,243,56,62,71,247,70,62,67,234,74,190,68,120,59,62,151,152,230,189,216,200,44,191,0,153,111,62,136,3,201,190,106,27,240,60,90,90,68,61,31,205,128,191,80,221,164,190,243,138,31,190,60,185,2,190,197,41,172,190,201,175,84,62,67,49,209,189,137,87,49,62,8,155,188,188,210,51,161,190,209,246,103,189,222,142,138,60,115,182,90,62,188,225,37,190,60,89,118,62,211,216,12,190,170,106,30,190,203,114,116,188,18,61,223,187,157,198,229,61,120,221,222,62,223,13,216,62,138,150,99,190,172,253,130,189,15,83,93,189,191,221,160,62,47,3,70,62,116,216,23,190,232,162,160,189,5,64,176,190,14,22,84,62,155,187,10,190,18,132,67,191,20,61,14,190,140,255,175,190,26,194,94,190,66,202,238,61,73,104,19,189,85,70,102,190,170,237,207,62,119,238,39,190,22,176,133,190,120,211,156,190,243,95,5,62,58,56,106,62,165,27,24,62,243,2,129,60,31,231,215,61,142,131,160,190,204,51,19,59,94,152,205,61,227,27,191,62,29,222,17,62,218,190,37,62,233,108,72,62,16,150,150,62,231,185,154,189,49,221,193,190,19,109,43,191,16,222,153,62,142,156,22,188,165,40,150,61,23,99,94,190,222,212,28,62,254,20,249,60,181,5,196,190,20,193,47,190,48,114,84,190,134,6,24,61,77,127,108,62,208,250,143,189,143,137,16,61,134,31,8,189,149,111,20,62,205,49,223,61,65,252,98,62,140,67,233,189,117,62,169,62,20,77,170,62,43,128,255,189,121,194,119,190,30,82,152,62,197,27,231,188,117,127,211,190,206,228,200,190,150,232,116,62,236,247,41,62,97,188,74,62,162,110,207,189,180,75,59,190,212,50,42,191,99,156,39,62,252,235,14,190,34,41,115,190,220,253,23,189,52,135,50,61,238,120,247,190,38,158,141,190,193,161,173,190,59,64,23,190,207,125,252,61,210,79,161,62,74,9,42,191,62,209,219,61,119,195,26,62,3,112,139,61,118,86,96,60,124,115,213,61,210,52,88,62,154,210,163,190,59,210,17,188,14,72,196,61,80,222,243,189,37,92,15,190,29,188,188,61,224,202,172,61,175,175,73,190,95,146,183,190,74,80,96,188,107,144,79,62,96,135,128,61,236,220,27,190,136,97,134,58,95,140,212,61,5,146,15,62,220,165,169,62,97,152,134,61,54,0,138,190,225,150,223,61,165,186,13,190,120,141,136,191,130,27,150,62,125,43,219,61,122,211,232,62,186,43,121,190,134,170,44,191,171,200,222,62,153,7,151,61,161,191,79,191,55,143,191,190,168,56,222,189,244,32,231,190,209,140,145,189,20,239,18,190,212,82,164,189,244,131,23,190,84,162,69,190,210,54,145,61,152,184,177,59,166,139,79,190,251,145,136,61,103,240,213,62,21,163,5,190,98,212,139,62,145,129,71,61,235,250,30,190,136,157,253,58,66,247,46,190,210,145,133,61,27,132,180,62,134,191,147,62,157,110,142,61,105,93,245,189,103,125,143,61,225,104,25,190,212,12,151,61,230,138,57,191,172,133,200,61,171,162,170,189,231,129,161,62,54,73,234,190,89,157,243,188,75,167,152,62,193,193,10,190,127,70,233,59,2,79,101,62,253,29,208,61,15,86,16,