{"meta":{"epsilon":0.009986238554120064},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[55,173,184,62,82,167,249,190,32,144,126,189,243,100,44,63,95,83,95,60,45,21,37,191,68,43,40,191,32,153,212,62,144,64,211,191,19,189,58,63,38,240,120,63,157,69,12,190,213,57,129,62,69,51,180,190,28,171,72,190,175,247,192,189,70,50,218,190,122,155,107,62,120,144,158,62,212,94,140,191,223,51,171,61,224,46,39,61,7,112,14,62,79,86,93,62,245,163,163,190,137,189,6,62,200,214,60,63,198,38,228,62,145,243,141,62,188,22,9,190,199,37,1,63,83,190,75,63,155,213,46,63,58,217,16,63,222,241,185,62,2,120,50,62,29,231,206,62,229,208,25,191,142,90,140,61,117,240,183,190,214,50,136,189,153,154,171,189,232,117,40,60,110,134,254,62,74,31,227,190,46,144,234,191,120,24,128,62,136,21,198,62,165,89,196,190,34,198,202,62,251,113,169,190,182,11,13,191,210,227,182,62,93,28,153,191,17,245,255,189,112,8,15,190,92,181,170,62,217,157,170,191,18,202,75,189,60,67,64,190,160,212,213,62,23,33,204,190,235,253,241,62,233,101,188,189,20,197,7,190,43,72,56,191,85,190,225,60,47,31,139,62,0,92,6,63,87,83,106,62,111,109,52,191,114,25,45,62,160,104,55,61,255,93,148,62,28,110,16,63,105,20,18,191,102,62,178,58,168,191,200,190,250,126,20,191,192,13,125,61,37,143,164,190,242,169,147,190,167,123,117,191,238,190,214,189,38,24,185,62,24,87,229,62,88,251,236,61,215,107,65,190,49,143,10,63,0,176,232,190,194,102,34,190,52,160,168,61,20,59,198,62,138,21,55,191,98,231,9,191,81,155,8,62,9,161,58,62,81,100,249,190,24,202,83,191,250,49,13,63,19,151,128,61,219,2,80,190,194,85,204,190,216,113,62,191,173,220,204,189,104,134,81,61,164,156,23,62,134,171,251,61,101,53,31,190,61,88,24,63,172,80,54,191,157,18,58,191,201,79,211,62,42,135,39,190,72,86,54,63,134,62,142,190,239,36,93,61,63,140,149,62,3,18,52,61,193,185,39,61,122,187,172,188,134,36,194,189,89,34,213,61,156,165,183,62,92,17,3,190,28,245,43,190,193,193,73,61,225,135,212,62,108,44,130,62,177,182,69,190,175,16,43,62,124,22,35,191,157,248,162,191,2,62,255,188,173,25,179,190,127,4,7,61,30,124,115,190,121,201,241,61,212,214,99,63,173,215,7,189,109,120,62,63,38,113,168,62,67,106,81,62,196,153,189,189,157,54,143,62,115,41,48,191,167,127,66,190,111,248,24,189,56,235,217,62,23,62,214,62,109,232,232,191,196,205,113,190,223,140,35,190,229,214,219,187,206,120,49,63,174,87,88,62,241,242,20,191,39,208,116,190,189,60,81,191,119,54,40,191,59,123,155,190,87,182,170,190,12,50,38,190,89,105,145,190,46,101,101,61,120,9,245,62,192,176,42,63,194,52,54,62,91,65,250,61,95,61,30,189,172,81,68,62,86,79,136,62,134,64,66,190,182,38,247,190,195,144,11,191,40,12,54,63,18,3,92,191,158,161,217,190,69,137,180,189,28,155,139,62,230,116,96,191,92,115,201,190,134,20,117,188,137,146,23,190,3,209,152,190,149,227,212,62,191,28,10,190,92,215,5,190,121,136,26,189,162,90,158,190,252,30,228,190,12,155,91,190,202,72,196,190,14,238,161,190,212,36,216,62,11,88,135,190,45,16,84,189,206,146,29,191,117,167,112,190,219,80,208,62,65,133,47,63,207,161,225,62,176,48,84,190,137,109,100,62,12,139,217,190,156,163,155,62,169,26,205,62,70,245,252,190,1,233,10,63,155,184,131,190,109,240,14,191,166,72,2,190,206,94,235,62,47,194,152,62,184,16,176,190,228,74,165,61,120,168,197,190,8,202,60,62,119,180,209,60,225,69,207,190,213,171,3,61,245,105,158,62,9,112,70,63,28,249,221,61,61,189,21,189,65,38,142,190,99,70,218,61,28,178,157,61,221,39,17,191,154,104,164,189,194,51,223,189,213,114,21,189,187,177,150,190,36,211,252,189,1,198,197,190,142,62,58,61,221,89,154,191,95,198,105,190,207,215,113,188,113,209,219,62,8,200,47,191,41,237,35,191,47,92,172,190,209,229,144,62,84,195,215,61,250,68,213,190,42,122,136,191,12,60,8,61,158,180,161,62,41,155,141,190,49,231,32,191,172,106,103,191,152,99,162,190,28,103,152,62,15,14,102,62,192,230,78,63,99,135,253,60,180,120,80,191,67,201,2,63,105,122,176,62,71,9,250,190,204,169,189,61,247,1,198,62,213,83,208,190,246,69,253,62,157,75,2,190,204,20,52,62,184,60,69,190,48,186,146,190,100,174,165,189,10,19,141,62,78,198,4,63,85,96,26,189,51,11,23,62,113,197,164,190,187,79,18,191,193,117,249,61,158,235,5,190,212,196,9,63,85,179,172,189,69,180,248,190,114,159,4,191,117,52,194,191,171,131,9,190,82,192,226,189,131,209,12,187,78,242,156,190,218,198,130,191,189,45,210,188,27,144,243,62,23,160,114,190,228,250,161,190,234,97,105,59,33,203,18,190,84,156,171,61,164,92,104,61,68,103,209,60,165,175,12,62,142,1,147,61,112,4,171,62,141,183,32,62,128,195,1,190,149,50,194,60,147,230,238,62,122,29,88,190,208,244,63,62,168,44,14,61,68,19,212,189,150,44,30,190,27,211,104,189,0,138,229,62,133,182,203,190,151,212,138,191,49,0,105,61,188,29,114,190,57,131,160,189,209,73,136,62,30,132,61,62,128,42,54,189,150,12,244,60,145,155,152,61,9,31,120,62,126,122,180,189,83,123,190,189,22,84,30,191,62,240,145,62,212,7,17,191,243,58,222,62,14,196,162,188,191,173,88,190,111,129,14,190,103,221,157,190,252,250,32,63,195,95,131,190,195,139,29,63,12,193,9,63,30,164,183,61,251,210,191,190,148,213,115,188,242,81,15,188,180,242,108,190,175,116,185,190,224,157,212,61,54,2,204,59,176,69,41,191,195,166,199,61,209,234,166,190,67,44,187,60,66,96,15,62,251,104,14,191,247,27,84,63,18,242,103,191,36,119,6,63,17,105,153,190,199,126,133,60,130,137,59,190,27,60,199,190,98,119,18,63,40,239,183,190,207,168,134,190,136,104,27,62,203,170,158,190,169,30,78,190,134,221,24,189,85,195,146,191,158,200,133,191,90,226,39,190,250,198,236,188,240,27,106,190,196,175,226,189,180,171,145,190,198,92,73,62,239,0,159,191,134,36,157,189,27,140,242,60,4,119,62,62,27,217,175,191,0,53,26,191,247,162,128,62,171,67,38,190,6,46,173,62,171,68,177,62,117,225,57,191,234,125,129,62,117,182,181,62,125,228,122,62,135,223,75,62,164,2,9,63,6,79,196,61,30,90,146,191,51,58,85,190,159,194,59,190,201,40,87,189,253,112,132,191,141,161,150,190,20,10,63,62,254,59,3,190,206,29,44,62,186,20,78,61,57,13,134,62,253,114,214,62,22,51,175,191,87,83,249,61,166,40,58,63,137,218,150,62,7,79,184,189,249,68,199,61,72,144,183,60,235,232,144,62,6,159,137,190,220,118,11,62,205,212,171,62,116,113,181,62,69,185,152,190,41,56,25,63,244,4,175,62,222,254,5,189,172,99,220,189,97,106,187,189,236,44,228,189,73,174,132,190,202,165,57,191,90,251,25,191,113,114,44,191,162,120,186,62,0,169,30,190,96,0,90,62,218,236,147,62,201,222,188,187,136,47,131,62,152,59,28,190,152,115,197,60,66,68,159,62,95,28,251,61,54,135,40,62,222,2,130,62,44,187,212,62,229,140,35,61,149,88,106,191,67,89,160,62,179,159,77,62,2,8,159,62,0,34,14,62,52,134,89,62,55,198,7,190,191,77,165,61,77,47,33,191,196,61,225,189,132,180,62,189,208,196,226,61,154,92,0,61,87,8,146,191,29,94,230,188,80,191,26,189,150,39,186,190,56,77,0,190,154,62,202,62,215,150,248,62,196,227,43,63,188,247,253,62,243,59,130,189,8,13,157,190,52,255,84,191,197,241,159,60,47,43,198,61,122,146,44,62,235,39,236,190,5,203,65,191,142,31,157,189,100,240,153,190,139,18,55,191,20,205,122,190,129,42,223,62,7,163,207,61,116,199,129,190,0,179,145,62,129,132,56,62,251,135,134,190,252,57,156,61,187,180,182,62,206,156,3,61,212,5,193,190,180,48,62,62,221,173,79,61,26,18,24,190,230,236,10,188,86,154,194,61,76,7,59,189,130,46,250,190,232,39,170,190,103,243,89,189,96,171,58,61,190,149,218,190,39,146,64,191,236,149,196,190,154,168,50,63,140,110,41,190,255,238,138,190,253,185,255,62,76,221,172,62,221,168,40,63,112,146,161,190,71,35,211,190,189,193,39,190,146,220,254,189,73,123,155,62,148,85,253,62,114,6,29,190,30,206,58,190,91,243,211,189,145,193,53,61,6,37,77,191,198,16,239,188,211,123,122,191,99,50,53,191,170,30,23,62,13,57,100,62,121,132,112,62,227,176,181,60,210,56,67,62,162,192,15,191,135,213,66,62,221,116,186,189,196,209,22,190,175,79,139,189,195,42,65,61,202,31,164,62,222,162,235,190,192,113,136,62,186,32,157,61,162,6,40,189,78,248,19,63,204,143,211,188,96,102,175,190,233,221,25,191,33,157,173,62,121,200,143,189,28,103,10,190,181,45,0,62,221,201,69,191,215,101,226,62,64,225,116,60,15,161,49,189,227,164,198,190,160,13,90,190,16,78,101,62,212,66,154,62,201,76,70,63,245,100,176,191,187,76,6,62,91,188,77,61,250,116,41,63,136,56,248,61,251,108,175,62,170,25,173,61,83,137,246,190,89,219,251,60,29,93,106,60,251,207,51,61,30,112,228,189,168,124,251,189,122,45,142,191,3,96,54,62,195,224,131,62,6,178,144,190,81,39,113,190,182,99,139,62,96,40,139,190,232,38,150,190,40,210,113,62,220,134,217,62,31,31,143,190,41,74,187,62,64,173,179,190,144,227,52,61,115,49,70,62,187,89,117,190,198,128,130,191,184,77,192,190,175,147,52,191,138,184,250,60,113,70,248,59,28,109,98,189,113,157,9,191,251,36,82,61,195,214,135,61,88,178,92,62,127,193,53,191,200,239,14,62,148,118,208,62,87,159,247,62,150,213,25,63,94,87,133,191,154,156,220,61,93,205,211,190,61,50,228,187,3,60,41,62,233,249,49,191,172,200,213,188,102,156,8,190,169,128,170,190,218,107,6,62,173,165,157,190,68,223,127,62,82,138,254,189,191,117,57,191,2,15,7,63,50,1,230,62,80,186,212,62,40,34,24,62,42,158,123,61,250,153,196,62,91,237,61,62,66,144,226,62,90,52,99,63,175,148,101,61,58,62,82,57,38,158,192,190,7,216,35,191,171,249,23,190,158,27,204,189,42,253,94,60,172,82,26,62,30,58,105,190,199,94,199,62,156,118,110,60,225,202,233,190,174,253,129,61,32,156,19,63,254,88,219,190,135,105,102,191,248,126,50,190,62,187,47,191,174,59,20,188,107,123,107,188,141,169,38,60,166,107,82,61,145,230,168,62,230,188,33,190,0,100,61,189,20,23,83,190,130,128,0,60,136,249,108,62,169,2,120,60,94,6,221,190,57,60,194,189,92,64,48,189,208,25,199,191,211,14,173,190,201,114,104,61,185,7,164,60,105,79,80,62,205,32,65,189,240,231,62,191,47,37,28,63,184,58,192,189,31,179,169,62,128,121,206,62,85,174,159,62,247,243,172,190,203,5,114,188,30,113,6,190,20,184,225,190,122,207,36,191,184,49,122,62,41,246,141,190,10,121,120,190,16,72,211,62,170,61,5,63,73,241,182,60,245,167,29,63,52,25,53,62,44,212,246,62,41,101,180,188,234,156,71,191,23,240,116,191,58,253,40,189,153,178,34,63,176,61,158,190,101,246,191,61,133,1,200,190,36,136,0,190,57,215,183,190,161,126,238,188,30,13,36,61,148,90,18,189,236,2,10,191,142,169,142,58,109,120,195,62,127,190,142,189,84,130,34,191,158,55,196,189,73,127,94,190,177,67,49,60,16,140,160,190,192,249,239,62,207,174,78,189,70,24,236,61,98,81,20,190,132,62,159,191,21,30,212,189,0,97,205,189,129,220,40,189,149,239,136,187,86,224,2,63,234,8,163,189,101,30,192,189,14,171,251,62,83,249,222,61,104,122,73,190,131,37,251,61,50,41,229,62,153,36,240,60,117,60,36,190,6,150,6,190,215,171,78,60,239,242,50,190,7,175,171,62,25,142,3,63,212,63,1,189,198,242,134,190,177,120,36,190,193,231,76,62,108,68,106,190,111,81,229,190,156,230,160,60,185,20,201,62,108,60,162,61,135,141,176,62,19,130,201,61,16,93,240,61,23,23,187,60,99,233,6,63,226,181,248,61,172,244,2,63,202,98,159,62,183,9,230,189,53,81,156,190,94,240,135,62,135,47,222,190,180,129,129,191,13,74,53,190,139,222,101,62,20,93,236,60,208,187,255,189,253,111,214,62,64,55,163,191,227,95,73,188,164,8,133,189,221,140,57,60,183,173,205,190,51,27,56,191,35,109,211,190,132,162,235,190,227,146,109,190,12,48,129,190,222,11,183,190,9,189,221,190,156,187,96,190,16,25,150,190,2,38,232,189,200,29,52,62,88,42,201,190,247,175,62,190,85,138,13,191,41,232,30,63,75,165,32,62,214,47,44,191,236,223,2,63,17,210,140,190,223,42,178,61,155,140,128,62,82,12,33,190,78,211,215,189,8,123,147,188,183,190,206,189,53,29,225,188,17,55,117,189,29,180,158,190,60,0,249,62,24,121,162,190,146,144,11,63,182,31,17,63,65,1,207,61,88,231,68,191,39,58,9,188,193,236,223,188,184,65,169,189,190,113,30,62,76,68,28,61,97,240,167,61,154,100,180,62,26,119,155,191,115,250,66,63,250,223,132,191,215,222,234,189,47,234,145,61,228,71,119,189,132,4,207,191,236,99,31,60,201,58,141,61,67,27,100,62,71,183,77,62,196,118,76,62,109,138,97,189,171,128,8,63,186,251,68,190,96,62,145,189,219,55,15,190,46,230,208,62,243,56,41,189,93,197,125,62,92,132,2,191,70,212,201,190,100,48,56,62,1,203,90,62,38,245,151,190,160,85,106,189,100,161,73,61,22,189,190,190,215,65,66,62,5,33,228,61,184,40,118,62,169,213,135,62,218,113,159,62,230,164,59,190,101,222,104,62,153,70,31,60,65,238,149,190,168,249,142,188,76,36,215,61,244,40,238,188,64,150,135,189,60,109,14,191,118,13,233,190,196,175,54,62,124,168,201,190,252,55,115,62,215,223,165,62,51,184,94,60,85,123,151,62,25,181,243,189,107,78,40,61,85,61,134,189,45,137,73,189,150,99,28,61,26,58,201,62,226,7,13,190,98,129,202,62,130,7,123,190,84,185,165,190,149,75,190,189,9,1,188,62,206,246,105,189,206,199,222,190,85,91,192,187,19,188,199,190,61,134,190,61,14,175,122,189,73,115,83,62,107,247,98,190,37,196,83,61,186,223,186,62,15,38,240,62,25,87,209,187,159,35,254,62,28,20,71,190,118,132,30,191,196,195,181,189,6,173,20,190,164,179,202,190,65,53,222,190,77,61,2,189,206,111,62,190,126,250,224,189,200,133,224,61,176,106,25,62,187,229,140,62,10,150,168,61,17,107,31,191,215,19,67,190,227,215,58,189,202,3,37,190,157,120,172,62,139,127,42,190,237,243,185,190,187,152,47,190,87,66,210,61,61,139,49,62,65,1,105,189,223,138,104,189,123,108,38,61,53,170,41,189,177,18,175,189,93,166,20,62,124,126,114,190,193,74,74,187,126,252,124,189,210,250,49,190,213,222,240,61,85,70,18,189,102,239,134,62,63,66,118,190,244,155,133,62,212,142,218,61,47,201,131,190,118,189,157,190,50,187,133,190,115,25,252,190,93,231,50,62,218,144,123,61,162,170,39,190,74,14,96,189,220,112,56,189,126,206,221,62,188,91,70,62,152,121,148,62,71,58,152,191,21,45,175,190,176,34,6,190,161,171,199,188,190,11,46,191,194,83,134,190,23,227,229,61,89,22,13,63,185,196,232,62,204,153,183,62,26,174,46,62,33,229,207,190,102,118,32,59,216,5,136,190,209,226,132,61,12,25,237,189,214,244,253,189,27,200,191,190,38,194,254,189,173,80,143,62,214,109,107,190,77,149,235,189,253,147,202,188,223,97,39,190,211,159,135,191,107,185,254,189,154,115,24,191,150,71,22,190,209,63,133,60,222,41,12,62,67,45,55,62,200,89,133,190,13,141,18,62,150,242,209,190,37,171,128,61,135,172,221,190,70,14,6,191,202,176,191,62,188,105,228,189,164,201,31,189,139,226,151,60,75,145,133,190,67,64,175,189,154,190,162,189,143,183,251,186,41,93,250,61,254,84,12,62,153,103,67,61,56,48,161,62,190,89,51,190,99,38,145,61,149,90,16,189,64,83,45,190,5,38,20,63,117,125,45,61,110,153,41,190,2,197,221,190,214,72,162,189,166,59,169,190,188,186,251,61,130,154,175,188,78,190,144,190,232,5,45,62,139,113,165,189,201,30,7,61,254,185,3,63,199,53,30,62,224,73,132,190,111,254,195,187,250,91,75,189,178,121,91,62,173,241,18,189,1,136,157,189,39,198,228,190,177,63,20,190,27,114,135,189,38,15,22,61,142,209,227,61,181,176,159,189,141,100,12,62,4,186,95,189,44,64,150,189,16,147,162,60,8,225,186,189,164,191,157,58,236,173,5,59,142,253,82,190,227,213,185,190,178,115,141,190,56,230,138,190,39,169,214,189,27,72,214,62,211,30,87,58,138,81,91,191,183,55,4,191,110,91,222,190,13,200,214,190,21,77,234,190,168,74,3,62,6,247,86,189,35,229,175,61,151,88,110,62,17,205,47,190,236,41,115,61,231,213,107,61,11,234,135,60,46,185,242,190,181,136,153,61,154,179,96,61,94,231,61,62,207,120,202,190,73,97,11,190,1,19,48,62,22,130,85,190,154,74,207,61,214,132,174,190,101,27,101,62,185,202,12,190,75,58,30,190,228,8,65,62,216,85,184,61,183,131,140,61,92,10,10,63,147,103,137,190,115,89,209,189,251,210,231,60,51,145,168,62,148,217,138,190,226,45,80,61,96,132,94,60,50,86,1,62,28,252,97,62,88,144,64,188,198,88,183,62,39,27,7,60,160,73,144,62,145,32,92,188,243,28,49,62,166,97,155,189,154,250,107,62,2,7,234,61,170,181,55,61,69,43,245,190,25,126,187,188,179,160,159,61,137,171,230,61,169,215,112,189,214,150,208,189,96,39,155,62,190,16,239,186,84,54,192,191,144,179,78,62,137,31,139,188,76,226,194,188,250,45,143,190,218,255,163,61,101,102,134,60,215,116,180,189,242,206,119,189,147,86,7,63,38,169,104,62,209,208,249,190,254,19,95,190,137,253,186,61,75,59,117,189,215,214,245,189,112,42,31,62,159,125,226,61,67,189,85,190,77,201,11,63,25,185,81,61,139,18,172,188,186,204,146,61,134,150,50,56,17,156,131,190,157,221,90,191,28,232,216,61,109,115,140,191,125,161,241,187,217,115,139,61,122,204,229,189,111,113,138,62,225,242,0,62,6,28,52,58,27,138,28,190,166,104,59,190,243,85,44,191,61,71,107,190,229,150,54,190,123,114,251,61,101,180,27,190,158,85,201,190,27,249,169,190,178,158,14,62,37,78,10,61,83,42,26,62,155,58,225,61,180,75,42,189,17,66,47,189,123,102,59,190,128,13,141,61,102,233,167,189,34,29,204,189,42,246,30,190,245,8,163,60,4,11,14,61,71,108,125,62,118,221,151,61,218,71,153,61,131,94,174,190,85,111,26,61,221,65,4,191,56,210,74,62,217,162,100,191,77,4,9,59,197,164,30,191,16,226,74,63,91,125,179,61,166,207,67,61,10,241,94,190,55,65,85,190,90,128,126,190,65,68,93,190,1,85,147,190,207,209,189,61,70,135,76,190,52,233,189,189,168,231,211,190,61,234,151,61,4,25,3,190,72,139,119,60,206,24,251,62,104,252,129,62,189,144,147,62,239,55,127,62,208,153,152,61,245,238,221,61,46,101,105,62,14,192,7,63,151,162,115,61,178,43,13,191,145,137,82,190,152,62,156,189,81,120,71,62,79,42,195,61,28,254,61,189,97,207,32,190,100,78,73,190,143,82,197,61,77,246,143,190,72,194,10,190,31,202,182,189,239,226,5,190,169,9,30,190,234,180,195,189,55,126,69,190,205,3,220,60,22,112,46,190,180,3,75,62,250,136,210,61,120,79,70,190,244,227,188,189,55,190,247,188,151,20,148,188,132,148,233,62,17,249,186,61,184,180,97,61,36,54,251,60,50,93,105,61,220,193,245,189,33,110,168,190,7,106,23,189,234,161,95,62,163,109,174,187,33,82,191,190,135,169,163,61,163,255,137,61,120,77,106,62,156,16,49,189,104,123,78,61,156,72,93,190,237,176,6,62,131,250,137,190,120,185,173,61,153,52,135,190,170,149,97,62,147,146,7,190,158,122,251,190,4,169,5,62,159,227,104,63,252,2,230,60,114,164,87,190,108,193,176,62,27,237,131,62,202,212,31,62,58,250,1,190,108,130,3,62,73,104,207,190,142,147,31,60,75,221,235,190,233,174,61,61,17,116,205,189,155,216,97,62,94,23,57,60,39,132,26,62,51,1,221,61,94,56,244,60,6,112,128,190,95,160,177,62,196,171,177,189,94,132,212,58,13,195,63,189,67,228,166,62,124,170,83,190,234,147,163,62,198,168,110,60,44,74,18,62,200,203,112,190,1,122,235,190,45,214,173,60,155,254,139,190,78,128,254,190,227,131,84,190,49,30,91,190,202,231,114,189,16,21,223,190,215,120,51,190,96,236,71,61,15,176,133,62,170,91,229,61,0,179,149,189,175,30,173,187,211,216,247,189,187,225,155,189,195,161,170,188,158,232,3,63,229,165,187,61,29,75,241,189,33,186,108,189,0,183,42,191,170,36,120,61,228,231,238,61,155,128,163,61,112,242,201,189,99,179,126,190,241,173,62,190,131,195,3,62,129,0,54,190,97,243,172,61,99,234,5,188,141,115,242,190,119,0,20,62,92,78,240,62,194,185,203,188,79,225,230,62,37,19,65,62,235,119,15,190,109,154,10,190,197,25,98,190,18,120,39,190,162,31,4,190,53,244,145,190,138,240,15,189,219,247,39,61,234,169,140,191,105,106,252,61,4,244,241,189,100,38,9,62,163,110,25,191,142,211,128,60,29,137,18,62,26,188,100,60,60,53,252,189,93,114,178,189,128,92,128,190,76,161,211,61,251,138,151,62,236,215,243,187,241,0,90,62,3,132,36,188,174,49,215,190,250,225,244,61,181,11,134,188,180,102,212,188,235,118,240,189,66,147,14,191,250,181,168,189,158,14,131,189,175,223,199,188,251,147,75,190,77,37,226,61,94,20,170,189,228,61,4,189,3,133,182,189,213,46,47,62,130,120,184,190,210,203,37,62,240,35,243,61,189,35,206,61,165,34,244,189,191,62,219,61,95,67,231,61,115,154,246,61,26,199,153,61,121,29,31,191,129,109,85,61,220,60,194,190,81,163,109,190,153,240,73,188,125,210,21,62,76,231,165,190,178,171,84,62,242,176,59,190,181,150,168,190,81,95,21,62,21,185,130,62,55,183,39,62,108,253,155,61,149,209,233,189,164,84,203,188,25,219,170,61,222,103,38,61,109,2,1,61,200,136,150,190,34,30,127,190,156,2,129,190,95,82,177,59,14,162,222,189,123,203,176,190,150,162,232,190,195,225,149,190,11,147,17,62,137,241,128,190,129,19,251,189,78,57,3,190,17,104,62,61,109,193,236,188,156,89,33,190,248,13,81,190,133,176,129,61,62,187,144,189,193,211,45,189,239,159,37,61,32,65,4,191,189,197,46,189,136,44,227,184,93,54,25,61,173,71,44,63,122,218,140,190,237,239,206,190,231,155,72,61,145,121,194,60,9,248,203,189,70,221,88,59,238,87,27,189,211,169,23,190,60,65,119,188,184,117,163,190,67,126,246,62,99,56,70,189,143,10,35,188,122,153,10,190,234,214,99,61,219,198,39,189,247,76,22,60,202,204,55,188,62,82,239,189,132,35,176,190,110,78,183,62,234,220,209,62,195,224,8,190,237,245,255,189,77,147,178,190,31,84,63,190,93,149,40,190,242,213,116,62,23,13,107,61,203,177,9,190,53,216,158,61,77,131,208,190,222,179,116,190,163,211,125,190,251,99,36,189,226,23,3,190,197,89,20,62,125,79,170,190,33,60,27,190,15,211,121,60,48,214,73,190,0,13,162,62,244,88,115,189,247,253,58,190,250,140,204,62,194,47,57,191,215,86,230,187,237,32,201,62,4,125,148,61,173,4,128,61,254,201,247,190,16,60,132,189,246,137,181,62,49,202,156,188,210,111,254,61,24,55,201,61,70,84,186,60,135,9,10,62,112,158,57,191,245,84,132,189,196,71,232,61,18,64,142,60,198,69,54,190,28,74,62,62,30,128,154,61,93,217,42,190,222,49,157,58,152,53,118,190,35,108,40,191,49,232,208,189,169,193,157,62,29,59,181,189,252,3,247,61,150,227,154,62,231,189,139,188,237,45,204,62,169,169,153,61,11,241,140,62,21,50,228,62,185,207,34,62,255,44,187,189,117,127,36,190,151,233,128,62,108,241,154,62,141,200,77,190,191,93,194,62,47,246,197,62,235,195,218,188,7,45,215,189,121,56,252,61,42,130,7,190,237,171,5,62,166,239,101,62,140,225,178,189,60,142,176,188,205,241,131,191,91,7,156,189,161,142,30,63,4,116,2,187,183,217,147,190,154,52,196,61,149,199,5,191,174,26,253,190,2,84,119,189,241,237,59,62,88,14,2,62,100,176,84,189,110,126,199,189,130,224,28,62,10,151,149,189,17,251,153,190,130,252,193,59,93,159,65,189,93,199,234,62,146,97,214,61,139,165,237,61,250,32,162,62,141,5,118,61,16,192,135,190,253,75,143,190,136,214,147,190,198,208,86,60,153,151,145,190,75,5,48,62,193,175,159,60,146,147,128,190,34,74,123,61,224,154,237,189,142,111,252,190,193,238,197,60,207,142,81,61,79,144,184,190,121,202,72,190,95,213,68,186,165,20,0,190,20,38,166,189,222,242,255,188,25,17,205,187,96,105,141,61,50,139,162,189,37,130,58,62,184,41,159,61,124,151,37,62,250,153,242,60,178,149,138,59,181,236,128,189,26,179,93,189,47,72,53,62,201,154,117,190,69,221,247,60,223,223,128,62,106,236,33,190,89,32,81,190,202,83,160,190,171,175,46,62,103,161,218,190,218,188,34,62,170,157,21,63,164,229,150,62,83,92,22,62,127,138,59,62,231,223,38,62,118,27,82,190,148,44,254,61,13,106,178,190,84,89,142,190,247,193,112,190,102,182,229,61,177,3,157,62,8,220,200,190,245,201,69,62,21,209,79,190,190,142,141,190,205,55,147,190,245,31,176,190,204,41,191,61,66,112,143,61,26,246,240,190,171,17,54,190,58,29,156,189,133,19,31,63,255,141,48,62,245,24,62,58,228,163,87,63,201,198,190,62,215,244,4,63,96,8,190,62,30,12,27,63,174,8,16,63,207,133,248,190,210,27,2,61,76,247,24,63,231,20,181,61,144,211,212,190,89,101,147,190,153,10,51,63,74,23,232,190,48,51,195,189,54,205,23,191,191,179,133,190,228,213,178,188,142,178,191,191,174,5,203,62,6,110,177,190,227,147,50,190,164,113,120,190,119,106,255,190,27,98,220,189,114,94,46,190,210,229,193,59,248,60,190,189,242,165,10,190,8,142,104,191,56,161,85,63,99,187,58,60,72,139,118,189,246,107,26,62,24,146,46,191,172,148,162,191,158,6,129,189,248,203,216,60,68,42,211,191,226,100,188,187,122,41,150,60,249,27,43,62,177,85,237,189,172,250,74,191,51,104,22,190,87,48,228,62,117,77,59,188,207,41,95,61,118,222,35,63,227,52,179,190,100,219,27,191,154,158,171,61,236,39,233,61,153,13,218,61,89,154,212,62,97,241,170,190,94,176,189,190,139,167,185,190,177,223,208,190,235,165,10,62,210,253,47,190,216,25,11,192,64,143,20,62,160,33,176,189,0,143,132,62,107,222,99,190,93,234,166,60,103,230,209,190,156,92,41,61,131,245,220,61,231,163,185,62,4,56,177,189,43,0,139,191,255,142,98,62,76,215,42,190,102,246,64,62,125,169,102,191,13,42,223,61,73,251,164,62,25,113,254,190,137,92,39,62,175,249,161,60,52,96,24,191,78,148,148,189,128,228,149,62,66,219,67,190,1,57,123,190,38,186,230,189,123,35,25,191,193,37,45,63,68,56,144,62,108,31,75,61,202,36,40,62,79,25,148,191,232,16,173,61,196,68,174,190,247,10,7,190,128,13,131,190,35,141,180,191,119,184,203,61,34,32,63,190,142,209,88,191,30,92,63,191,78,62,210,190,214,152,68,190,48,87,83,63,12,209,39,189,246,137,3,192,171,43,69,191,157,217,194,189,133,201,172,189,225,186,33,62,245,213,89,62,151,147,2,63,72,106,14,191,17,197,225,189,177,199,250,191,63,40,16,62,142,247,20,189,221,98,169,188,8,57,224,55,68,219,161,61,180,179,36,188,119,14,53,191,118,203,236,61,68,189,32,190,90,14,26,63,21,101,82,187,186,151,231,188,95,104,199,61,163,104,204,190,151,169,67,62,240,21,179,61,212,47,85,62,189,84,195,190,196,141,192,187,105,180,153,190,183,170,5,63,247,210,67,62,192,1,37,189,183,185,24,190,157,184,33,188,165,6,41,63,57,151,51,191,232,58,97,62,114,86,51,190,148,73,24,62,234,34,212,190,68,13,10,63,132,122,78,61,249,225,180,190,57,65,98,190,231,169,224,191,105,239,219,190,37,69,56,191,215,219,206,189,151,44,146,190,216,12,251,191,185,27,193,62,20,55,124,190,197,118,126,62,75,121,130,63,122,254,147,190,155,81,192,190,31,49,210,62,96,249,80,191,8,18,66,190,85,55,141,190,16,44,35,62,206,239,232,189,188,144,3,62,30,140,118,189,77,34,191,191,93,70,139,191,101,14,71,191,254,188,16,61,193,94,26,190,74,149,143,61,76,214,137,62,67,76,131,62,181,205,31,63,174,129,249,61,4,110,175,190,7,172,45,191,123,171,191,62,17,109,175,190,156,66,85,63,97,202,16,62,97,231,95,62,130,232,170,188,65,147,226,190,7,182,32,190,0,81,107,61,86,204,43,190,182,159,243,189,145,200,139,62,217,218,169,190,39,18,69,62,31,143,163,60,38,203,185,190,135,35,21,62,151,40,181,62,143,158,167,190,46,162,59,63,99,178,153,62,157,131,12,191,120,19,22,62,14,27,183,190,211,225,187,190,16,130,162,62,27,88,167,61,175,71,4,192,165,51,69,189,144,210,207,189,126,66,213,190,12,232,154,190,8,10,21,191,185,227,24,62,58,161,146,59,176,224,214,188,179,38,41,188,8,145,141,190,5,142,196,190,179,113,20,190,203,76,255,61,45,73,181,189,65,120,186,61,196,140,134,62,67,247,244,185,196,147,7,62,172,226,68,62,254,31,40,191,80,177,204,62,197,0,38,191,83,177,180,62,181,208,139,190,135,206,249,190,226,110,15,192,91,194,40,191,5,178,131,62,106,27,188,59,168,46,19,62,39,232,62,191,104,109,159,190,7,65,191,190,193,74,78,190,61,93,251,190,98,148,13,62,112,64,69,63,249,14,205,62,222,78,144,190,86,19,234,62,33,49,15,189,88,195,225,189,119,25,67,190,82,149,38,63,95,76,130,62,162,28,163,191,135,175,166,190,176,87,34,191,155,6,235,190,118,16,243,190,200,101,67,62,77,239,16,190,96,132,38,63,30,223,9,190,127,253,114,191,85,194,103,190,21,23,133,188,136,60,138,62,8,15,212,61,143,31,160,191,236,193,62,61,185,134,216,189,209,183,7,63,18,135,18,63,220,186,164,190,82,41,173,189,78,107,242,62,80,76,134,62,20,253,203,189,120,115,42,62,241,100,240,190,187,153,88,62,184,74,7,62,123,104,229,189,77,168,22,62,113,72,37,62,138,203,129,190,24,78,39,62,161,85,54,190,25,63,60,189,251,87,18,189,20,36,76,190,191,106,255,190,92,192,21,63,14,79,149,191,51,27,10,63,121,80,43,190,125,83,16,191,9,215,167,189,3,6,58,191,0,117,130,62,51,184,144,188,211,236,157,62,206,39,230,191,118,255,156,191,220,47,151,61,233,208,181,62,234,98,42,191,212,227,174,189,133,155,41,191,178,168,53,63,47,185,249,190,104,190,14,63,12,7,234,190,1,50,212,61,104,201,137,190,144,31,56,62,75,190,173,190,43,48,88,190,99,196,155,62,222,237,228,189,206,250,221,189,195,27,162,61,180,122,29,63,62,227,229,187,67,44,6,190,8,245,0,191,57,247,142,188,53,8,240,62,7,0,57,61,158,4,131,62,243,2,199,190,87,83,183,61,60,8,162,61,54,72,69,62,2,156,237,60,202,213,249,190,25,194,238,62,46,204,82,189,139,90,255,61,190,33,200,190,92,219,181,189,160,108,85,63,110,135,89,190,250,85,51,62,207,220,184,61,74,171,226,62,227,64,86,189,15,218,178,62,170,213,8,191,237,253,173,61,108,236,195,190,217,122,222,61,8,183,34,190,91,199,8,62,216,128,120,191,245,229,45,189,221,200,179,191,212,92,212,62,190,71,90,186,170,42,213,190,95,18,52,190,101,242,38,62,91,48,246,61,196,13,129,191,228,121,1,62,75,243,131,191,3,15,231,190,68,22,211,62,10,174,144,190,44,25,170,190,239,233,173,189,89,149,131,190,190,251,38,191,64,152,72,190,192,124,227,191,13,142,45,191,216,202,36,190,68,10,170,61,175,210,183,191,34,27,153,62,47,83,232,62,117,69,76,190,255,92,226,61,70,87,125,62,130,232,47,61,185,89,106,61,45,60,195,62,45,61,44,63,196,157,197,62,108,154,143,188,83,113,111,61,166,44,226,62,85,72,105,189,168,125,160,190,72,237,131,191,157,69,159,59,73,43,21,190,251,42,80,62,57,171,134,190,147,90,145,190,60,93,160,190,251,158,198,61,233,92,38,61,43,235,233,189,2,62,3,63,63,49,21,191,109,228,210,61,228,187,34,63,228,246,48,62,209,95,75,191,6,55,136,190,87,70,4,191,237,185,72,62,174,214,21,61,116,42,177,190,222,217,102,190,192,174,165,190,18,80,52,190,72,104,130,191,126,249,58,190,104,107,223,61,185,133,194,61,14,174,142,190,156,116,112,190,240,31,143,191,162,166,32,191,245,23,62,191,43,158,157,62,220,45,194,190,237,245,45,190,21,131,193,189,68,67,18,62,229,14,138,62,212,202,136,62,78,242,164,62,55,142,143,190,20,198,171,62,153,25,108,61,38,243,0,188,222,143,234,190,236,32,24,62,15,132,145,189,208,9,199,190,55,12,83,61,149,50,208,190,78,224,54,62,108,248,2,61,87,79,18,63,148,235,207,61,29,230,10,190,135,166,241,61,93,195,246,61,36,149,40,63,239,242,129,62,82,33,88,188,194,245,172,62,39,35,49,63,64,0,85,189,43,254,93,190,48,209,136,62,188,19,16,191,223,166,179,189,1,17,65,191,244,192,119,61,83,12,38,62,40,192,164,189,38,101,246,190,8,101,242,60,240,191,47,190,174,41,206,61,28,47,13,62,107,49,93,189,236,100,156,61,58,97,232,60,55,85,30,191,88,130,28,192,220,182,177,61,68,205,67,61,250,164,69,189,17,44,42,61,176,23,232,190,72,62,28,190,96,34,222,61,156,173,252,61,106,177,98,189,7,105,38,191,233,224,122,189,235,57,71,62,179,183,170,190,98,4,1,191,64,39,0,63,130,62,59,191,99,126,152,61,20,177,132,62,24,249,202,62,253,249,149,59,80,223,235,62,88,83,15,61,231,62,150,62,173,249,228,62,227,12,83,61,104,155,112,191,154,222,38,192,174,111,60,191,46,107,224,62,233,250,161,61,232,197,53,62,214,12,33,190,100,18,10,63,138,95,158,62,156,4,203,62,12,190,130,190,250,15,62,62,203,97,6,191,141,172,23,63,249,179,147,189,127,37,199,190,102,3,5,63,7,189,35,62,145,214,226,62,147,207,247,61,39,216,14,191,198,129,230,187,92,107,9,191,246,64,168,62,175,171,208,61,243,191,30,189,154,70,163,62,188,18,187,61,105,147,114,189,129,139,141,189,11,12,65,190,223,76,123,191,229,155,184,188,31,12,155,190,139,129,147,62,74,220,139,191,213,134,192,190,96,69,131,189,94,243,58,63,156,146,41,190,39,159,35,62,221,173,57,62,12,250,15,191,221,158,10,191,157,14,4,190,41,190,105,62,21,187,66,59,182,33,22,192,83,47,20,191,36,179,90,191,38,243,161,189,142,168,34,61,238,162,53,62,204,169,95,190,84,178,16,191,175,55,217,187,146,138,107,191,25,219,50,63,200,171,134,190,181,102,76,61,45,255,4,192,187,179,226,62,106,125,170,62,143,113,41,63,146,11,217,190,3,230,72,62,52,137,80,191,43,196,151,62,43,166,25,61,34,152,238,190,147,223,167,62,253,36,40,62,58,146,54,61,41,0,253,191,122,132,201,190,77,49,176,190,175,19,233,61,134,204,7,191,31,132,9,62,179,126,78,190,59,194,57,191,7,110,143,62,161,108,23,192,97,57,134,62,252,253,237,62,78,22,188,190,129,51,163,189,87,185,144,62,87,11,104,189,35,203,12,190,69,185,7,62,221,151,155,190,91,7,227,190,76,254,238,188,14,84,26,191,55,0,33,191,225,66,227,61,210,8,184,190,113,171,53,191,74,59,1,62,112,174,37,62,216,175,6,190,15,42,206,190,7,231,91,190,67,224,148,61,129,148,8,63,217,37,210,62,185,117,207,61,146,212,26,189,213,38,39,191,122,249,3,62,110,44,198,62,11,19,12,191,72,223,241,62,98,191,198,61,110,101,48,191,217,156,34,190,231,252,216,189,204,160,57,63,170,118,205,61,46,104,69,189,22,173,185,190,147,73,136,191,226,77,94,187,130,130,38,190,133,38,99,190,99,76,153,190,245,171,109,62,176,9,118,187,120,2,233,61,189,95,180,60,131,50,251,186,117,233,7,62,18,181,53,191,173,206,154,190,119,72,98,61,215,180,13,190,102,243,142,62,115,110,115,190,29,202,5,62,88,173,184,60,230,215,209,190,34,40,174,62,185,208,41,190,38,231,62,189,200,77,194,62,131,134,11,190,217,172,13,190,219,254,179,189,121,244,246,62,60,71,13,190,72,141,168,190,127,120,97,62,176,248,249,189,155,250,205,190,194,243,54,190,204,116,254,190,164,183,133,62,183,89,158,187,7,108,132,191,163,189,130,189,135,194,157,189,73,89,77,62,233,237,136,190,25,70,34,190,45,182,162,191,245,137,90,189,68,90,29,188,172,162,5,190,218,63,24,191,142,210,74,191,7,34,181,190,214,12,94,190,30,183,136,191,160,175,44,63,125,156,6,62,200,4,171,62,240,118,10,190,114,91,94,188,90,133,116,191,112,50,3,63,82,82,163,62,215,85,73,63,95,201,144,62,135,1,147,189,242,227,197,56,190,94,54,190,36,209,18,62,114,30,118,190,205,191,44,62,251,120,140,190,65,226,105,62,87,74,110,189,0,179,22,190,5,16,148,190,83,150,118,62,207,121,4,61,238,173,190,62,146,84,15,62,54,244,114,61,4,199,56,189,51,178,81,61,64,20,57,191,115,97,28,192,122,166,84,61,117,203,86,61,2,174,53,189,166,50,117,191,65,243,213,62,201,241,85,62,52,70,255,190,183,175,140,62,137,118,66,62,163,128,158,189,18,237,140,190,255,200,182,191,248,22,150,188,149,99,157,62,65,170,184,190,58,205,64,62,232,194,176,189,195,61,26,191,237,100,127,190,164,99,40,62,128,235,33,191,249,63,89,62,34,168,192,61,1,3,236,188,157,123,93,190,19,105,191,189,215,248,42,62,158,126,178,190,201,192,182,188,49,195,28,190,134,226,163,188,144,67,35,190,169,12,163,61,48,129,7,62,215,111,78,191,25,216,74,190,119,191,157,62,251,165,11,191,192,57,69,61,71,229,187,190,202,126,1,191,243,156,85,191,60,182,33,63,146,100,143,61,78,185,126,191,59,107,234,190,181,82,198,190,87,207,175,62,62,66,42,189,101,169,21,190,230,214,176,191,64,241,1,190,46,252,57,63,177,72,140,191,233,229,37,191,116,85,178,191,92,25,10,63,254,142,0,192,33,195,228,62,227,163,197,190,94,102,0,192,218,202,193,191,24,255,4,63,56,162,2,192,17,24,5,192,29,213,37,189,83,104,106,62,4,206,165,189,195,229,75,190,132,210,247,62,4,94,198,191,141,186,29,63,252,98,12,63,87,64,23,191,129,205,200,62,138,253,112,190,94,225,169,191,91,16,146,188,232,211,114,190,164,98,24,63,218,242,106,62,108,153,246,62,230,162,225,191,232,226,144,62,199,40,91,62,124,237,53,61,213,165,233,62,86,225,139,62,37,192,22,63,111,94,128,191,61,217,6,192,65,23,70,191,16,77,181,189,228,96,24,63,149,120,232,62,148,1,5,191,238,70,218,61,93,6,237,62,135,29,143,62,163,229,55,63,38,171,6,63,250,128,173,190,238,179,74,62,86,113,144,190,199,87,49,188,25,115,194,191,48,179,101,63,145,31,230,62,82,106,8,62,220,22,17,192,110,106,43,190,63,146,140,62,114,236,117,191,88,0,254,62,235,147,162,190,242,17,93,191,82,90,11,63,63,88,236,62,52,63,167,191,214,68,10,192,229,138,170,62,138,210,19,191,190,61,76,62,10,255,221,62,125,149,57,63,235,22,199,191,72,156,233,191,174,239,1,190,251,162,60,191,23,30,170,62,68,192,241,60,214,207,208,189,193,40,135,190,9,237,64,62,124,15,184,191,191,66,14,62,29,18,110,62,88,16,105,62,2,209,2,63,249,95,89,63,217,6,214,189,130,115,38,62,103,41,120,62,71,243,72,63,240,35,209,191,181,221,143,191,194,237,141,62,254,139,224,191,155,64,137,62,230,144,12,192,3,57,233,190,77,13,168,190,167,147,176,62,23,58,237,190,76,238,160,189,24,247,67,62,50,136,25,63,39,207,29,62,55,112,133,191,204,59,75,62,121,76,14,192,204,239,121,189,23,4,237,62,179,234,120,63,13,243,220,191,19,198,19,63,7,6,80,191,10,152,184,191,235,235,5,63,77,84,53,62,51,24,113,191,248,182,18,190,137,86,161,191,20,137,20,63,140,101,179,62,30,62,144,62,87,154,191,191,140,212,158,191,60,79,198,190,184,66,9,191,245,167,176,190,6,92,192,62,10,151,163,61,152,150,158,190,19,208,186,62,236,201,113,190,74,28,30,63,47,133,247,62,172,20,13,60,181,144,217,191,210,215,101,62,141,17,238,62,56,107,67,62,125,62,238,62,231,101,190,191,94,41,2,191,32,113,25,63,72,39,186,190,26,216,88,191,126,1,106,62,153,11,255,62,126,165,241,62,43,120,135,60,183,192,247,191,108,49,19,63,189,223,163,190,0,130,51,191,78,143,30,61,32,213,164,190,74,255,60,62,38,199,183,62,71,93,45,63,29,210,130,191,255,25,249,190,17,131,119,191,165,81,10,63,84,69,144,63,65,78,176,191,51,51,191,191,248,10,197,190,168,149,138,62,36,226,18,63,234,52,255,61,45,239,197,61,149,24,63,63,189,190,140,190,186,19,191,191,36,189,16,63,246,119,26,62,56,24,252,190,202,89,98,189,5,94,82,63,30,131,243,60,247,193,248,190,157,37,54,63,208,23,220,191,5,59,90,61,232,141,93,62,62,30,132,191,139,209,66,62,154,86,239,191,148,82,142,61,249,199,165,189,97,252,33,63,158,150,142,60,182,87,174,62,119,109,55,62,144,98,233,62,93,238,3,63,68,243,51,190,70,246,176,62,246,155,9,192,240,208,21,62,66,142,85,63,172,165,39,191,2,26,171,62,108,204,163,191,121,113,234,62,31,183,155,190,199,253,95,191,107,105,123,62,43,112,192,61,58,145,239,189,214,57,53,189,146,168,184,62,51,194,238,62,127,28,177,62,109,62,116,190,44,70,120,190,222,126,132,191,232,231,209,62,21,127,8,63,35,11,72,61,149,104,200,62,83,46,42,61,121,185,189,58,65,248,57,62,76,139,249,62,254,224,52,62,16,214,236,189,241,14,149,62,105,31,142,62,252,87,59,63,203,8,149,62,45,15,205,189,161,40,235,62,243,33,52,62,68,154,24,191,89,6,208,61,253,40,159,62,68,156,164,61,150,40,250,191,64,36,241,190,212,188,0,63,233,107,19,62,102,38,33,190,228,141,211,60,160,119,215,62,188,139,229,62,87,139,63,61,104,204,225,190,183,74,51,192,234,245,15,191,97,207,151,191,196,193,4,191,10,215,164,61,247,129,54,63,174,125,146,190,35,50,150,191,60,153,12,62,252,89,148,190,90,195,9,63,108,200,177,191,148,79,210,62,116,210,109,189,247,28,15,188,175,120,133,62,66,120,13,63,46,187,205,191,101,211,252,62,76,236,151,62,179,41,22,63,86,53,194,190,38,76,90,187,91,170,244,62,180,207,255,188,248,40,47,63,19,3,235,61,46,175,16,62,84,221,27,63,20,213,109,191,103,12,169,191,118,136,153,62,124,153,208,189,111,233,36,63,105,19,182,191,10,140,158,190,216,186,37,190,227,31,16,63,7,51,219,191,82,69,135,190,192,41,74,190,236,15,104,61,163,23,146,62,182,242,49,191,87,71,13,63,20,73,132,61,245,17,219,61,15,129,244,62,224,12,141,190,79,114,28,62,136,103,29,190,171,80,201,62,171,118,196,61,53,143,60,62,166,55,160,190,28,131,168,191,147,192,181,61,243,84,23,61,58,150,152,189,137,24,15,191,231,76,36,63,56,237,134,63,83,116,172,61,187,139,236,191,126,72,236,191,247,13,134,61,169,59,57,62,23,209,236,61,86,58,76,63,224,9,197,62,182,165,110,191,63,233,9,63,135,45,18,63,144,185,135,62,92,29,3,63,154,17,188,62,94,163,217,62,2,66,209,189,249,148,110,190,203,249,224,191,42,111,216,190,188,118,63,63,145,189,80,61,95,39,29,63,38,163,192,62,153,19,119,191,18,139,59,189,128,14,36,63,221,209,133,191,36,157,230,191,162,231,8,62,2,189,119,190,186,64,67,191,56,232,146,62,25,249,145,191,139,176,142,62,221,131,240,62,149,174,212,190,167,252,197,190,55,184,244,62,226,255,200,62,63,71,161,189,240,35,141,190,16,237,226,189,248,250,175,62,179,110,99,191,87,130,173,62,172,96,20,192,196,127,166,61,123,73,7,191,14,243,61,191,4,255,118,191,94,148,156,62,197,130,53,63,30,174,193,60,31,245,178,61,255,117,136,188,141,172,132,191,137,71,252,62,205,41,238,191,174,81,59,190,40,131,130,62,201,3,170,62,26,45,9,191,125,169,1,63,199,185,201,191,3,36,146,189,114,20,119,62,18,213,242,191,223,209,18,190,136,61,3,61,107,168,17,63,69,189,188,62,110,237,228,62,149,243,115,188,117,176,50,62,201,131,108,191,101,155,22,62,29,148,32,63,238,218,169,62,63,138,190,60,97,176,76,190,196,25,180,191,210,92,212,61,75,238,189,62,230,234,4,192,54,23,100,62,181,195,38,62,85,180,216,62,204,204,250,62,180,169,55,63,239,23,184,190,27,142,77,191,240,212,246,61,205,210,127,62,239,22,37,62,201,214,145,62,161,68,3,63,200,79,17,63,247,16,16,192,124,251,121,188,156,73,210,62,193,13,141,190,76,144,62,63,77,5,143,62,17,230,205,190,110,105,171,59,103,126,56,63,84,69,213,62,42,178,54,63,3,202,249,62,19,244,131,191,159,52,6,191,202,243,99,191,189,168,13,62,106,127,128,62,131,55,169,191,211,126,5,189,144,254,121,191,164,36,47,192,76,60,190,189,251,249,102,190,16,111,247,188,41,127,96,190,19,26,88,63,122,217,15,192,74,196,37,191,14,254,192,191,211,87,158,62,204,240,143,191,153,76,123,191,92,53,138,61,106,170,136,61,6,164,171,190,8,238,181,62,141,174,94,189,93,146,242,61,231,151,48,63,237,0,197,190,214,55,177,62,232,217,220,188,209,182,102,191,1,11,210,191,225,169,30,191,8,188,220,191,46,124,224,191,73,147,185,62,101,73,134,61,174,176,45,191,104,155,23,63,118,212,181,59,248,11,7,191,67,144,158,62,139,107,30,63,240,26,150,191,49,22,109,62,174,254,118,190,201,120,59,63,207,229,2,192,252,230,81,188,41,173,59,62,191,186,90,187,90,61,78,187,10,96,235,62,97,134,80,63,219,201,139,191,54,238,225,191,169,235,110,189,129,150,135,190,132,58,26,63,145,198,6,63,91,165,243,61,217,187,149,62,195,251,147,62,135,211,20,190,122,113,13,62,25,168,41,191,87,198,186,62,214,47,80,190,78,134,197,62,104,115,61,62,237,228,235,62,230,218,145,191,205,187,97,189,240,170,132,62,137,12,133,62,21,227,93,63,152,81,61,63,52,56,44,189,193,157,140,62,70,211,163,62,23,182,229,62,20,184,161,187,91,206,154,191,77,86,214,62,51,80,46,187,40,33,141,62,35,164,37,191,205,17,163,62,142,9,46,63,177,189,182,62,202,124,0,63,135,97,3,63,199,55,11,192,221,3,214,62,197,70,12,61,147,0,153,191,141,66,84,190,49,193,140,191,131,191,21,62,86,22,171,62,47,187,169,60,170,116,104,61,227,0,50,63,113,16,202,62,37,147,205,191,246,70,69,191,76,216,46,63,231,139,23,63,161,230,27,191,19,18,190,61,69,212,36,63,49,133,60,62,195,61,181,191,56,216,49,191,205,156,198,191,206,231,30,62,50,39,117,62,26,67,100,189,153,115,155,191,53,118,110,190,41,219,123,62,74,20,128,62,160,221,161,62,149,199,33,191,60,149,191,62,164,57,193,62,206,186,102,191,127,202,235,191,165,183,202,190,187,210,205,191,132,229,207,62,125,113,119,190,123,207,114,62,84,143,255,62,118,89,80,191,56,101,166,191,56,17,18,62,36,229,213,191,126,14,146,62,45,241,106,191,253,62,16,62,28,116,1,191,25,23,44,188,104,185,102,62,9,89,198,62,178,213,74,191,182,92,157,191,93,198,206,62,157,255,88,189,41,97,60,63,113,89,98,191,23,223,45,62,162,159,65,62,129,43,189,191,108,3,149,191,182,254,112,190,66,161,208,191,130,150,131,191,197,193,92,191,102,100,8,63,152,80,118,191,200,70,158,191,211,11,196,62,223,30,193,62,154,232,241,191,99,205,185,63,179,218,158,191,69,74,208,188,107,193,235,62,103,13,178,191,156,138,227,62,194,201,196,189,119,164,207,62,105,249,2,63,25,214,194,62,247,123,139,62,102,196,10,63,72,38,39,63,74,113,219,62,132,236,152,62,32,63,76,62,105,85,10,190,178,235,53,62,144,1,154,190,21,112,2,192,208,192,185,62,46,211,18,189,59,178,194,62,202,240,118,191,121,64,154,191,22,164,5,63,149,31,238,62,65,208,180,62,249,216,54,61,186,132,184,191,178,44,197,62,245,149,42,62,79,47,136,191,121,237,47,62,129,29,1,62,223,24,22,63,177,20,4,189,15,61,168,62,36,4,197,191,156,125,53,63,21,69,10,192,162,92,189,62,243,89,172,191,207,9,77,190,30,150,171,62,183,89,12,190,202,107,42,63,158,82,185,191,181,96,14,63,98,129,100,191,34,225,27,191,7,89,224,191,72,129,195,62,160,91,66,191,224,13,21,63,93,39,253,190,236,172,101,191,109,48,221,61,124,207,57,190,213,135,137,62,57,228,250,190,81,216,199,191,197,220,217,62,75,59,180,190,245,104,42,62,151,55,188,61,28,247,153,191,82,196,167,62,70,247,203,191,139,126,29,191,30,252,134,191,123,149,243,62,184,5,114,191,169,234,155,62,112,60,224,189,72,114,254,62,2,38,134,191,248,251,107,61,117,25,228,191,78,27,186,62,61,71,157,60,166,21,26,191,70,171,36,191,35,190,211,191,109,251,145,187,88,87,212,190,31,212,123,191,9,148,142,191,83,182,199,62,206,116,178,191,14,241,202,189,233,206,28,191,69,92,234,62,187,49,127,63,182,237,151,62,136,28,207,61,33,114,10,63,14,73,86,190,88,142,133,62,134,217,61,63,155,104,21,61,113,130,64,190,107,248,31,63,171,28,134,191,240,188,27,188,22,13,170,62,18,46,230,61,111,140,93,62,146,55,130,191,61,146,211,190,249,109,26,63,66,168,6,190,52,142,146,61,48,229,85,62,102,93,59,62,40,123,218,62,96,213,60,62,154,130,42,62,252,235,128,190,32,202,16,62,182,95,64,62,149,39,146,62,13,5,251,61,228,80,169,62,69,47,38,63,153,232,69,191,192,199,8,63,135,171,186,61,173,89,246,191,96,96,159,62,242,27,225,190,188,120,26,63,62,92,192,62,17,55,136,62,90,9,51,63,101,242,248,191,140,183,102,190,116,156,114,190,78,43,169,189,199,137,25,63,37,200,25,191,145,177,91,191,117,32,166,190,116,87,169,61,241,160,152,189,57,246,94,61,12,251,85,63,247,58,129,189,132,253,201,61,170,16,12,63,134,240,88,62,201,106,156,60,0,98,1,63,146,14,135,62,200,198,137,189,17,183,16,63,6,248,68,63,42,136,155,191,119,91,77,61,200,99,50,189,178,66,167,62,145,222,44,62,167,99,33,62,214,199,196,190,116,34,215,62,173,243,179,191,123,111,30,191,30,47,80,191,151,197,95,61,117,153,85,62,223,159,165,62,227,220,12,191,47,27,191,62,151,157,215,191,181,23,138,189,109,170,168,190,238,143,35,63,204,11,122,190,134,79,178,191,8,242,106,62,236,150,175,61,85,163,229,191,24,39,226,189,232,113,3,63,78,41,145,191,213,158,58,62,17,204,154,62,183,87,197,190,229,175,14,63,118,80,22,62,100,5,186,189,214,177,15,63,69,20,2,191,76,203,27,192,207,125,229,191,148,109,95,63,147,174,143,191,211,131,156,191,205,102,250,191,15,154,239,191,80,26,22,189,240,125,226,191,93,120,126,190,18,234,73,62,3,55,193,62,98,187,185,190,224,213,22,62,173,68,14,62,0,46,172,185,188,149,13,62,137,185,0,192,239,234,204,61,253,157,137,62,75,92,46,62,60,245,136,63,253,239,88,62,170,42,138,61,210,113,79,63,234,33,233,62,111,164,121,62,75,65,31,63,251,206,54,62,177,39,147,189,190,131,8,190,201,56,27,61,157,168,54,62,5,70,156,62,240,26,206,61,65,42,133,62,209,171,151,191,166,228,98,191,159,35,158,191,128,50,154,187,17,211,149,190,2,255,166,190,111,212,149,62,5,9,9,63,163,105,208,191,96,235,163,62,177,44,176,62,188,171,44,63,62,170,63,62,57,240,141,62,197,53,175,62,13,215,204,191,213,244,22,62,233,218,71,63,176,235,163,191,183,7,161,190,2,192,68,63,10,96,158,191,223,182,129,62,154,90,210,62,245,65,197,191,220,166,136,59,173,23,130,63,53,157,221,191,60,109,33,63,219,201,61,62,201,189,152,60,28,150,111,191,202,194,108,62,186,47,1,190,85,205,51,191,119,161,56,189,236,166,71,63,57,168,254,61,105,207,108,188,78,48,115,191,218,189,201,189,6,133,181,191,239,38,3,63,204,232,135,189,85,46,14,190,159,104,167,191,124,62,11,63,148,224,21,63,8,137,254,61,7,71,32,190,122,184,8,63,252,136,52,63,188,193,108,60,71,192,174,62,145,33,81,62,132,198,146,188,133,196,85,63,101,40,181,190,222,70,20,62,59,222,217,62,247,132,104,191,174,253,184,62,164,2,2,63,42,7,149,61,53,1,212,191,58,103,7,192,99,136,9,63,23,221,212,189,247,106,179,61,125,27,24,63,249,237,199,62,136,214,196,190,12,128,98,63,200,78,138,190,102,0,16,63,254,104,117,191,243,32,47,190,190,95,32,63,118,56,8,63,153,9,202,190,212,35,194,62,133,19,97,189,182,146,32,63,69,86,8,191,187,43,141,191,29,184,122,191,245,84,40,62,45,198,52,62,33,235,201,189,178,41,243,191,135,47,108,62,18,96,240,61,18,60,34,63,177,102,120,191,106,215,111,62,18,52,236,190,91,105,116,62,9,228,23,191,148,124,110,189,77,244,36,63,135,148,26,63,84,75,33,190,173,121,48,191,100,19,136,191,230,151,189,191,74,185,75,63,33,108,4,192,0,79,6,63,53,160,176,62,243,52,80,63,74,8,133,191,68,226,230,62,0,159,249,62,232,237,220,191,106,242,131,190,4,77,112,191,233,249,249,62,186,137,236,187,77,205,158,191,202,244,4,63,120,234,86,191,83,150,151,62,150,194,134,62,77,129,10,191,29,134,14,63,201,202,112,191,113,11,252,191,222,73,153,62,107,81,33,63,237,75,251,190,46,245,188,62,44,229,31,190,25,91,162,62,159,146,237,191,181,45,64,190,37,140,19,62,192,66,67,191,8,143,237,62,232,13,184,60,137,137,158,62,244,118,68,63,79,96,63,62,48,84,196,190,43,171,181,60,101,87,181,60,237,246,241,189,201,220,254,62,78,23,132,191,158,170,186,62,11,58,55,63,245,146,94,61,11,97,168,62,47,98,177,62,159,224,139,190,254,129,105,62,235,109,189,190,248,18,230,191,78,125,180,190,233,215,248,60,73,143,61,61,69,112,242,191,84,120,84,191,5,135,149,62,99,57,66,63,160,150,190,191,20,57,11,63,53,186,213,191,187,143,148,191,196,3,39,63,139,40,229,190,30,57,185,189,84,145,43,191,160,41,223,191,39,8,181,191,99,77,209,60,216,139,53,62,157,151,166,190,240,24,139,61,126,19,149,62,202,252,10,62,162,210,229,61,179,224,36,61,147,87,84,62,82,253,112,191,89,206,109,191,228,77,165,62,90,249,16,63,254,21,59,191,82,147,7,62,125,230,20,63,162,235,77,63,113,218,17,62,163,108,98,62,206,187,111,189,24,24,0,192,194,22,28,61,194,6,8,62,232,129,131,62,147,175,196,61,20,244,107,191,111,153,17,63,36,234,176,62,89,230,222,62,132,47,2,192,243,138,162,62,237,35,173,62,9,149,175,190,38,227,113,191,161,183,81,189,252,210,62,62,224,171,186,62,93,247,11,189,182,8,12,62,58,5,56,190,175,156,45,190,35,240,4,62,193,199,28,62,6,239,2,62,208,150,35,192,131,90,10,190,200,193,92,62,160,19,139,61,155,117,99,62,220,198,188,62,22,74,213,190,160,41,133,190,120,119,163,191,165,35,22,189,194,52,73,62,107,139,93,62,134,243,168,62,121,203,86,189,59,38,96,190,59,24,157,62,37,151,18,63,52,186,234,188,111,36,16,62,127,59,177,190,5,138,220,60,46,92,180,61,78,13,171,61,215,246,156,60,115,186,86,62,218,51,223,188,77,151,86,62,37,190,187,190,116,164,107,61,151,42,197,190,141,118,219,62,69,207,20,191,34,33,180,60,240,110,43,62,48,113,158,191,18,209,25,191,49,12,160,189,119,106,58,62,237,250,209,189,161,207,230,190,140,43,43,191,0,45,124,62,161,87,128,62,17,186,55,63,193,132,100,62,2,92,130,190,188,252,151,62,165,144,154,62,27,78,33,62,60,150,220,61,187,195,67,191,161,170,54,190,122,110,254,189,22,185,98,62,120,186,251,61,228,169,168,186,197,238,247,189,12,0,127,189,23,228,222,189,104,63,174,185,119,31,216,62,60,169,5,189,196,188,70,191,133,4,173,58,201,74,58,62,203,108,4,62,241,193,105,190,46,35,231,190,16,222,85,189,246,212,40,63,91,180,125,62,174,146,8,190,230,93,42,58,207,111,155,190,192,81,142,60,131,49,137,189,9,88,168,190,23,90,249,190,12,26,80,62,230,224,26,190,237,86,233,189,130,187,85,190,210,143,191,189,238,10,27,62,184,145,134,188,84,118,109,190,208,105,87,191,93,166,36,62,165,12,166,191,176,117,242,61,156,57,182,62,77,244,138,190,134,189,134,191,118,34,168,62,27,19,73,63,194,31,138,190,198,58,160,61,153,205,141,189,94,228,4,192,124,90,127,61,36,8,74,61,35,49,3,62,38,18,134,61,6,126,205,188,140,230,134,62,98,234,7,63,139,157,101,60,59,62,68,191,101,230,213,60,149,13,162,62,75,23,124,190,231,29,111,191,176,192,131,191,75,51,203,61,168,207,21,55,49,165,26,190,234,202,254,190,237,232,21,62,78,164,133,60,228,70,164,190,142,120,133,191,115,32,234,190,144,55,210,190,151,247,171,62,173,222,225,61,169,114,55,62,54,6,104,62,209,178,254,190,147,212,64,62,194,230,50,190,20,158,131,62,189,220,158,188,60,206,170,61,179,253,186,190,120,116,47,63,42,21,230,189,164,255,186,61,170,110,179,189,246,174,8,191,188,28,177,61,19,19,116,189,160,165,206,190,74,169,251,189,62,113,26,190,121,216,74,60,20,251,94,61,4,200,101,190,138,61,90,62,132,198,113,191,45,237,99,62,9,120,87,62,152,