{"meta":{"epsilon":0.13506801426410675},"modelTopology":{"class_name":"Sequential","config":{"layers":[{"class_name":"Dense","config":{"activation":"relu","batch_input_shape":[null,28],"dtype":"float32","name":"dense","units":256,"use_bias":true}},{"class_name":"Dense","config":{"activation":"relu","dtype":"float32","name":"dense_1","units":64,"use_bias":true}},{"class_name":"Dense","config":{"activation":"linear","dtype":"float32","name":"dense_2","units":4,"use_bias":true}}],"name":"sequential"}},"weightData":[67,65,11,62,163,11,8,62,28,216,221,61,149,182,205,62,201,163,244,189,71,16,72,62,117,93,72,190,43,133,228,62,104,111,79,190,54,121,189,61,208,64,54,63,32,232,41,190,21,20,131,62,213,56,33,62,169,15,187,190,49,205,96,190,173,223,29,191,206,168,226,62,34,140,214,62,85,76,0,191,34,23,108,62,90,95,204,61,93,212,73,62,128,100,170,62,136,42,0,191,70,215,142,62,207,76,95,62,57,50,255,62,138,169,138,62,188,22,9,190,126,106,176,62,240,30,13,63,194,190,35,63,31,151,246,62,128,255,238,189,6,213,209,61,151,103,138,62,123,179,152,190,231,205,44,190,132,204,239,189,231,37,112,190,213,58,133,62,33,156,51,62,16,1,230,62,182,213,131,190,121,158,152,191,154,161,178,62,4,133,168,62,248,46,152,190,18,127,57,61,188,201,21,63,170,83,237,189,18,224,41,189,194,103,128,190,35,89,66,189,210,185,56,190,162,97,218,188,25,84,117,191,135,191,222,60,94,150,171,190,167,202,41,59,97,127,249,189,166,75,53,62,3,141,139,190,62,18,97,61,255,123,133,190,203,128,221,187,22,139,188,62,132,29,164,62,142,64,143,62,36,212,122,189,110,25,0,62,157,55,38,190,158,54,18,63,199,246,31,63,226,12,79,190,211,75,8,62,164,100,181,61,81,187,85,191,190,208,6,190,166,186,223,190,212,74,236,186,134,38,207,190,238,190,214,189,234,189,36,189,150,249,236,62,248,201,177,189,79,64,57,62,62,249,15,63,185,236,24,191,217,197,58,190,228,249,1,63,101,42,10,190,167,114,230,190,31,24,40,63,30,74,60,189,55,245,50,191,170,189,134,190,95,70,40,190,167,82,222,62,101,97,7,62,15,149,73,191,146,121,191,189,50,240,137,190,242,213,114,61,187,170,30,63,33,37,40,62,251,227,50,63,123,185,189,187,218,174,216,62,31,183,242,61,82,88,35,191,5,169,222,60,16,122,195,61,223,38,5,63,180,219,185,61,164,220,169,62,147,74,104,190,162,227,171,190,56,185,107,62,21,227,7,190,55,227,69,190,210,61,32,62,239,40,191,62,145,136,18,190,199,204,235,190,219,249,191,62,148,72,154,62,86,122,25,63,74,113,74,61,100,213,248,62,98,238,195,60,91,74,86,191,66,185,202,62,73,56,14,63,103,234,232,61,93,155,178,190,0,17,217,61,31,236,189,60,92,168,169,190,145,24,240,62,165,195,154,62,205,49,41,190,135,243,179,62,40,9,107,62,59,125,65,189,63,246,217,62,57,24,50,187,136,163,174,62,124,147,150,62,74,83,255,190,53,39,112,190,189,13,64,63,220,222,254,61,203,234,134,61,112,82,5,63,150,242,191,190,91,133,205,190,193,217,11,62,147,254,30,191,194,92,240,189,250,135,7,191,4,118,137,189,119,184,120,62,212,243,228,62,29,60,29,60,209,107,250,62,84,46,151,60,240,188,179,189,24,186,1,63,13,35,153,190,124,223,250,189,190,185,221,190,118,221,247,190,163,121,7,190,124,72,222,190,247,253,112,191,241,190,6,63,150,166,35,190,105,73,155,62,142,149,175,190,155,179,57,191,107,75,184,62,250,249,150,62,225,207,183,62,129,113,1,189,20,12,197,62,255,218,133,190,128,92,195,187,197,129,10,191,45,67,54,190,129,38,191,190,42,71,250,60,57,174,59,190,54,215,71,63,52,241,32,62,219,172,125,190,165,26,146,189,13,90,41,190,209,173,159,61,70,120,207,62,195,128,253,61,74,161,26,62,74,219,26,62,184,253,200,190,89,191,60,62,117,98,153,62,122,182,105,62,42,252,189,62,30,89,247,190,195,98,83,190,177,162,95,62,213,102,153,62,32,148,114,62,129,113,56,190,74,200,58,62,169,100,150,190,46,211,68,62,158,31,131,62,175,53,133,62,225,34,41,62,44,175,166,62,14,137,16,190,248,31,253,62,61,189,21,189,126,142,220,190,129,61,41,62,71,57,25,189,210,158,101,191,25,195,37,190,179,2,110,190,213,114,21,189,70,91,210,190,194,105,194,62,88,247,88,62,157,253,51,62,142,95,58,191,153,186,1,60,215,50,143,189,1,25,199,62,213,9,6,191,238,5,32,191,37,186,38,62,178,165,24,63,243,175,115,61,84,3,15,190,64,113,70,191,51,142,3,62,71,116,148,62,153,114,27,63,143,47,144,61,188,103,136,191,109,199,236,62,167,183,55,62,197,29,228,62,7,105,12,63,182,220,157,189,20,47,181,190,4,115,12,63,28,194,230,62,130,173,5,191,231,244,67,62,247,219,65,62,58,144,64,190,49,30,14,63,10,233,32,62,99,248,32,63,216,22,180,190,135,42,1,190,4,173,202,62,119,99,201,62,251,60,243,62,153,85,144,62,98,66,205,62,80,153,50,191,200,129,217,190,148,131,93,62,221,10,61,190,129,237,53,63,60,17,156,62,230,122,15,190,206,99,147,189,238,60,16,190,225,252,15,63,94,206,74,62,131,209,12,187,74,237,81,190,236,158,14,191,176,131,20,63,253,184,21,63,14,34,201,189,186,139,182,190,89,48,218,190,115,140,66,190,80,81,132,62,14,174,57,189,156,199,245,61,72,41,128,189,178,106,60,62,11,15,11,63,100,88,151,188,184,37,225,189,80,157,128,62,225,157,162,62,36,96,31,191,46,148,112,62,172,245,5,190,97,137,168,61,252,174,193,61,48,15,94,62,3,160,131,62,101,238,103,62,253,141,124,191,175,73,145,62,103,68,85,61,182,180,123,190,172,62,150,62,101,136,30,63,224,25,147,62,100,134,79,190,39,224,35,190,229,50,124,189,14,167,147,61,232,168,153,62,251,221,180,190,86,125,197,62,154,139,108,190,59,244,191,62,25,32,162,190,81,86,81,190,79,140,27,190,146,192,178,190,38,95,19,63,116,226,26,190,163,29,234,62,238,139,115,62,43,183,138,61,2,105,185,61,89,234,11,62,26,107,151,60,223,193,166,62,51,164,117,190,165,20,0,190,81,97,71,62,49,127,111,61,227,213,29,62,235,148,30,191,195,20,142,190,234,119,161,62,69,162,216,190,10,178,2,63,242,179,193,189,231,155,211,62,45,137,61,191,19,175,208,60,248,133,96,190,242,164,24,189,128,179,198,62,149,81,210,190,188,139,137,190,195,104,31,190,227,190,16,60,205,6,123,190,5,147,102,61,176,18,34,191,234,123,218,190,114,186,14,61,196,195,134,188,213,239,36,190,35,205,78,62,51,214,147,190,27,137,243,62,204,79,14,191,54,245,181,59,82,0,158,62,180,164,204,189,63,83,46,190,38,26,114,191,219,71,0,63,114,94,60,190,98,241,227,62,232,219,12,63,31,232,244,190,90,63,212,62,114,26,7,62,187,53,156,189,127,66,177,62,217,30,164,61,221,244,79,62,196,62,33,62,11,89,168,61,84,25,229,60,71,128,84,190,49,61,122,190,168,124,59,189,122,174,244,62,38,134,6,63,171,24,107,61,138,81,158,61,22,58,246,62,9,225,9,63,150,255,97,191,87,159,65,189,143,250,18,63,103,14,237,62,149,97,77,190,119,80,148,190,65,103,45,189,57,65,24,190,23,108,239,60,242,118,27,61,249,208,58,60,75,227,173,62,47,120,197,190,145,83,26,63,246,14,191,189,111,120,10,190,102,190,217,190,91,37,4,190,85,214,92,190,140,237,146,190,147,159,14,190,180,36,15,191,219,18,90,191,183,14,247,62,147,238,10,63,79,218,180,62,253,92,130,62,224,53,19,190,11,95,190,62,126,146,170,62,15,220,159,62,165,200,91,62,176,89,202,62,102,125,236,62,168,119,194,62,62,186,249,62,197,9,0,61,109,198,3,191,149,66,62,61,13,94,142,189,237,254,217,62,141,48,78,61,23,8,165,62,55,198,7,190,248,159,43,189,89,44,245,190,112,68,152,190,19,115,67,62,163,88,122,190,153,155,192,62,72,229,230,190,66,81,103,190,142,8,29,191,97,166,115,189,38,116,85,188,152,28,217,62,213,18,98,63,211,82,28,63,250,70,20,63,12,79,55,190,227,99,133,190,101,105,15,191,99,126,78,190,174,125,59,63,209,91,4,61,181,15,175,190,57,201,79,191,23,139,0,190,85,202,22,190,122,205,187,190,17,52,87,60,84,155,251,62,57,224,211,62,133,246,25,191,143,143,65,189,29,166,167,61,249,80,207,61,119,15,145,62,16,224,41,62,206,156,3,61,10,129,8,191,6,228,158,61,160,74,198,62,26,234,197,190,167,56,73,190,142,7,182,189,76,7,59,189,107,158,35,191,134,243,208,190,195,126,186,62,43,205,11,62,42,168,131,190,244,74,40,191,214,115,206,190,135,177,86,63,140,92,96,189,144,140,25,191,250,143,5,63,230,217,235,61,215,126,248,62,43,119,218,61,112,75,236,190,241,105,66,190,142,205,59,62,119,239,78,62,107,73,9,63,158,214,99,190,127,116,82,189,157,10,204,190,59,241,220,189,115,99,160,190,137,247,45,190,208,190,201,190,182,134,6,191,123,44,179,190,166,167,159,62,182,231,14,63,228,86,221,61,72,155,181,190,84,122,98,189,23,246,144,62,65,4,201,62,17,3,200,62,247,83,136,190,208,87,250,189,195,13,210,62,241,165,247,190,103,16,152,62,147,247,71,190,143,199,16,188,41,11,2,63,50,245,27,61,29,118,184,190,181,246,80,190,239,136,219,62,214,228,66,187,30,130,193,189,33,117,185,62,1,171,42,190,196,80,9,63,64,225,116,60,196,223,134,190,117,52,55,190,65,148,161,62,24,125,191,62,21,103,31,63,94,123,32,63,233,84,36,190,143,160,93,190,209,217,40,190,126,247,54,63,227,182,155,62,214,165,207,59,218,224,64,62,33,49,202,62,248,170,133,190,163,131,150,189,61,97,154,62,24,120,62,189,176,16,74,190,44,229,28,191,63,233,196,62,122,240,9,63,165,233,161,62,251,112,206,62,249,157,128,62,151,246,185,61,199,77,33,61,11,169,114,62,44,90,214,62,237,151,222,190,229,23,10,63,23,91,48,190,71,45,247,62,238,75,149,61,221,88,236,62,53,123,97,191,210,11,181,62,195,165,197,190,69,158,149,62,248,245,224,189,180,105,49,189,156,84,207,190,247,90,205,190,96,176,5,61,45,113,191,187,242,70,49,191,118,140,38,62,143,3,8,63,243,155,191,62,192,12,31,63,124,211,24,191,105,184,186,62,40,70,142,190,128,7,166,60,64,75,211,189,161,109,9,191,212,121,25,63,64,222,104,189,77,212,244,61,113,73,191,62,93,183,237,190,141,170,166,190,183,172,27,190,9,132,127,190,131,135,237,62,106,224,164,62,242,213,0,63,176,191,18,61,238,188,35,189,255,65,18,63,245,110,222,59,245,107,206,62,227,193,9,63,44,245,163,190,59,243,222,60,151,236,118,189,214,114,162,189,60,224,14,62,163,157,163,188,20,54,243,62,44,134,217,62,75,44,98,190,255,151,39,63,182,210,98,59,144,103,174,190,84,109,49,62,196,28,48,63,175,219,142,190,236,4,183,190,19,19,136,190,230,150,144,190,249,201,149,190,36,1,69,190,245,28,0,189,89,128,49,62,55,177,226,62,216,150,92,62,193,108,140,62,254,53,30,190,63,197,92,61,139,154,92,189,145,166,175,61,102,74,196,61,249,74,249,190,126,128,122,187,108,81,32,191,161,73,3,191,48,167,104,61,76,14,202,60,153,254,206,62,82,174,0,63,247,128,144,190,135,32,19,63,241,207,151,190,190,187,169,62,103,250,140,61,123,3,58,188,89,103,6,190,183,139,29,62,237,208,25,62,149,0,167,190,134,122,35,191,27,21,218,62,225,213,32,190,223,77,42,62,254,107,155,188,152,178,196,62,69,39,37,190,26,179,91,62,169,169,233,61,83,36,197,62,239,172,45,190,163,100,198,190,211,14,29,190,111,231,161,189,207,39,26,63,8,181,98,190,185,42,78,187,8,54,190,189,84,94,156,62,179,16,147,190,255,56,12,62,39,89,10,190,34,57,163,188,39,252,146,190,247,20,8,63,232,189,147,62,35,238,11,62,56,164,189,61,41,174,94,59,241,127,134,62,255,152,164,189,1,24,13,62,150,179,106,62,44,179,62,189,223,116,227,62,158,17,11,191,249,125,30,191,21,30,212,189,20,85,69,190,184,187,66,190,133,115,13,190,11,72,59,62,161,104,194,61,90,241,181,62,172,206,229,60,28,241,33,189,40,51,105,190,138,4,224,188,97,170,52,63,187,110,89,59,90,76,146,190,120,11,155,189,2,83,178,61,75,16,186,188,103,216,23,63,183,119,14,63,126,166,11,63,241,199,194,189,180,162,184,190,67,151,170,62,33,1,212,62,66,41,21,190,143,122,195,190,147,91,211,62,34,209,84,61,123,64,176,62,174,132,4,63,37,194,98,62,57,69,223,62,164,113,220,62,99,27,208,188,33,153,5,63,35,255,154,189,183,9,230,189,47,46,212,190,21,240,219,60,163,47,161,190,162,156,234,190,82,133,169,190,74,55,9,62,147,63,120,61,79,229,97,190,57,79,118,61,113,109,209,190,39,138,35,62,123,105,162,60,30,102,234,189,52,183,193,190,170,28,12,191,62,95,192,190,117,159,31,191,67,78,106,61,1,25,55,190,181,84,173,190,217,41,189,190,173,142,105,190,188,207,232,190,176,139,98,62,46,90,21,62,72,95,210,190,237,72,14,190,149,105,216,62,165,100,6,63,136,18,207,62,71,142,86,190,135,189,7,62,54,238,229,189,234,143,140,189,234,146,18,61,231,164,119,189,2,97,33,190,185,69,94,62,232,132,95,61,207,174,138,189,173,81,181,62,79,246,175,188,191,99,0,189,91,142,34,190,240,17,236,189,53,242,100,62,4,121,2,189,163,95,191,188,163,78,0,62,119,117,129,187,128,85,87,61,252,190,35,62,38,34,34,62,207,219,241,185,188,81,169,61,250,163,133,190,127,93,103,62,236,67,248,61,238,15,111,62,243,70,252,61,228,71,119,189,157,230,221,189,18,45,216,189,220,9,108,61,135,188,211,61,166,156,73,62,95,176,221,59,76,177,225,189,129,123,172,61,30,63,33,188,211,3,80,60,57,67,5,190,195,225,10,62,3,10,190,190,162,28,195,189,129,191,84,62,174,70,87,190,214,125,168,60,58,206,133,188,125,198,134,189,143,48,65,190,53,195,141,62,52,13,96,189,112,37,20,190,121,180,234,189,178,176,173,188,203,250,68,62,135,210,4,61,177,36,53,62,95,255,30,62,119,177,178,61,179,119,228,187,207,224,236,189,88,40,164,60,50,30,48,189,153,154,79,57,72,72,0,189,138,241,143,190,120,93,143,188,28,112,247,60,64,239,132,187,170,78,189,61,221,183,182,61,38,179,139,61,20,197,124,61,244,131,45,62,13,106,188,60,186,231,138,61,80,32,94,61,155,132,125,62,99,42,48,61,125,118,134,62,17,161,124,60,46,179,102,61,149,75,190,189,26,151,123,62,92,251,56,189,80,137,27,190,96,221,30,61,46,70,99,190,73,203,68,189,222,8,116,188,152,84,123,188,215,179,245,189,46,121,196,189,63,185,72,62,14,90,175,189,254,185,161,62,227,73,121,62,45,167,138,190,52,14,181,61,0,234,110,189,14,32,135,187,149,182,67,188,59,137,57,190,48,248,25,190,157,153,31,62,103,211,5,61,130,199,214,61,244,65,24,61,97,6,144,189,65,224,59,189,68,77,29,190,248,173,12,62,150,200,138,189,63,81,232,60,147,37,144,188,217,121,231,189,88,186,176,60,250,118,90,189,125,174,131,62,157,20,34,62,136,243,116,189,229,116,59,61,133,243,170,189,207,114,146,189,111,62,163,61,187,132,32,190,124,157,78,60,185,123,85,62,188,225,113,189,244,7,70,62,7,25,6,61,1,68,33,190,78,119,233,61,160,184,213,188,158,114,84,62,187,55,84,61,59,179,138,59,89,41,79,190,156,255,125,189,131,18,128,61,79,27,232,60,29,75,65,187,184,216,23,189,81,220,28,61,20,69,76,188,199,73,35,62,132,232,49,190,251,69,223,61,209,84,161,189,180,209,88,189,121,215,69,61,198,104,13,189,64,158,76,190,23,58,248,188,8,94,186,60,219,234,129,62,34,202,109,62,47,233,132,189,68,243,96,60,112,33,116,190,110,162,170,60,91,158,103,61,224,181,229,189,255,104,231,61,122,159,242,189,179,85,104,190,10,90,254,188,183,171,212,61,8,167,5,62,124,173,3,62,98,142,232,189,234,30,149,189,64,171,51,61,210,165,97,189,205,59,21,190,227,201,165,189,210,182,14,62,19,57,200,60,71,145,252,61,190,19,227,189,144,149,223,61,204,112,216,61,170,171,110,190,128,58,8,62,85,29,87,190,25,167,219,61,45,0,165,61,164,201,31,189,162,19,4,62,140,101,132,188,172,136,205,189,121,157,202,187,172,183,75,189,141,149,34,62,233,94,137,61,205,197,22,61,249,246,232,61,84,199,150,190,244,95,55,189,101,93,15,62,166,12,66,190,183,241,58,59,104,130,178,187,197,131,150,188,56,23,211,61,252,18,193,189,19,150,255,190,207,224,40,62,163,200,197,189,138,20,28,61,191,127,61,61,126,33,231,189,14,56,206,60,44,90,164,60,184,23,209,61,159,189,244,187,108,63,26,61,29,115,194,61,108,162,172,188,223,191,137,61,151,184,189,189,99,108,24,189,167,69,244,61,27,114,135,189,164,178,250,61,233,98,91,61,44,26,169,61,85,187,224,61,177,225,239,188,138,203,204,187,16,147,162,60,28,44,217,189,196,229,79,62,226,200,86,62,139,65,79,189,187,174,13,189,9,202,89,190,72,209,132,61,153,206,199,60,175,147,176,188,67,181,130,60,203,124,236,58,178,146,16,190,230,100,41,190,214,3,105,190,46,39,248,189,104,243,128,190,77,138,8,61,180,113,71,62,152,21,10,62,130,173,155,189,171,6,141,62,133,99,188,189,3,138,6,62,244,72,205,189,242,63,122,188,153,101,30,62,81,245,193,61,66,221,208,61,237,206,170,57,161,204,36,190,160,43,114,60,171,162,25,62,161,218,23,189,18,138,67,62,227,218,220,61,50,180,137,59,73,156,113,60,25,93,117,61,91,17,89,188,167,237,141,61,85,75,16,189,7,161,203,60,21,54,164,60,49,66,134,61,114,199,34,190,226,0,43,61,85,164,115,60,248,6,11,190,200,218,55,62,227,67,80,190,40,35,96,62,93,12,201,61,119,205,26,61,145,32,92,188,136,117,3,190,181,41,115,190,83,111,36,189,50,188,161,189,229,23,37,190,146,244,118,189,182,75,50,61,182,154,158,60,84,1,7,61,45,204,234,188,130,196,56,62,115,218,175,188,135,230,140,187,131,246,4,190,24,216,98,189,166,97,52,62,150,47,37,190,98,124,143,190,211,125,154,188,5,237,200,61,27,221,177,61,107,98,10,190,10,210,211,60,167,51,125,190,36,18,197,190,165,53,45,61,224,107,3,60,70,90,2,59,29,4,14,190,11,61,23,62,234,237,217,189,97,28,248,61,240,236,38,190,58,160,182,188,245,5,195,62,106,249,186,59,101,230,168,61,51,87,203,189,61,156,247,61,102,33,188,61,141,228,157,61,103,17,182,59,28,28,26,62,53,228,84,188,219,226,129,61,227,79,114,61,117,158,231,188,31,148,77,189,191,247,79,60,46,244,210,190,2,189,66,190,39,141,54,62,45,150,52,190,21,114,246,189,161,185,128,60,234,128,14,190,203,245,244,189,91,203,72,60,129,235,171,190,170,85,83,62,26,87,115,190,111,19,206,61,225,90,181,189,140,50,28,62,2,12,241,188,25,149,13,190,5,140,31,190,5,175,142,188,201,193,146,61,23,107,38,189,150,206,75,62,167,98,91,189,44,162,137,61,4,133,150,60,120,15,104,190,230,105,153,61,55,141,20,190,1,191,62,62,1,114,127,189,109,84,31,62,242,11,75,62,43,243,208,186,125,2,132,62,181,56,103,189,1,72,128,62,52,223,143,189,157,21,133,61,113,195,62,62,95,251,111,188,137,49,209,190,221,153,212,190,232,0,197,61,32,222,151,187,65,222,128,60,95,29,155,62,208,7,3,62,227,179,129,190,234,211,3,188,44,140,179,188,9,136,42,190,105,104,102,190,164,16,203,61,232,174,78,59,220,129,167,61,56,197,99,61,107,253,35,190,121,6,226,61,212,49,168,62,136,152,48,190,33,14,26,190,232,171,209,189,248,35,149,188,34,132,79,189,150,141,89,60,250,197,23,189,56,129,167,60,77,31,115,187,150,56,83,189,80,152,206,189,10,128,39,190,225,182,60,188,167,53,18,62,103,155,13,61,89,73,233,189,74,6,60,61,1,188,20,62,207,200,115,60,136,14,89,62,170,200,106,188,191,219,83,60,14,217,10,62,149,158,165,188,20,193,160,61,6,237,173,61,170,252,172,62,125,155,42,62,185,7,147,189,128,101,220,189,167,253,54,62,158,229,226,61,26,228,130,62,139,135,159,61,176,28,66,59,248,169,231,189,85,227,128,189,165,130,8,62,76,51,196,60,58,56,5,190,105,205,116,61,1,2,172,189,229,236,136,189,61,186,66,190,193,151,26,62,19,149,131,60,196,171,12,190,73,80,137,61,234,233,51,62,156,81,237,61,58,250,1,190,9,235,26,62,199,198,60,190,9,135,26,189,245,232,189,189,233,27,247,61,197,46,254,61,93,141,156,187,236,204,138,188,152,130,229,189,23,186,59,61,65,48,207,61,94,194,144,61,107,204,27,62,86,118,57,189,149,215,115,60,9,164,177,61,18,43,91,186,79,170,136,62,193,187,228,189,196,97,252,61,58,184,154,61,120,117,199,190,73,161,211,61,233,211,84,189,238,104,140,189,251,96,128,61,41,215,60,189,28,238,187,189,141,23,117,190,183,216,87,188,157,230,190,190,225,177,138,61,209,180,102,59,124,77,25,62,231,150,135,190,175,30,173,187,128,92,255,189,180,124,235,189,217,152,61,189,161,45,233,61,47,71,204,188,55,208,75,190,33,186,108,189,49,207,208,190,160,161,1,190,226,119,138,62,170,200,98,62,32,40,30,62,65,254,217,60,201,115,243,186,79,74,134,188,111,249,237,61,49,192,29,60,243,32,167,187,66,249,145,190,81,237,234,61,125,175,11,190,6,110,234,60,161,180,175,62,54,42,11,190,99,161,38,189,180,86,149,187,155,106,87,189,106,7,10,62,22,92,199,188,194,114,204,189,46,71,77,190,65,215,163,61,119,78,102,189,73,233,192,61,18,188,12,189,102,108,165,61,161,206,42,189,191,198,13,190,221,180,249,62,70,221,39,62,225,71,19,61,203,141,183,61,175,255,144,190,252,192,10,61,48,102,105,190,161,255,139,60,154,2,210,61,52,135,211,60,181,158,53,62,188,194,62,188,185,82,165,189,87,249,44,62,109,228,144,188,14,53,138,190,191,32,126,190,175,187,154,189,51,72,26,190,128,105,155,62,112,189,149,184,35,115,41,189,228,61,4,189,194,98,180,189,121,26,2,190,147,137,35,188,8,128,3,190,89,174,0,61,253,144,195,188,225,80,22,189,183,52,173,60,203,127,34,62,69,213,8,61,60,90,8,61,233,39,30,189,3,95,128,61,67,251,128,61,249,140,20,190,131,158,134,61,37,94,171,60,166,123,162,60,214,29,184,61,39,119,44,190,183,117,173,61,252,162,167,61,38,67,229,61,234,56,90,58,46,64,82,189,51,147,80,190,237,29,245,60,190,164,162,61,146,117,9,62,41,144,27,61,150,205,194,61,73,68,197,188,251,212,128,189,27,109,214,188,123,177,129,61,34,96,143,189,7,238,9,62,52,201,170,188,110,235,109,60,126,106,190,59,237,95,175,61,66,100,205,61,41,247,77,190,191,109,203,61,245,199,127,61,133,177,153,189,77,202,126,61,76,161,102,61,121,108,197,189,140,210,176,189,180,115,5,190,151,221,13,61,53,179,173,189,50,96,132,61,89,220,197,61,162,24,199,188,79,158,175,189,226,128,151,189,39,125,11,190,206,176,133,189,245,40,197,60,105,53,192,59,132,27,119,61,53,78,241,189,234,170,87,189,57,88,201,57,57,232,226,60,234,39,51,60,121,135,18,62,115,247,243,61,75,19,59,61,86,14,49,190,6,88,59,61,236,183,237,61,65,86,199,189,204,238,162,188,24,106,31,62,104,156,3,189,45,22,111,60,104,235,100,189,189,27,242,189,36,127,255,61,193,51,250,61,152,175,22,62,79,4,163,61,24,132,72,189,231,105,254,188,186,24,91,62,52,121,128,187,134,78,208,189,146,139,32,190,12,95,144,61,230,27,93,190,202,3,204,189,19,0,35,190,10,220,221,189,191,156,9,62,41,11,20,190,24,223,231,61,203,131,46,62,116,193,35,190,26,31,214,57,246,64,236,62,138,209,201,188,98,62,134,61,172,119,132,60,207,255,146,189,78,8,45,62,42,169,109,61,233,200,191,188,56,179,0,62,238,137,38,190,242,252,167,189,138,206,168,60,34,63,223,189,255,11,127,189,225,165,144,189,3,212,106,189,139,124,22,190,32,122,70,61,145,120,141,188,214,27,183,188,16,53,46,61,195,143,79,62,2,251,237,189,237,65,142,189,11,210,231,60,55,123,13,61,206,208,26,62,94,220,13,62,11,65,247,60,129,21,222,188,96,187,238,188,240,137,55,60,241,51,3,190,187,131,210,61,31,209,22,190,118,211,104,61,224,231,109,61,249,109,64,61,220,46,101,189,78,120,104,62,226,26,194,187,84,131,193,189,186,91,29,190,105,230,28,190,198,213,28,188,235,153,64,62,219,82,183,189,9,43,189,189,175,132,27,190,76,206,12,187,3,49,253,189,53,6,30,62,97,168,40,190,14,25,132,60,5,162,151,189,116,14,55,189,2,84,119,189,111,172,250,61,63,106,106,61,111,178,182,189,86,223,11,190,29,212,26,61,212,230,36,62,30,133,150,189,214,249,5,189,8,192,199,189,151,97,80,189,165,54,100,62,84,111,130,62,206,246,82,189,177,160,131,61,197,51,5,62,183,104,191,189,224,44,41,62,213,36,128,189,163,255,78,61,102,113,81,62,182,85,139,189,123,193,72,188,204,109,100,61,15,69,235,59,11,14,17,61,57,9,4,62,52,188,28,190,57,147,16,190,60,105,157,61,194,30,28,61,150,91,162,189,148,234,11,190,109,159,42,60,145,196,48,62,88,91,215,189,50,139,162,189,92,232,112,189,20,6,197,189,216,51,198,58,210,145,207,61,23,191,121,60,165,195,141,61,26,179,93,189,183,60,74,62,26,206,130,61,63,150,79,189,22,236,156,61,220,11,59,61,26,227,21,190,176,2,229,189,86,76,137,61,133,150,16,190,217,190,127,62,49,121,76,189,177,101,148,61,147,235,247,61,39,133,168,189,142,177,6,62,214,29,228,60,101,1,79,188,110,121,163,61,132,77,202,61,161,155,96,60,101,204,78,62,36,198,247,60,112,130,79,61,254,52,155,185,196,45,82,190,151,102,106,189,75,212,74,62,185,188,240,61,28,64,148,189,92,242,129,62,125,242,136,190,26,180,236,59,177,110,235,61,77,96,170,61,83,127,4,62,178,239,133,189,158,79,142,60,113,34,128,188,204,226,237,61,88,107,67,190,7,3,159,188,151,71,0,62,81,140,148,61,211,24,211,189,236,202,16,190,44,94,165,61,148,122,53,190,20,130,203,61,165,227,2,62,172,115,208,189,178,133,45,190,238,222,242,189,214,33,50,189,228,213,178,188,97,216,143,190,52,84,92,61,141,28,101,190,76,2,3,189,57,35,75,189,41,141,161,189,62,167,140,61,5,157,74,61,146,49,253,60,121,66,113,189,95,100,160,61,139,227,21,190,64,105,133,189,158,230,37,190,225,114,42,62,27,54,59,61,100,182,87,190,125,119,74,190,24,141,169,189,189,241,1,188,54,199,129,189,165,101,66,189,196,8,83,60,156,217,219,61,211,210,244,189,2,164,108,189,6,152,236,189,75,232,32,189,105,195,0,62,152,167,132,189,237,158,181,61,94,247,189,61,102,219,51,190,70,137,1,61,122,146,215,61,206,4,193,189,235,195,24,188,149,230,47,190,235,194,248,60,244,224,62,62,238,3,194,190,244,122,50,61,156,123,43,62,38,159,21,189,131,105,166,189,98,121,184,61,143,230,165,61,140,150,187,189,106,24,166,188,174,175,107,61,108,92,33,60,20,48,129,188,39,117,204,61,5,21,47,189,93,226,219,57,233,151,133,61,35,64,79,190,163,162,61,188,207,23,34,190,169,141,111,61,42,241,53,62,244,30,132,61,224,79,191,59,32,214,254,60,148,196,11,190,65,238,241,189,18,222,61,190,141,99,118,60,252,218,126,61,207,170,87,189,121,72,138,189,218,81,44,62,12,70,18,61,113,99,37,62,188,35,16,61,233,84,122,58,156,5,135,59,250,23,91,190,231,66,155,61,240,114,250,186,242,158,54,190,98,29,192,188,80,4,95,188,120,21,90,190,24,99,128,189,158,198,141,61,134,4,88,189,170,186,241,188,229,200,67,190,202,235,102,190,71,89,70,190,26,54,205,189,215,223,71,61,54,165,41,62,136,179,25,62,125,170,48,61,102,203,141,189,248,142,182,61,27,81,175,190,242,50,98,62,57,104,149,190,0,33,65,62,235,22,34,190,57,7,125,190,5,113,249,189,90,57,127,61,185,63,242,59,59,192,62,190,213,239,6,190,126,229,45,61,34,232,28,189,197,21,226,189,165,181,77,190,24,37,39,62,181,82,154,61,101,2,136,188,55,151,40,190,29,75,116,190,93,227,11,190,4,168,114,189,220,245,74,61,61,215,209,188,127,53,210,61,187,27,214,187,86,160,234,61,102,187,51,190,146,237,92,62,169,63,150,189,105,59,177,189,136,81,212,189,140,46,17,188,255,128,5,189,233,196,209,189,255,39,99,190,40,116,95,190,34,115,130,61,223,70,101,188,67,77,150,61,5,236,109,190,109,5,38,60,62,251,37,190,74,151,154,188,120,3,93,62,73,251,89,62,183,188,118,190,116,239,201,61,50,154,139,188,240,33,197,189,44,122,19,62,207,160,39,190,100,49,231,61,226,247,72,62,240,176,131,61,117,12,251,189,55,191,151,61,171,113,254,188,21,37,37,189,35,65,146,61,153,176,243,189,14,93,89,188,179,226,245,61,41,187,42,62,136,151,212,189,241,80,48,61,208,253,90,190,171,7,12,190,71,12,127,62,80,160,235,189,193,130,93,62,15,208,198,61,248,238,46,62,227,16,126,61,136,153,250,58,63,103,203,189,112,116,188,61,216,156,31,187,154,201,203,61,188,178,171,60,30,172,57,59,212,167,203,61,157,82,170,188,67,35,60,61,9,96,34,61,15,216,224,61,58,104,9,190,160,187,143,62,220,53,172,61,141,83,46,190,231,128,156,189,32,94,158,61,173,136,131,188,59,197,22,190,152,243,117,189,200,97,184,190,165,51,69,189,212,238,132,189,166,146,151,190,92,63,147,190,136,172,51,60,231,25,4,61,139,232,63,61,177,82,180,59,249,3,97,60,234,226,179,60,93,56,228,189,165,93,157,189,60,26,124,185,141,132,48,60,3,113,131,189,94,71,11,62,24,98,84,189,173,150,167,60,111,245,220,188,191,11,164,188,77,240,100,189,73,235,163,187,126,209,80,62,118,63,132,189,48,44,21,190,162,24,5,190,157,177,141,189,73,8,68,62,253,145,17,62,184,49,24,61,240,243,89,61,143,143,149,189,137,59,234,59,72,39,45,190,119,47,41,190,77,70,194,188,2,147,184,61,179,176,13,62,195,183,96,189,151,249,206,189,196,236,180,189,163,103,35,190,221,182,69,190,159,252,228,61,90,234,237,60,123,219,136,190,116,124,44,190,229,11,211,189,93,6,119,60,131,177,71,190,218,246,156,61,5,32,254,188,19,221,8,61,185,107,226,60,29,153,78,190,165,248,29,189,89,165,7,189,33,198,193,61,74,143,32,190,39,27,101,190,184,209,214,189,185,134,216,189,252,32,104,62,39,176,212,189,176,153,173,61,44,200,72,190,226,33,238,187,178,164,144,61,35,252,165,189,209,64,250,61,109,57,229,189,231,131,162,60,130,72,109,189,62,40,142,187,10,28,149,189,233,107,220,189,248,244,207,61,101,201,219,61,57,116,193,189,46,148,144,61,188,21,218,188,58,12,135,189,165,146,176,61,81,197,172,61,171,53,229,188,47,246,180,61,138,149,218,189,77,222,186,190,191,78,132,189,200,76,169,189,26,24,147,189,102,83,213,188,74,48,174,61,202,53,5,191,61,58,50,190,57,88,171,61,139,99,116,61,166,149,252,189,105,103,74,61,1,253,136,61,255,105,43,60,60,171,136,190,36,21,149,189,74,81,57,190,159,199,129,61,193,90,24,188,95,1,48,62,65,171,3,189,133,218,192,190,133,206,91,189,133,127,38,190,55,68,156,61,173,76,18,61,149,48,80,61,87,247,36,62,213,67,212,189,116,114,47,190,196,73,48,61,211,36,53,61,227,165,204,60,239,199,246,189,139,62,40,188,211,147,147,61,210,214,53,62,252,98,150,189,14,62,254,60,86,129,132,189,44,76,80,61,143,7,141,60,18,19,92,60,103,200,39,61,244,230,200,60,171,113,229,61,64,240,142,189,180,36,225,188,199,9,47,189,34,245,135,189,53,251,130,61,152,202,99,189,218,134,216,188,140,38,3,55,77,188,209,187,139,110,230,60,145,217,177,188,97,39,185,60,19,246,236,189,183,203,218,189,255,178,20,191,34,191,236,61,245,225,180,61,33,166,67,189,29,33,7,62,72,99,6,189,72,66,166,61,116,241,45,190,72,13,38,62,137,178,101,190,110,93,88,190,234,98,47,62,147,17,146,60,137,142,37,61,119,69,150,61,18,98,89,189,49,214,19,190,237,132,6,190,50,108,64,61,54,37,3,190,245,156,240,189,76,17,34,61,25,39,130,190,36,53,61,62,242,173,224,61,63,141,3,62,113,14,26,60,77,4,11,62,118,210,123,190,239,15,91,188,200,38,213,61,161,132,255,189,153,196,129,190,77,55,44,62,109,211,193,187,42,6,234,59,46,103,73,189,121,181,33,62,119,10,92,190,59,207,154,187,191,114,28,61,232,210,254,189,147,15,59,59,250,55,167,189,238,91,210,188,117,47,75,61,168,74,131,188,143,172,120,61,119,60,33,188,25,126,224,189,113,68,170,188,229,59,52,60,197,60,12,62,149,74,186,190,191,52,107,189,181,206,54,190,139,80,70,61,121,176,122,61,112,9,88,190,74,142,169,189,227,82,138,60,124,130,18,188,86,94,154,190,214,12,49,190,71,154,45,62,10,196,182,60,130,83,211,189,159,55,196,189,67,62,181,188,22,45,39,190,221,81,120,188,119,198,67,61,74,183,163,61,238,110,13,190,210,100,144,189,35,74,168,189,166,228,90,62,169,255,172,190,155,119,137,61,98,38,233,189,195,214,36,62,212,16,92,184,34,123,28,62,42,147,11,190,141,38,214,188,144,96,82,189,48,38,226,190,110,31,123,190,154,60,140,190,143,189,196,61,219,85,96,189,234,242,40,62,40,49,2,62,158,203,237,189,178,148,145,61,26,148,239,189,71,169,4,189,211,64,91,189,247,247,139,61,129,71,187,189,89,248,98,189,225,235,161,189,50,156,142,60,124,184,171,189,20,137,79,190,54,46,1,190,179,39,65,189,102,167,250,188,127,46,252,61,40,192,164,189,131,188,70,190,179,131,246,60,166,228,145,190,222,109,247,61,4,77,37,61,166,153,161,59,19,102,221,61,218,27,68,187,185,238,101,190,214,185,158,190,188,137,58,62,29,198,64,60,4,141,191,188,252,129,116,61,192,91,175,189,149,161,77,189,117,59,9,61,141,135,178,61,90,214,193,189,83,155,70,190,55,168,39,61,113,163,237,61,124,17,115,190,215,10,54,61,35,154,225,61,69,73,70,189,206,158,176,61,102,24,166,61,18,153,135,189,6,22,62,61,111,188,213,61,115,14,35,189,209,153,191,61,208,35,5,62,59,194,17,61,114,167,50,190,166,71,189,190,183,151,203,61,214,186,251,61,153,93,83,61,243,103,50,62,70,208,207,189,116,199,24,190,159,63,190,61,168,5,204,189,39,97,12,60,51,164,159,189,91,201,30,61,61,244,242,61,132,131,25,61,83,131,43,61,192,249,32,62,144,178,90,62,251,10,63,61,187,95,114,189,36,93,236,189,59,128,198,189,101,98,205,190,52,75,162,189,184,48,134,189,243,191,30,189,4,204,0,190,146,94,81,189,58,240,180,189,205,98,251,60,242,141,24,190,110,5,115,190,59,21,185,188,176,14,247,61,208,35,82,59,82,4,178,190,176,232,189,189,18,76,230,61,205,38,49,62,133,220,102,190,125,160,190,189,238,37,181,61,151,200,88,190,169,34,186,60,180,157,211,188,144,13,11,62,62,224,163,188,42,228,233,189,59,220,8,188,187,112,172,188,134,193,181,61,127,25,93,190,88,70,27,189,220,134,160,60,2,3,175,190,138,159,237,187,4,40,79,190,100,27,4,62,178,91,53,188,197,61,154,61,59,208,76,190,110,58,100,61,100,49,120,190,1,198,159,61,95,108,203,189,140,149,206,61,198,32,243,188,137,21,234,60,12,45,40,62,84,112,4,62,70,227,133,60,161,171,73,62,201,211,30,61,185,244,16,191,66,25,205,189,167,193,122,190,139,45,152,187,197,20,81,62,125,154,22,190,96,116,50,190,112,221,26,59,57,246,6,189,162,134,144,190,97,243,2,62,71,0,207,61,198,187,65,189,134,121,163,189,6,164,11,189,240,234,8,61,118,95,130,61,22,200,173,61,144,88,69,189,84,125,224,189,244,157,89,61,145,170,131,190,21,79,219,189,77,239,213,61,252,141,166,58,5,118,233,189,243,142,114,189,140,245,169,59,188,226,97,188,224,42,121,61,250,208,50,62,44,115,200,61,186,94,218,60,156,73,172,189,151,112,105,61,216,16,2,191,220,4,5,189,224,119,41,61,142,61,53,190,88,178,46,190,66,58,8,189,231,217,201,188,10,38,62,186,59,22,55,189,179,196,8,62,205,99,39,62,22,62,107,61,196,170,49,60,141,198,240,189,76,229,163,189,148,99,178,189,123,218,192,188,1,18,244,189,236,144,28,62,189,82,167,61,238,23,25,62,27,102,5,62,85,25,221,61,56,228,0,62,26,17,1,62,235,241,64,190,14,196,136,59,237,93,191,61,234,196,61,190,213,61,25,61,94,69,216,189,165,247,157,61,97,32,240,60,89,177,130,61,20,152,85,189,246,134,72,60,144,87,38,190,175,114,180,61,128,121,57,189,130,234,57,188,104,217,232,188,255,71,138,61,22,144,198,189,119,250,21,61,92,66,241,189,42,112,167,61,178,115,159,189,72,34,64,187,90,158,85,190,33,86,95,62,96,86,228,189,134,151,139,61,13,206,46,61,105,223,64,190,224,61,211,188,82,176,197,60,158,249,199,61,29,28,13,188,245,114,171,189,209,14,144,189,195,52,12,190,218,59,36,190,166,150,19,190,234,15,183,189,157,40,0,190,252,77,205,189,213,97,9,190,3,90,164,189,169,35,110,190,218,250,11,188,173,18,4,190,131,171,10,189,3,126,232,189,29,255,155,189,95,207,182,60,103,63,9,62,20,231,35,189,233,133,5,61,74,191,90,61,206,44,29,62,109,152,42,190,124,140,183,61,48,199,242,189,214,37,15,190,131,229,90,189,55,113,251,187,180,235,198,189,219,77,145,190,4,3,30,188,211,236,127,61,16,147,247,61,241,90,34,61,22,130,170,187,89,180,4,189,127,146,36,190,23,9,37,190,104,144,221,189,38,113,69,61,21,139,129,61,206,169,93,190,214,83,137,188,106,157,216,60,198,197,134,61,57,109,106,61,63,39,93,189,217,248,117,60,74,217,197,188,135,90,71,190,224,17,114,61,73,82,8,61,223,74,87,189,42,81,172,189,232,194,176,189,13,86,168,189,23,30,33,190,63,239,134,62,193,1,41,190,83,218,70,62,237,233,51,62,189,194,50,59,74,239,178,189,188,94,10,62,137,183,204,189,60,107,69,189,193,86,148,189,106,144,132,189,141,93,87,61,127,187,48,189,208,28,99,189,201,153,8,62,67,79,92,190,94,184,33,190,161,19,251,61,43,10,179,189,11,45,41,61,133,205,184,61,128,114,205,186,0,200,252,189,125,101,147,188,237,237,31,61,253,40,128,190,118,102,97,189,86,37,26,190,76,32,57,62,113,4,187,188,28,128,121,62,44,30,128,191,233,223,48,191,222,96,194,62,130,92,71,191,26,120,75,60,191,88,17,191,120,38,218,62,13,34,216,190,127,165,162,62,200,82,28,190,86,203,94,191,17,20,163,190,171,116,221,62,33,102,216,190,142,14,46,191,133,219,242,61,26,177,152,61,210,137,49,61,38,70,247,189,41,26,194,62,172,164,89,191,199,148,56,62,69,60,50,62,216,88,26,191,158,251,133,189,182,183,20,190,123,140,45,191,91,16,146,188,243,98,41,191,225,104,179,62,165,58,210,61,42,147,128,62,163,103,128,191,180,37,152,62,70,53,254,61,7,217,31,62,77,255,20,62,61,70,163,62,254,238,135,61,22,211,82,191,181,77,80,191,157,6,158,62,248,219,77,61,148,233,246,62,228,57,128,61,133,143,247,190,233,112,24,61,156,199,142,62,235,194,166,62,175,243,187,62,221,223,179,62,38,102,178,189,101,191,24,61,97,107,253,188,246,195,191,61,173,116,204,190,13,129,51,63,100,212,137,62,1,39,231,61,195,101,136,191,109,109,239,190,116,135,5,62,160,61,49,191,117,200,105,62,68,29,21,191,3,225,77,191,115,230,168,62,37,166,180,62,60,171,17,191,1,26,55,191,8,110,109,61,236,28,216,190,131,185,67,62,123,162,152,62,231,229,35,63,251,66,114,191,76,87,96,191,208,164,44,61,12,75,188,190,42,16,215,62,200,68,242,61,214,207,208,189,188,120,135,189,119,17,151,62,254,253,225,190,63,42,90,62,118,114,221,188,28,150,167,61,157,46,169,62,136,128,222,62,48,136,181,190,188,158,141,61,241,57,150,62,30,84,184,62,170,140,106,191,16,176,104,191,218,118,130,62,131,248,129,191,98,240,64,62,252,239,156,191,152,0,129,190,77,90,145,190,146,46,54,62,151,31,136,188,7,123,165,187,10,1,4,62,54,79,146,62,186,79,186,62,153,124,8,191,195,161,187,61,177,124,140,191,14,84,180,60,144,135,85,62,99,48,43,63,141,175,119,191,169,58,161,62,79,121,196,190,10,138,233,190,91,201,210,188,81,122,215,188,222,1,126,190,174,68,236,189,117,2,240,190,192,17,145,62,194,230,230,62,35,99,30,60,94,117,89,191,110,183,220,190,65,76,10,191,157,15,39,190,55,235,25,190,160,186,232,61,18,248,126,189,108,136,34,190,207,34,66,62,3,146,128,62,10,215,202,61,158,110,173,62,135,143,224,190,232,134,4,191,249,51,52,62,184,99,179,61,153,80,153,62,4,95,4,63,219,132,217,190,185,19,146,190,110,245,144,62,76,88,28,191,247,243,185,190,203,158,239,61,71,228,62,62,242,39,176,62,236,81,165,61,211,20,89,191,254,82,163,62,36,112,184,190,208,88,22,191,98,177,59,189,209,187,132,190,110,155,67,188,199,255,201,61,60,177,34,62,110,25,185,190,88,33,48,60,220,67,40,191,10,228,157,62,46,3,65,63,153,32,48,62,178,167,179,190,50,127,156,189,178,230,76,62,95,10,204,62,18,56,109,190,64,54,147,62,214,48,10,63,51,216,247,189,103,26,3,61,216,173,247,62,75,191,40,61,72,149,26,190,99,109,121,62,43,113,9,62,221,212,107,190,38,245,91,190,84,53,6,63,60,144,100,191,247,43,174,61,172,81,227,61,209,216,147,190,237,244,38,61,197,195,112,190,61,75,213,189,157,13,105,62,100,207,193,62,215,124,5,190,191,227,175,189,250,140,90,189,39,44,2,62,140,249,201,62,178,50,157,188,242,151,197,62,171,188,118,191,75,46,162,61,244,20,238,62,23,208,163,190,4,219,187,61,33,149,98,191,7,70,142,62,118,49,5,190,207,9,94,191,49,34,41,62,247,166,13,187,56,122,131,62,194,206,138,61,168,206,137,62,150,154,1,189,178,204,232,62,247,244,37,191,223,22,248,189,9,97,245,190,82,161,170,61,196,224,148,62,35,11,72,61,251,147,175,189,53,239,94,62,24,126,215,60,144,223,57,188,45,159,148,62,90,23,189,61,16,214,236,189,56,114,13,62,10,113,119,62,115,195,205,62,2,105,8,62,240,185,72,190,164,32,200,62,235,78,232,61,149,228,55,190,176,5,79,60,109,136,169,61,59,54,150,61,118,124,61,191,223,242,208,190,186,25,225,62,222,75,28,189,139,255,145,189,10,218,36,190,21,240,90,62,157,30,138,62,151,203,50,189,25,89,148,189,211,162,83,191,178,79,226,190,62,138,124,191,147,80,58,191,107,153,223,188,142,240,6,63,218,246,165,189,0,21,23,191,95,116,43,62,209,246,244,189,0,249,251,61,227,109,45,191,204,192,110,189,4,236,55,190,49,23,131,62,163,53,168,61,155,113,141,62,61,117,97,191,162,105,152,62,164,145,227,62,95,227,169,62,43,25,48,191,17,217,212,61,246,249,41,62,80,46,191,187,58,229,211,62,161,161,53,61,167,39,139,189,232,112,224,62,37,27,51,62,174,64,68,191,243,165,174,62,124,153,208,189,79,217,9,63,73,75,70,191,199,68,237,189,116,176,59,190,46,73,213,62,71,249,143,191,159,183,226,190,205,163,112,188,213,106,216,61,203,231,215,61,253,11,207,188,205,101,136,62,101,71,6,62,26,237,154,190,52,26,64,62,126,36,133,190,208,70,18,61,84,176,211,62,204,204,135,62,58,94,10,62,86,247,192,189,37,171,11,62,139,141,69,191,29,166,4,59,219,68,60,189,156,192,157,190,178,57,18,191,166,3,16,63,217,202,47,63,31,190,151,189,43,137,143,191,147,46,30,191,238,158,27,63,202,35,150,60,82,51,69,62,59,59,36,63,157,191,45,62,80,5,98,190,79,50,190,62,155,3,12,63,198,225,145,61,224,190,169,62,20,245,72,62,22,1,139,62,94,215,181,190,162,68,156,190,167,242,137,191,66,183,7,189,75,222,17,63,151,10,168,62,240,37,105,62,176,49,159,61,6,109,16,191,107,132,20,189,7,253,226,62,107,29,174,191,67,77,76,190,249,117,12,189,4,158,183,186,115,237,12,191,40,222,194,61,152,173,65,191,14,14,151,62,192,78,190,62,118,198,89,190,38,65,179,61,211,0,240,62,87,40,88,62,99,31,168,189,242,213,242,61,106,72,153,187,234,176,159,62,4,94,88,191,215,195,146,62,36,237,213,190,207,248,75,62,219,31,115,61,51,60,140,61,110,82,134,191,168,194,238,60,202,109,155,62,162,247,253,189,205,153,87,62,31,87,30,189,85,57,20,191,43,31,210,62,50,252,17,191,70,175,201,61,77,0,107,62,2,24,188,62,112,248,62,189,96,43,152,62,11,240,83,191,228,49,163,61,142,158,12,190,154,151,155,191,90,47,65,190,150,138,171,61,93,72,179,62,215,213,153,62,176,68,105,188,31,81,140,62,6,254,31,62,51,131,159,188,130,175,107,60,186,84,250,61,167,251,23,62,219,48,204,189,143,195,42,62,229,249,32,191,215,191,145,62,89,93,199,62,48,57,133,191,71,185,240,62,145,225,63,61,49,90,88,62,173,30,145,62,12,111,29,63,202,123,165,60,130,197,9,191,42,129,200,61,128,202,82,62,4,153,38,62,97,224,213,189,162,222,14,61,237,244,229,62,138,136,141,191,223,113,12,62,196,109,253,62,132,92,228,189,203,9,20,63,249,248,29,61,120,194,201,189,252,194,205,187,135,29,161,62,101,138,113,62,181,62,138,62,105,123,123,62,111,226,151,189,179,140,167,190,104,138,88,190,25,26,150,62,140,148,22,62,161,99,42,191,166,187,69,189,71,149,111,191,35,46,88,191,216,234,229,190,81,59,62,61,174,224,163,190,136,175,198,62,152,37,229,62,23,14,48,191,136,156,251,61,200,205,60,191,157,233,196,187,94,157,59,191,39,57,29,191,92,53,138,61,119,80,56,190,74,185,1,61,27,180,48,62,172,105,16,62,205,80,145,61,251,16,243,61,238,158,127,190,148,173,29,62,244,240,144,190,246,51,222,61,194,41,147,191,9,21,67,191,47,22,159,191,11,29,47,191,61,165,45,62,216,126,142,62,68,95,205,190,219,92,246,62,7,229,180,62,3,70,130,190,98,128,17,62,131,12,227,62,229,59,236,190,63,136,64,62,206,104,135,189,103,219,185,62,228,0,30,191,122,98,7,62,67,60,135,62,172,177,230,58,144,223,201,61,43,111,147,62,138,9,226,62,70,84,41,191,119,113,61,191,169,235,110,189,1,47,111,189,201,234,212,187,160,18,147,62,62,161,5,188,95,197,169,61,214,94,88,62,135,211,20,190,74,129,142,61,140,235,14,191,205,106,14,62,114,154,236,189,202,73,170,62,87,215,41,189,175,200,160,62,65,129,166,191,101,143,190,188,175,150,58,61,101,68,166,61,5,228,228,62,255,203,230,62,81,61,166,186,79,211,35,62,145,31,20,60,252,54,150,62,215,38,56,60,194,248,216,190,4,82,139,62,178,240,194,188,189,67,165,62,27,210,171,190,235,60,183,62,186,48,196,62,229,144,69,62,172,58,90,62,216,138,2,63,170,90,85,191,46,94,147,62,115,155,141,188,151,11,19,191,207,59,158,188,29,79,21,191,215,115,2,62,191,32,122,61,102,209,13,61,255,103,76,62,225,84,224,62,185,1,102,62,239,188,134,191,222,142,17,191,90,245,201,62,184,131,185,62,100,58,133,59,151,139,34,189,214,20,218,62,208,148,254,61,118,2,19,61,120,65,161,190,248,20,255,190,80,79,1,190,95,108,86,188,26,67,100,189,186,212,55,191,89,11,73,190,229,126,141,62,141,24,217,61,80,176,136,62,83,202,229,190,67,227,155,62,225,95,2,62,14,193,158,190,57,8,150,191,99,95,11,188,85,110,78,191,210,99,160,61,76,141,120,61,74,7,17,62,226,43,152,62,86,133,29,190,22,232,1,191,202,173,4,62,73,136,152,191,17,116,136,188,38,86,135,190,170,180,8,62,127,230,21,191,152,194,169,189,7,48,2,62,24,210,106,62,27,159,114,191,186,133,130,191,208,178,137,62,48,206,12,188,203,14,1,63,125,158,3,191,215,179,155,61,66,145,16,62,64,137,202,190,241,33,73,190,113,120,153,190,212,218,14,191,183,144,218,190,178,127,198,189,52,85,202,62,117,147,25,191,23,194,38,191,192,110,115,62,200,102,70,62,125,50,159,191,224,8,145,63,132,173,47,191,135,139,196,190,158,58,173,62,250,77,207,190,194,182,61,62,194,201,196,189,199,237,91,62,250,17,138,62,9,247,201,61,53,236,118,62,37,148,141,62,113,74,226,62,99,103,145,62,190,219,214,61,175,218,186,60,150,135,37,60,31,169,49,62,100,245,192,61,190,26,142,191,91,67,37,62,43,87,125,61,242,68,203,62,164,54,38,191,150,238,46,191,12,130,179,62,239,53,233,61,136,229,176,61,69,129,21,190,65,193,4,191,22,147,30,62,57,194,26,62,212,203,23,191,169,190,157,61,177,19,165,60,73,140,195,62,14,173,99,61,187,196,229,62,126,149,67,191,255,246,251,62,37,180,75,191,236,14,33,62,25,23,211,190,20,156,50,190,123,222,75,62,66,33,126,60,46,185,65,62,39,73,95,191,22,126,174,62,42,227,17,191,38,7,162,189,128,39,88,191,119,161,64,62,26,38,113,190,46,106,144,60,183,187,116,190,125,239,72,191,173,180,145,62,123,59,19,62,131,149,34,62,165,174,7,62,253,203,198,188,147,19,79,62,18,149,141,189,240,209,97,190,26,88,86,62,253,173,55,191,63,3,86,62,138,16,40,191,109,165,17,191,35,168,120,190,93,22,65,62,192,97,29,191,201,23,135,62,4,176,106,190,226,197,200,61,226,39,210,190,102,134,63,189,192,98,101,191,241,192,171,62,108,45,195,189,164,30,113,188,155,253,156,190,73,165,14,191,52,82,174,189,31,77,118,187,183,97,144,62,134,219,72,191,167,138,114,62,77,201,86,191,62,92,202,190,196,75,29,191,4,72,162,61,36,91,22,63,27,236,134,189,142,135,11,190,249,74,137,62,191,58,136,62,187,3,158,62,118,226,19,63,35,111,165,62,134,71,235,190,79,175,6,63,93,66,107,191,120,79,36,190,42,76,168,62,238,14,137,62,242,122,194,62,58,219,32,191,138,0,38,190,144,243,188,62,66,168,6,190,136,17,32,61,169,106,1,189,229,11,90,61,253,212,168,61,44,234,12,61,21,164,104,62,51,17,158,190,76,246,105,60,36,247,82,62,25,95,172,61,27,78,104,62,211,3,136,62,189,25,60,190,10,21,68,191,231,187,212,62,113,27,156,61,45,159,130,191,131,6,161,61,34,149,235,189,197,147,195,62,203,39,108,62,148,138,149,188,159,101,12,63,36,82,65,191,248,2,1,190,19,44,33,189,178,246,150,61,233,111,154,62,53,231,128,189,96,196,43,191,177,209,148,62,46,98,201,189,38,110,39,191,179,34,197,62,58,229,240,62,247,58,129,189,132,196,58,189,239,140,152,62,49,210,189,188,141,82,153,189,15,170,172,62,92,183,135,62,200,198,137,189,139,111,190,62,1,212,0,63,81,34,19,191,25,146,6,62,123,81,68,190,153,73,5,62,72,141,205,61,12,145,20,61,41,11,247,190,40,241,137,62,8,224,59,191,196,160,199,190,149,246,28,191,73,199,85,61,65,237,7,62,221,47,72,62,111,148,141,61,177,243,147,62,254,6,104,191,138,177,75,190,123,187,200,188,77,24,137,62,208,192,87,190,148,70,74,191,224,231,133,61,95,2,12,190,89,139,50,191,52,151,79,190,155,169,8,63,205,223,11,190,63,73,221,60,225,87,177,62,39,0,179,190,27,173,194,62,34,49,27,62,13,19,75,190,250,79,2,63,195,129,217,190,213,211,104,191,17,180,79,191,12,63,229,62,77,18,68,191,242,11,228,190,70,168,136,191,101,201,55,191,192,133,64,190,42,107,86,191,255,209,138,61,192,202,227,61,29,46,86,62,219,216,249,190,12,146,52,62,161,155,129,62,0,46,172,185,86,139,245,61,136,124,21,191,178,167,203,188,142,225,138,61,98,236,17,190,156,180,40,63,1,181,158,61,189,243,129,189,111,9,22,63,55,108,218,61,96,150,136,61,228,60,16,63,115,92,254,61,210,171,139,60,179,65,130,190,93,193,156,189,104,162,89,189,75,61,91,190,221,2,175,189,193,64,91,62,168,21,203,190,168,244,56,191,11,124,163,190,7,116,34,62,197,204,64,60,188,254,231,190,33,57,11,62,49,11,250,62,81,205,132,191,146,241,60,62,132,196,229,62,186,167,224,62,200,254,136,61,76,109,17,62,155,217,151,62,203,201,56,191,129,96,158,62,60,242,221,62,187,111,7,191,192,79,6,191,163,246,229,62,238,167,49,191,190,153,149,61,228,41,110,62,79,204,137,191,6,60,78,61,126,205,53,63,48,210,83,191,97,72,231,62,56,4,126,61,152,201,251,188,117,249,82,191,15,15,87,188,199,29,222,189,233,121,46,191,21,164,7,190,193,251,235,62,149,8,21,190,108,67,52,61,234,85,23,191,193,138,128,190,213,253,232,190,225,84,199,62,215,110,202,190,192,116,167,190,170,213,139,190,90,2,184,62,215,217,210,62,23,253,15,58,93,119,184,190,1,14,132,62,227,145,0,63,149,56,193,60,82,206,35,62,4,143,255,188,35,100,20,190,248,195,71,62,145,141,19,191,216,50,243,61,177,69,255,61,8,160,57,191,42,53,183,62,152,33,164,62,77,177,139,188,144,11,166,191,63,249,84,191,151,41,213,62,231,46,140,59,132,151,252,61,145,243,171,62,13,55,112,62,1,177,194,190,188,80,227,62,5,184,81,190,131,8,8,63,93,191,227,190,107,44,205,190,147,16,169,62,129,106,238,62,97,59,56,190,232,93,93,62,123,151,87,60,65,255,210,62,14,42,122,61,152,248,169,190,115,5,225,190,140,215,169,59,200,252,202,189,215,177,178,189,27,146,113,191,242,158,14,62,36,169,137,62,141,221,96,62,126,195,4,191,77,34,154,60,185,104,25,191,83,29,104,62,237,73,18,191,49,163,219,189,77,219,249,62,250,0,13,62,169,152,108,190,39,92,3,191,153,205,112,190,88,149,89,62,122,126,178,62,22,222,229,190,99,43,163,62,72,108,57,188,1,179,225,62,184,73,230,190,156,120,163,62,209,200,205,188,190,75,240,189,196,249,128,62,243,161,146,191,227,16,253,62,108,177,61,62,203,38,43,191,46,58,109,62,125,19,197,190,35,4,71,62,170,130,83,62,109,147,61,190,251,66,98,62,110,27,174,190,201,31,51,191,231,222,123,62,28,38,180,62,255,129,252,190,185,125,133,62,188,202,8,189,161,224,96,60,185,94,162,190,28,154,250,190,45,169,156,62,4,160,129,190,253,202,214,62,232,13,184,60,215,7,88,62,199,25,219,62,67,70,199,60,144,199,194,188,101,224,245,61,145,67,164,190,208,79,109,189,31,146,170,62,204,229,155,190,191,65,43,61,89,84,187,62,83,64,115,60,118,131,246,62,176,44,112,62,250,76,126,190,119,84,6,190,155,206,71,190,62,92,166,191,18,149,16,191,16,140,239,61,253,48,20,190,203,170,87,191,110,215,151,190,112,248,10,62,171,117,185,62,239,108,132,191,251,126,161,62,195,48,141,191,56,113,37,191,75,168,211,62,86,143,249,190,120,60,38,190,38,242,111,60,15,7,97,191,224,168,75,191,99,77,209,60,217,217,252,61,11,50,172,61,186,129,66,62,73,82,152,62,169,67,222,188,19,181,161,189,221,120,147,61,179,40,130,61,151,169,94,191,197,130,184,190,25,175,44,62,168,249,235,62,233,102,24,191,60,50,89,189,251,205,197,62,166,93,20,63,55,57,36,61,255,210,224,62,88,143,141,189,230,199,106,191,5,8,137,189,146,166,151,189,12,204,242,61,102,200,151,189,65,137,230,190,35,4,6,63,120,44,101,62,197,171,89,62,251,91,111,191,246,81,4,63,120,35,194,61,8,233,185,190,80,153,231,190,236,48,153,188,117,17,63,62,197,204,160,62,79,218,170,189,174,210,211,61,224,98,148,189,48,51,127,189,4,125,247,188,166,208,159,189,45,225,53,62,218,163,182,190,128,132,172,61,62,251,212,61,41,50,187,190,142,196,94,62,42,76,34,62,184,42,171,190,229,151,242,60,230,100,188,190,199,139,57,61,156,5,159,61,12,43,129,189,175,44,230,62,179,199,19,189,50,97,253,188,30,53,213,62,63,94,47,62,52,186,234,188,53,58,11,187,208,37,8,191,222,114,109,61,170,75,112,189,204,111,60,61,96,168,183,61,84,87,209,61,165,24,1,62,107,12,254,59,53,131,9,190,105,144,12,62,249,176,64,190,186,180,163,62,108,64,154,62,216,80,129,190,90,129,146,62,220,47,124,190,85,46,165,190,22,169,217,61,230,118,220,61,152,39,29,190,72,209,172,61,20,175,92,190,121,97,234,189,49,92,125,62,72,73,215,62,201,141,151,61,23,235,95,189,95,65,174,62,118,26,153,62,24,93,0,60,198,73,209,60,14,139,161,61,203,133,241,189,243,252,61,61,20,16,8,62,214,146,98,61,151,45,210,189,214,255,31,189,136,73,3,190,153,14,92,190,120,0,209,189,190,138,193,62,67,209,223,189,33,4,216,190,251,103,60,62,26,184,235,188,135,150,210,61,84,27,27,190,143,159,138,190,253,133,27,62,177,230,192,62,134,126,133,62,21,23,146,189,66,230,22,189,7,168,12,190,70,152,87,190,64,45,7,190,21,125,20,190,42,89,78,190,238,164,109,62,30,231,17,190,210,65,10,61,194,139,89,60,26,14,251,61,97,123,21,190,61,189,52,62,191,133,115,190,37,192,33,191,223,58,178,62,238,183,255,190,95,114,148,61,228,227,58,62,70,191,244,190,240,235,5,191,52,34,40,62,215,251,187,62,52,136,6,190,89,5,77,188,90,194,123,187,159,82,43,190,57,130,53,62,86,19,58,60,255,60,41,190,171,245,184,61,190,114,100,62,3,239,80,62,126,68,242,62,35,100,113,61,113,242,48,62,254,115,187,61,90,37,58,62,77,10,133,190,70,146,15,191,53,60,170,190,96,30,12,190,145,76,61,189,137,207,138,60,116,34,68,60,202,26,149,187,130,38,56,56,155,53,166,190,120,65,193,190,183,238,173,190,224,84,104,61,180,204,60,62,24,32,51,62,196,208,133,189,60,200,118,62,167,141,8,190,163,17,190,61,95,142,167,190,130,16,164,61,185,177,192,61,152,131,105,189,171,175,104,189,106,136,195,62,239,137,69,190,8,215,162,189,206,164,100,190,172,1,175,190,104,224,71,61,80,100,2,190,70,130,194,190,164,167,152,190,22,38,11,190,141,11,32,190,3,22,13,62,3,194,112,190,13,81,128,62,86,128,251,190,131,205,125,62,37,209,35,62,93,250,225,190,183,215,243,60,225,57,247,60,36,155,94,62,5,88,244,61,149,27,117,186,102,87,39,